* # [IO tools (text, CSV, HDF5, …)](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
The pandas I/O API is a set of top level reader functions accessed like pandas.read_csv() that generally return a pandas object. The corresponding writer functions are object methods that are accessed like DataFrame.to_csv(). Below is a table containing available readers and writers.

| Format Type | Data Description      | Reader         | Writer       |
|-------------|-----------------------|----------------|--------------|
| text        | CSV                   | read_csv       | to_csv       |
| text        | Fixed-Width Text File | read_fwf       |              |
| text        | JSON                  | read_json      | to_json      |
| text        | HTML                  | read_html      | to_html      |
| text        | Local clipboard       | read_clipboard | to_clipboard |
| binary      | MS Excel              | read_excel     | to_excel     |
| binary      | OpenDocument          | read_excel     |              |
| binary      | HDF5 Format           | read_hdf       | to_hdf       |
| binary      | Feather Format        | read_feather   | to_feather   |
| binary      | Parquet Format        | read_parquet   | to_parquet   |
| binary      | ORC Format            | read_orc       |              |
| binary      | Msgpack               | read_msgpack   | to_msgpack   |
| binary      | Stata                 | read_stata     | to_stata     | 
| binary      | SAS                   | read_sas       |              |
| binary      | SPSS                  | read_spss      |              |
| binary      | Python Pickle Format  | read_pickle    | to_pickle    |
| SQL         | SQL                   | read_sql       | to_sql       |
| SQL         | Google BigQuery       | read_gbq       | to_gbq       |

Here is an informal performance comparison for some of these IO methods.

>Note
>
>For examples that use the StringIO class, make sure you import it with from io import StringIO for Python 3.

----

## CSV & text files
The workhorse function for reading text files (a.k.a. flat files) is read_csv(). See the cookbook for some advanced strategies.

### Parsing options
read_csv() accepts the following common arguments:

#### Basic
**filepath_or_buffervarious**
Either a path to a file (a str, pathlib.Path, or py._path.local.LocalPath), URL (including http, ftp, and S3 locations), or any object with a read() method (such as an open file or StringIO).

**sep : str, defaults to** ',' for read_csv(), \t for read_table()
Delimiter to use. If sep is None, the C engine cannot automatically detect the separator, but the Python parsing engine can, meaning the latter will be used and automatically detect the separator by Python’s builtin sniffer tool, csv.Sniffer. In addition, separators longer than 1 character and different from '\s+' will be interpreted as regular expressions and will also force the use of the Python parsing engine. Note that regex delimiters are prone to ignoring quoted data. Regex example: '\\r\\t'.

**delimiterstr, default** None
Alternative argument name for sep.

**delim_whitespace** : boolean, default False
Specifies whether or not whitespace (e.g. ' ' or '\t') will be used as the delimiter. Equivalent to setting sep='\s+'. If this option is set to True, nothing should be passed in for the delimiter parameter.

#### Column and index locations and names
**header** : int or list of ints, default 'infer'
Row number(s) to use as the column names, and the start of the data. Default behavior is to infer the column names: if no names are passed the behavior is identical to header=0 and column names are inferred from the first line of the file, if column names are passed explicitly then the behavior is identical to header=None. Explicitly pass header=0 to be able to replace existing names.

The header can be a list of ints that specify row locations for a MultiIndex on the columns e.g. [0,1,3]. Intervening rows that are not specified will be skipped (e.g. 2 in this example is skipped). Note that this parameter ignores commented lines and empty lines if skip_blank_lines=True, so header=0 denotes the first line of data rather than the first line of the file.

**names** : array-like, default None
List of column names to use. If file contains no header row, then you should explicitly pass header=None. Duplicates in this list are not allowed.

**index_col** : int, str, sequence of int / str, or False, default None
Column(s) to use as the row labels of the DataFrame, either given as string name or column index. If a sequence of int / str is given, a MultiIndex is used.

Note: index_col=False can be used to force pandas to not use the first column as the index, e.g. when you have a malformed file with delimiters at the end of each line.

The default value of None instructs pandas to guess. If the number of fields in the column header row is equal to the number of fields in the body of the data file, then a default index is used. If it is one larger, then the first field is used as an index.

**usecols** : list-like or callable, default None
Return a subset of the columns. If list-like, all elements must either be positional (i.e. integer indices into the document columns) or strings that correspond to column names provided either by the user in names or inferred from the document header row(s). For example, a valid list-like usecols parameter would be [0, 1, 2] or ['foo', 'bar', 'baz'].

Element order is ignored, so usecols=[0, 1] is the same as [1, 0]. To instantiate a DataFrame from data with element order preserved use pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']] for columns in ['foo', 'bar'] order or pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']] for ['bar', 'foo'] order.

If callable, the callable function will be evaluated against the column names, returning names where the callable function evaluates to True:

In [1]:
import pandas as pd
from io import StringIO
data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"
pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [2]:
pd.read_csv(StringIO(data), 
            usecols=lambda x: x.upper() in ["COL1", "COL3"])

  col1  col3
0    a     1
1    a     2
2    c     3

Using this parameter results in much faster parsing time and lower memory usage.

squeezeboolean, default False
If the parsed data only contains one column then return a Series.

prefixstr, default None
Prefix to add to column numbers when no header, e.g. ‘X’ for X0, X1, …

mangle_dupe_colsboolean, default True
Duplicate columns will be specified as ‘X’, ‘X.1’…’X.N’, rather than ‘X’…’X’. Passing in False will cause data to be overwritten if there are duplicate names in the columns.

#### General parsing configuration
dtypeType name or dict of column -> type, default None
Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32} (unsupported with engine='python'). Use str or object together with suitable na_values settings to preserve and not interpret dtype.

engine{'c', 'python'}
Parser engine to use. The C engine is faster while the Python engine is currently more feature-complete.

convertersdict, default None
Dict of functions for converting values in certain columns. Keys can either be integers or column labels.

true_valueslist, default None
Values to consider as True.

false_valueslist, default None
Values to consider as False.

skipinitialspaceboolean, default False
Skip spaces after delimiter.

skiprowslist-like or integer, default None
Line numbers to skip (0-indexed) or number of lines to skip (int) at the start of the file.

If callable, the callable function will be evaluated against the row indices, returning True if the row should be skipped and False otherwise:

In [3]:
data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"
pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [4]:
pd.read_csv(StringIO(data), 
            skiprows=lambda x: x % 2 != 0)

  col1 col2  col3
0    a    b     2

skipfooterint, default 0
Number of lines at bottom of file to skip (unsupported with engine=’c’).

nrowsint, default None
Number of rows of file to read. Useful for reading pieces of large files.

low_memoryboolean, default True
Internally process the file in chunks, resulting in lower memory use while parsing, but possibly mixed type inference. To ensure no mixed types either set False, or specify the type with the dtype parameter. Note that the entire file is read into a single DataFrame regardless, use the chunksize or iterator parameter to return the data in chunks. (Only valid with C parser)

memory_mapboolean, default False
If a filepath is provided for filepath_or_buffer, map the file object directly onto memory and access the data directly from there. Using this option can improve performance because there is no longer any I/O overhead.

#### NA and missing data handling
na_valuesscalar, str, list-like, or dict, default None
Additional strings to recognize as NA/NaN. If dict passed, specific per-column NA values. See na values const below for a list of the values interpreted as NaN by default.

keep_default_naboolean, default True
Whether or not to include the default NaN values when parsing the data. Depending on whether na_values is passed in, the behavior is as follows:

If keep_default_na is True, and na_values are specified, na_values is appended to the default NaN values used for parsing.

If keep_default_na is True, and na_values are not specified, only the default NaN values are used for parsing.

If keep_default_na is False, and na_values are specified, only the NaN values specified na_values are used for parsing.

If keep_default_na is False, and na_values are not specified, no strings will be parsed as NaN.

Note that if na_filter is passed in as False, the keep_default_na and na_values parameters will be ignored.

na_filterboolean, default True
Detect missing value markers (empty strings and the value of na_values). In data without any NAs, passing na_filter=False can improve the performance of reading a large file.

verboseboolean, default False
Indicate number of NA values placed in non-numeric columns.

skip_blank_linesboolean, default True
If True, skip over blank lines rather than interpreting as NaN values.

#### Datetime handling
parse_datesboolean or list of ints or names or list of lists or dict, default False.
If True -> try parsing the index.

If [1, 2, 3] -> try parsing columns 1, 2, 3 each as a separate date column.

If [[1, 3]] -> combine columns 1 and 3 and parse as a single date column.

If {'foo': [1, 3]} -> parse columns 1, 3 as date and call result ‘foo’. A fast-path exists for iso8601-formatted dates.

infer_datetime_formatboolean, default False
If True and parse_dates is enabled for a column, attempt to infer the datetime format to speed up the processing.

keep_date_colboolean, default False
If True and parse_dates specifies combining multiple columns then keep the original columns.

date_parserfunction, default None
Function to use for converting a sequence of string columns to an array of datetime instances. The default uses dateutil.parser.parser to do the conversion. pandas will try to call date_parser in three different ways, advancing to the next if an exception occurs: 1) Pass one or more arrays (as defined by parse_dates) as arguments; 2) concatenate (row-wise) the string values from the columns defined by parse_dates into a single array and pass that; and 3) call date_parser once for each row using one or more strings (corresponding to the columns defined by parse_dates) as arguments.

dayfirstboolean, default False
DD/MM format dates, international and European format.

cache_datesboolean, default True
If True, use a cache of unique, converted dates to apply the datetime conversion. May produce significant speed-up when parsing duplicate date strings, especially ones with timezone offsets.

New in version 0.25.0.

#### Iteration
iteratorboolean, default False
Return TextFileReader object for iteration or getting chunks with get_chunk().

chunksizeint, default None
Return TextFileReader object for iteration. See iterating and chunking below.

#### Quoting, compression, and file format
compression{'infer', 'gzip', 'bz2', 'zip', 'xz', None, dict}, default 'infer'
For on-the-fly decompression of on-disk data. If ‘infer’, then use gzip, bz2, zip, or xz if filepath_or_buffer is path-like ending in ‘.gz’, ‘.bz2’, ‘.zip’, or ‘.xz’, respectively, and no decompression otherwise. If using ‘zip’, the ZIP file must contain only one data file to be read in. Set to None for no decompression. Can also be a dict with key 'method' set to one of {'zip', 'gzip', 'bz2'} and other key-value pairs are forwarded to zipfile.ZipFile, gzip.GzipFile, or bz2.BZ2File. As an example, the following could be passed for faster compression and to create a reproducible gzip archive: compression={'method': 'gzip', 'compresslevel': 1, 'mtime': 1}.

Changed in version 0.24.0: ‘infer’ option added and set to default.

Changed in version 1.1.0: dict option extended to support gzip and bz2.

Changed in version 1.2.0: Previous versions forwarded dict entries for ‘gzip’ to gzip.open.

thousandsstr, default None
Thousands separator.

decimalstr, default '.'
Character to recognize as decimal point. E.g. use ',' for European data.

float_precisionstring, default None
Specifies which converter the C engine should use for floating-point values. The options are None for the ordinary converter, high for the high-precision converter, and round_trip for the round-trip converter.

lineterminatorstr (length 1), default None
Character to break file into lines. Only valid with C parser.

quotecharstr (length 1)
The character used to denote the start and end of a quoted item. Quoted items can include the delimiter and it will be ignored.

quotingint or csv.QUOTE_* instance, default 0
Control field quoting behavior per csv.QUOTE_* constants. Use one of QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).

doublequoteboolean, default True
When quotechar is specified and quoting is not QUOTE_NONE, indicate whether or not to interpret two consecutive quotechar elements inside a field as a single quotechar element.

escapecharstr (length 1), default None
One-character string used to escape delimiter when quoting is QUOTE_NONE.

commentstr, default None
Indicates remainder of line should not be parsed. If found at the beginning of a line, the line will be ignored altogether. This parameter must be a single character. Like empty lines (as long as skip_blank_lines=True), fully commented lines are ignored by the parameter header but not by skiprows. For example, if comment='#', parsing ‘#empty\na,b,c\n1,2,3’ with header=0 will result in ‘a,b,c’ being treated as the header.

encodingstr, default None
Encoding to use for UTF when reading/writing (e.g. 'utf-8'). List of Python standard encodings.

dialectstr or csv.Dialect instance, default None
If provided, this parameter will override values (default or not) for the following parameters: delimiter, doublequote, escapechar, skipinitialspace, quotechar, and quoting. If it is necessary to override values, a ParserWarning will be issued. See csv.Dialect documentation for more details.

#### Error handling
error_bad_linesboolean, default True
Lines with too many fields (e.g. a csv line with too many commas) will by default cause an exception to be raised, and no DataFrame will be returned. If False, then these “bad lines” will dropped from the DataFrame that is returned. See bad lines below.

warn_bad_linesboolean, default True
If error_bad_lines is False, and warn_bad_lines is True, a warning for each “bad line” will be output.

## Specifying column data types
You can indicate the data type for the whole DataFrame or individual columns:

In [5]:
# UTILITY: copy the files from `/data/bak` to `/data`
import os
import shutil

def recursive_copy(src, dest):
    """
    Copy each file from src dir to dest dir, including sub-directories.
    """
    for item in os.listdir(src):
        file_path = os.path.join(src, item)

        # if item is a file, copy it
        if os.path.isfile(file_path):
            shutil.copy(file_path, dest)

        # else if item is a folder, recurse 
        elif os.path.isdir(file_path):
            new_dest = os.path.join(dest, item)
            os.mkdir(new_dest)
            recursive_copy(file_path, new_dest)
recursive_copy('archive/','data/')

In [6]:
import numpy as np
data = "a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11"
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [7]:
df = pd.read_csv(StringIO(data), 
                 dtype=object)
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [8]:
df["a"][0]

'1'

In [9]:
df = pd.read_csv(StringIO(data), 
                 dtype={"b": object, "c": np.float64, "d": "Int64"})
df.dtypes

a      int64
b     object
c    float64
d      Int64
dtype: object

Fortunately, pandas offers more than one way to ensure that your column(s) contain only one dtype. If you’re unfamiliar with these concepts, you can see here to learn more about dtypes, and here to learn more about object conversion in pandas.

For instance, you can use the converters argument of read_csv():

In [10]:
data = "col_1\n1\n2\n'A'\n4.22"
df = pd.read_csv(StringIO(data), 
                 converters={"col_1": str})
df

  col_1
0     1
1     2
2   'A'
3  4.22

In [11]:
df["col_1"].apply(type).value_counts()

<class 'str'>    4
Name: col_1, dtype: int64

Or you can use the to_numeric() function to coerce the dtypes after reading in the data,

In [12]:
df2 = pd.read_csv(StringIO(data))
df2["col_1"] = pd.to_numeric(df2["col_1"], 
                             errors="coerce")
df2

   col_1
0   1.00
1   2.00
2    NaN
3   4.22

In [13]:
df2["col_1"].apply(type).value_counts()

<class 'float'>    4
Name: col_1, dtype: int64

which will convert all valid parsing to floats, leaving the invalid parsing as NaN.

Ultimately, how you deal with reading in columns containing mixed dtypes depends on your specific needs. In the case above, if you wanted to NaN out the data anomalies, then to_numeric() is probably your best option. However, if you wanted for all the data to be coerced, no matter the type, then using the converters argument of read_csv() would certainly be worth trying.

>Note
>
>In some cases, reading in abnormal data with columns containing mixed dtypes will result in an inconsistent dataset. If you rely on pandas to infer the dtypes of your columns, the parsing engine will go and infer the dtypes for different chunks of the data, rather than the whole dataset at once. Consequently, you can end up with column(s) with mixed dtypes. For example,

In [14]:
col_1 = list(range(500000)) + ["a", "b"] + list(range(500000))
df = pd.DataFrame({"col_1": col_1})
df.to_csv("data/file04_01.csv")
mixed_df = pd.read_csv("data/file04_01.csv")
mixed_df["col_1"].apply(type).value_counts()

C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

<class 'int'>    737858
<class 'str'>    262144
Name: col_1, dtype: int64

In [15]:
mixed_df["col_1"].dtype

dtype('O')

>will result with mixed_df containing an int dtype for certain chunks of the column, and str for others due to the mixed dtypes from the data that was read in. It is important to note that the overall column will be marked with a dtype of object, which is used for columns with mixed dtypes.

## Specifying categorical dtype
Categorical columns can be parsed directly by specifying dtype='category' or dtype=CategoricalDtype(categories, ordered).

In [16]:
data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"
pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [17]:
pd.read_csv(StringIO(data)).dtypes

col1    object
col2    object
col3     int64
dtype: object

In [18]:
pd.read_csv(StringIO(data), 
            dtype="category").dtypes

col1    category
col2    category
col3    category
dtype: object

Individual columns can be parsed as a Categorical using a dict specification:

In [19]:
pd.read_csv(StringIO(data), 
            dtype={"col1": "category"}).dtypes

col1    category
col2      object
col3       int64
dtype: object

Specifying dtype='category' will result in an unordered Categorical whose categories are the unique values observed in the data. For more control on the categories and order, create a CategoricalDtype ahead of time, and pass that for that column’s dtype.

In [20]:
from pandas.api.types import CategoricalDtype
dtype = CategoricalDtype(["d", "c", "b", "a"], 
                         ordered=True)
pd.read_csv(StringIO(data), 
            dtype={"col1": dtype}).dtypes

col1    category
col2      object
col3       int64
dtype: object

When using dtype=CategoricalDtype, “unexpected” values outside of dtype.categories are treated as missing values.

In [21]:
dtype = CategoricalDtype(["a", "b", "d"])  # No 'c'
pd.read_csv(StringIO(data), 
            dtype={"col1": dtype}).col1

0      a
1      a
2    NaN
Name: col1, dtype: category
Categories (3, object): ['a', 'b', 'd']

This matches the behavior of Categorical.set_categories().

>Note
>
>With dtype='category', the resulting categories will always be parsed as strings (object dtype). If the categories are numeric they can be converted using the to_numeric() function, or as appropriate, another converter such as to_datetime().
>
>When dtype is a CategoricalDtype with homogeneous categories ( all numeric, all datetimes, etc.), the conversion is done automatically.

In [22]:
df = pd.read_csv(StringIO(data), 
                 dtype="category")
df.dtypes

col1    category
col2    category
col3    category
dtype: object

In [23]:
df["col3"]

0    1
1    2
2    3
Name: col3, dtype: category
Categories (3, object): ['1', '2', '3']

In [24]:
df["col3"].cat.categories = pd.to_numeric(df["col3"].cat.categories)
df["col3"]

0    1
1    2
2    3
Name: col3, dtype: category
Categories (3, int64): [1, 2, 3]

## Naming and using columns
### Handling column names
A file may or may not have a header row. pandas assumes the first row should be used as the column names:

In [25]:
data = "a,b,c\n1,2,3\n4,5,6\n7,8,9"
print(data)

a,b,c
1,2,3
4,5,6
7,8,9

In [26]:
pd.read_csv(StringIO(data))

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

By specifying the names argument in conjunction with header you can indicate other names to use and whether or not to throw away the header row (if any):

In [27]:
print(data)

a,b,c
1,2,3
4,5,6
7,8,9

In [28]:
pd.read_csv(StringIO(data), 
            names=["foo", "bar", "baz"], 
            header=0)

   foo  bar  baz
0    1    2    3
1    4    5    6
2    7    8    9

In [29]:
pd.read_csv(StringIO(data), 
            names=["foo", "bar", "baz"], 
            header=None)

  foo bar baz
0   a   b   c
1   1   2   3
2   4   5   6
3   7   8   9

If the header is in a row other than the first, pass the row number to header. This will skip the preceding rows:

In [30]:
data = "skip this skip it\na,b,c\n1,2,3\n4,5,6\n7,8,9"
pd.read_csv(StringIO(data), 
            header=1)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

>Note
>
>Default behavior is to infer the column names: if no names are passed the behavior is identical to header=0 and column names are inferred from the first non-blank line of the file, if column names are passed explicitly then the behavior is identical to header=None.

## Duplicate names parsing
If the file or header contains duplicate names, pandas will by default distinguish between them so as to prevent overwriting data:

In [31]:
data = "a,b,a\n0,1,2\n3,4,5"
pd.read_csv(StringIO(data))

   a  b  a.1
0  0  1    2
1  3  4    5

There is no more duplicate data because mangle_dupe_cols=True by default, which modifies a series of duplicate columns ‘X’, …, ‘X’ to become ‘X’, ‘X.1’, …, ‘X.N’. If mangle_dupe_cols=False, duplicate data can arise:

In [32]:
import sys
data = 'a,b,a\n0,1,2\n3,4,5'
try:
    pd.read_csv(StringIO(data), 
                mangle_dupe_cols=False)
except:
    print("Unexpected error:", sys.exc_info()[0])
    print("ValueError: Setting mangle_dupe_cols=False is not supported yet")

Unexpected error: <class 'ValueError'>
ValueError: Setting mangle_dupe_cols=False is not supported yet

To prevent users from encountering this problem with duplicate data, a ValueError exception is raised if mangle_dupe_cols != True:

In [33]:
import sys
data = 'a,b,a\n0,1,2\n3,4,5'
try:
    pd.read_csv(StringIO(data), 
                mangle_dupe_cols=False)
except:
    print("Unexpected error:", sys.exc_info()[0])
    print("ValueError: Setting mangle_dupe_cols=False is not supported yet")

Unexpected error: <class 'ValueError'>
ValueError: Setting mangle_dupe_cols=False is not supported yet

### Filtering columns (usecols)
The usecols argument allows you to select any subset of the columns in a file, either using the column names, position numbers or a callable:

In [34]:
data = "a,b,c,d\n1,2,3,foo\n4,5,6,bar\n7,8,9,baz"
pd.read_csv(StringIO(data))

   a  b  c    d
0  1  2  3  foo
1  4  5  6  bar
2  7  8  9  baz

In [35]:
pd.read_csv(StringIO(data), 
            usecols=["b", "d"])

   b    d
0  2  foo
1  5  bar
2  8  baz

In [36]:
pd.read_csv(StringIO(data), 
            usecols=[0, 2, 3])

   a  c    d
0  1  3  foo
1  4  6  bar
2  7  9  baz

In [37]:
pd.read_csv(StringIO(data), 
            usecols=lambda x: x.upper() in ["A", "C"])

   a  c
0  1  3
1  4  6
2  7  9

The usecols argument can also be used to specify which columns not to use in the final result:

In [38]:
pd.read_csv(StringIO(data), 
            usecols=lambda x: x not in ["a", "c"])

   b    d
0  2  foo
1  5  bar
2  8  baz

In this case, the callable is specifying that we exclude the “a” and “c” columns from the output.

## Comments and empty lines
### Ignoring line comments and empty lines
If the comment parameter is specified, then completely commented lines will be ignored. By default, completely blank lines will be ignored as well.

In [39]:
data = "\na,b,c\n  \n# commented line\n1,2,3\n\n4,5,6"
print(data)

a,b,c

# commented line
1,2,3

4,5,6

In [40]:
pd.read_csv(StringIO(data), 
            comment="#")

   a  b  c
0  1  2  3
1  4  5  6

If skip_blank_lines=False, then read_csv will not ignore blank lines:

In [41]:
data = "a,b,c\n\n1,2,3\n\n\n4,5,6"
pd.read_csv(StringIO(data), 
            skip_blank_lines=False)

     a    b    c
0  NaN  NaN  NaN
1  1.0  2.0  3.0
2  NaN  NaN  NaN
3  NaN  NaN  NaN
4  4.0  5.0  6.0

>Warning
>
>The presence of ignored lines might create ambiguities involving line numbers; the parameter header uses row numbers (ignoring commented/empty lines), while skiprows uses line numbers (including commented/empty lines):

In [42]:
data = "#comment\na,b,c\nA,B,C\n1,2,3"
pd.read_csv(StringIO(data), 
            comment="#", 
            header=1)

   A  B  C
0  1  2  3

In [43]:
data = "A,B,C\n#comment\na,b,c\n1,2,3"
pd.read_csv(StringIO(data), 
            comment="#", 
            skiprows=2)

   a  b  c
0  1  2  3

>If both header and skiprows are specified, header will be relative to the end of skiprows. For example:

In [44]:
data = (
    "# empty\n"
    "# second empty line\n"
    "# third emptyline\n"
    "X,Y,Z\n"
    "1,2,3\n"
    "A,B,C\n"
    "1,2.,4.\n"
    "5.,NaN,10.0\n"
)
print(data)

# empty
# second empty line
# third emptyline
X,Y,Z
1,2,3
A,B,C
1,2.,4.
5.,NaN,10.0

In [45]:
pd.read_csv(StringIO(data), 
            comment="#", 
            skiprows=4, 
            header=1)

     A    B     C
0  1.0  2.0   4.0
1  5.0  NaN  10.0

### Comments
Sometimes comments or meta data may be included in a file:

In [46]:
df_tmp = pd.DataFrame(
    {
        "ID"       : ["Patient1", "Patient2", "Patient2"],
        "level"    : [123000, 23000, 1234018],
        "category" : ["x # really unpleasant", "y # wouldn't take his medicine", "z # awesome"]
    },
    index = [0, 1, 2]
)
df_tmp.to_csv("data/file04_02.csv", 
              header=True)

In [47]:
print(open("data/file04_02.csv").read())

,ID,level,category
0,Patient1,123000,x # really unpleasant
1,Patient2,23000,y # wouldn't take his medicine
2,Patient2,1234018,z # awesome

By default, the parser includes the comments in the output:

In [48]:
df = pd.read_csv("data/file04_02.csv")
df

   Unnamed: 0        ID    level                        category
0           0  Patient1   123000           x # really unpleasant
1           1  Patient2    23000  y # wouldn't take his medicine
2           2  Patient2  1234018                     z # awesome

We can suppress the comments using the comment keyword:

In [49]:
df = pd.read_csv("data/file04_02.csv", comment="#")
df

   Unnamed: 0        ID    level category
0           0  Patient1   123000       x
1           1  Patient2    23000       y
2           2  Patient2  1234018       z

### Dealing with Unicode data
The encoding argument should be used for encoded unicode data, which will result in byte strings being decoded to unicode in the result:

In [50]:
from io import BytesIO
data = b"word,length\n" b"Tr\xc3\xa4umen,7\n" b"Gr\xc3\xbc\xc3\x9fe,5"
data = data.decode("utf8").encode("latin-1")
df = pd.read_csv(BytesIO(data), 
                 encoding="latin-1")
df

      word  length
0  Träumen       7
1    Grüße       5

In [51]:
df["word"][1]

'Grüße'

Some formats which encode all characters as multiple bytes, like UTF-16, won’t parse correctly at all without specifying the encoding. Full list of Python standard encodings.

### Index columns and trailing delimiters
If a file has one more column of data than the number of column names, the first column will be used as the DataFrame’s row names:

In [52]:
data = "a,b,c\n4,apple,bat,5.7\n8,orange,cow,10"
pd.read_csv(StringIO(data))

        a    b     c
4   apple  bat   5.7
8  orange  cow  10.0

In [53]:
data = "index,a,b,c\n4,apple,bat,5.7\n8,orange,cow,10"
pd.read_csv(StringIO(data), 
            index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

Ordinarily, you can achieve this behavior using the index_col option.

There are some exception cases when a file has been prepared with delimiters at the end of each data line, confusing the parser. To explicitly disable the index column inference and discard the last column, pass index_col=False:

In [54]:
data = "a,b,c\n4,apple,bat,\n8,orange,cow,"
print(data)

a,b,c
4,apple,bat,
8,orange,cow,

In [55]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [56]:
pd.read_csv(StringIO(data), 
            index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

If a subset of data is being parsed using the usecols option, the index_col specification is based on that subset, not the original data.

In [57]:
data = "a,b,c\n4,apple,bat,\n8,orange,cow,"
print(data)

a,b,c
4,apple,bat,
8,orange,cow,

In [58]:
pd.read_csv(StringIO(data), 
            usecols=["b", "c"])

     b   c
4  bat NaN
8  cow NaN

In [59]:
pd.read_csv(StringIO(data), 
            usecols=["b", "c"], 
            index_col=0)

     b   c
4  bat NaN
8  cow NaN

## Date Handling
### Specifying date columns
To better facilitate working with datetime data, read_csv() uses the keyword arguments parse_dates and date_parser to allow users to specify a variety of columns and date/time formats to turn the input text data into datetime objects.

The simplest case is to just pass in parse_dates=True:

In [60]:
df_foo = pd.DataFrame(
    {
        "A" : ["a", "b", "c"],
        "B" : [1, 3, 4],
        "C" : [2, 4, 5]
    },
    index = pd.date_range("1/1/2009", periods=3),
)
df_foo.index.name = "date"
print(df_foo)
df_foo.to_csv("data/file04_03.csv", 
              header=True)

            A  B  C
date
2009-01-01  a  1  2
2009-01-02  b  3  4
2009-01-03  c  4  5

In [61]:
# Use a column as an index, and parse it as dates.
df = pd.read_csv("data/file04_03.csv", 
                 index_col=0, 
                 parse_dates=True)
df

            A  B  C
date
2009-01-01  a  1  2
2009-01-02  b  3  4
2009-01-03  c  4  5

In [62]:
# These are Python datetime objects
df.index

DatetimeIndex(['2009-01-01', '2009-01-02', '2009-01-03'], dtype='datetime64[ns]', name='date', freq=None)

It is often the case that we may want to store date and time data separately, or store various date fields separately. the parse_dates keyword can be used to specify a combination of columns to parse the dates and/or times from.

You can specify a list of column lists to parse_dates, the resulting date columns will be prepended to the output (so as to not affect the existing column order) and the new column names will be the concatenation of the component column names:

In [63]:
df_tmp = pd.DataFrame(
    {
        1 : ["KORD", "KORD", "KORD", "KORD", "KORD", "KORD"],
        2 : [19990127, 19990127, 19990127, 19990127, 19990127, 19990127],
        3 : ["19:00:00", "20:00:00", "21:00:00", "21:00:00", "22:00:00", "23:00:00", ],
        4 : ["18:56:00", "19:56:00", "20:56:00", "21:18:00", "21:56:00", "22:56:00"],
        5 : [0.8100, 0.0100, -0.5900, -0.9900, -0.5900, -0.590],
    },
)

print(df_tmp)
df_tmp.to_csv("data/file04_04.csv", 
              header=False, 
              index=False)

      1         2         3         4     5
0  KORD  19990127  19:00:00  18:56:00  0.81
1  KORD  19990127  20:00:00  19:56:00  0.01
2  KORD  19990127  21:00:00  20:56:00 -0.59
3  KORD  19990127  21:00:00  21:18:00 -0.99
4  KORD  19990127  22:00:00  21:56:00 -0.59
5  KORD  19990127  23:00:00  22:56:00 -0.59

In [64]:
print(open("data/file04_04.csv").read())

KORD,19990127,19:00:00,18:56:00,0.81
KORD,19990127,20:00:00,19:56:00,0.01
KORD,19990127,21:00:00,20:56:00,-0.59
KORD,19990127,21:00:00,21:18:00,-0.99
KORD,19990127,22:00:00,21:56:00,-0.59
KORD,19990127,23:00:00,22:56:00,-0.59

In [65]:
df = pd.read_csv("data/file04_04.csv", 
                 header=None, 
                 parse_dates=[[1, 2], [1, 3]])
df

                  1_2                 1_3     0     4
0 1999-01-27 19:00:00 1999-01-27 18:56:00  KORD  0.81
1 1999-01-27 20:00:00 1999-01-27 19:56:00  KORD  0.01
2 1999-01-27 21:00:00 1999-01-27 20:56:00  KORD -0.59
3 1999-01-27 21:00:00 1999-01-27 21:18:00  KORD -0.99
4 1999-01-27 22:00:00 1999-01-27 21:56:00  KORD -0.59
5 1999-01-27 23:00:00 1999-01-27 22:56:00  KORD -0.59

By default the parser removes the component date columns, but you can choose to retain them via the keep_date_col keyword:

In [66]:
df = pd.read_csv(
    "data/file04_04.csv", 
    header=None, 
    parse_dates=[[1, 2], [1, 3]], 
    keep_date_col=True
)
df

,1_2,1_3,0,1,2,3,4
0,1999-01-27 19:00:00,1999-01-27 18:56:00,KORD,19990127,19:00:00,18:56:00,0.81
1,1999-01-27 20:00:00,1999-01-27 19:56:00,KORD,19990127,20:00:00,19:56:00,0.01
2,1999-01-27 21:00:00,1999-01-27 20:56:00,KORD,19990127,21:00:00,20:56:00,-0.59
3,1999-01-27 21:00:00,1999-01-27 21:18:00,KORD,19990127,21:00:00,21:18:00,-0.99
4,1999-01-27 22:00:00,1999-01-27 21:56:00,KORD,19990127,22:00:00,21:56:00,-0.59
5,1999-01-27 23:00:00,1999-01-27 22:56:00,KORD,19990127,23:00:00,22:56:00,-0.59

Note that if you wish to combine multiple columns into a single date column, a nested list must be used. In other words, parse_dates=[1, 2] indicates that the second and third columns should each be parsed as separate date columns while parse_dates=[[1, 2]] means the two columns should be parsed into a single column.

You can also use a dict to specify custom name columns:

In [67]:
date_spec = {"nominal": [1, 2], "actual": [1, 3]}
df = pd.read_csv("data/file04_04.csv", 
                 header=None, 
                 parse_dates=date_spec)
df

              nominal              actual     0     4
0 1999-01-27 19:00:00 1999-01-27 18:56:00  KORD  0.81
1 1999-01-27 20:00:00 1999-01-27 19:56:00  KORD  0.01
2 1999-01-27 21:00:00 1999-01-27 20:56:00  KORD -0.59
3 1999-01-27 21:00:00 1999-01-27 21:18:00  KORD -0.99
4 1999-01-27 22:00:00 1999-01-27 21:56:00  KORD -0.59
5 1999-01-27 23:00:00 1999-01-27 22:56:00  KORD -0.59

It is important to remember that if multiple text columns are to be parsed into a single date column, then a new column is prepended to the data. The index_col specification is based off of this new set of columns rather than the original data columns:

In [68]:
date_spec = {"nominal": [1, 2], "actual": [1, 3]}
df = pd.read_csv(
    "data/file04_04.csv", 
    header=None, 
    parse_dates=date_spec, 
    index_col=0
)  # index is the nominal column
df

                                 actual     0     4
nominal
1999-01-27 19:00:00 1999-01-27 18:56:00  KORD  0.81
1999-01-27 20:00:00 1999-01-27 19:56:00  KORD  0.01
1999-01-27 21:00:00 1999-01-27 20:56:00  KORD -0.59
1999-01-27 21:00:00 1999-01-27 21:18:00  KORD -0.99
1999-01-27 22:00:00 1999-01-27 21:56:00  KORD -0.59
1999-01-27 23:00:00 1999-01-27 22:56:00  KORD -0.59

>Note
>
>If a column or index contains an unparsable date, the entire column or index will be returned unaltered as an object data type. For non-standard datetime parsing, use to_datetime() after pd.read_csv.

>Note
>
>read_csv has a fast_path for parsing datetime strings in iso8601 format, e.g “2000-01-01T00:01:02+00:00” and similar variations. If you can arrange for your data to store datetimes in this format, load times will be significantly faster, ~20x has been observed.

### Date parsing functions
Finally, the parser allows you to specify a custom date_parser function to take full advantage of the flexibility of the date parsing API:

In [69]:
df = pd.read_csv(
    "data/file04_04.csv", 
    header=None, 
    parse_dates=date_spec, 
    date_parser=pd.to_datetime
)
df

              nominal              actual     0     4
0 1999-01-27 19:00:00 1999-01-27 18:56:00  KORD  0.81
1 1999-01-27 20:00:00 1999-01-27 19:56:00  KORD  0.01
2 1999-01-27 21:00:00 1999-01-27 20:56:00  KORD -0.59
3 1999-01-27 21:00:00 1999-01-27 21:18:00  KORD -0.99
4 1999-01-27 22:00:00 1999-01-27 21:56:00  KORD -0.59
5 1999-01-27 23:00:00 1999-01-27 22:56:00  KORD -0.59

pandas will try to call the date_parser function in three different ways. If an exception is raised, the next one is tried:

1. date_parser is first called with one or more arrays as arguments, as defined using parse_dates (e.g., date_parser(['2013', '2013'], ['1', '2'])).
2. If #1 fails, date_parser is called with all the columns concatenated row-wise into a single array (e.g., date_parser(['2013 1', '2013 2'])).

Note that performance-wise, you should try these methods of parsing dates in order:

Try to infer the format using infer_datetime_format=True (see section below).

If you know the format, use pd.to_datetime(): date_parser=lambda x: pd.to_datetime(x, format=...).

If you have a really non-standard format, use a custom date_parser function. For optimal performance, this should be vectorized, i.e., it should accept arrays as arguments.

### Parsing a CSV with mixed timezones
pandas cannot natively represent a column or index with mixed timezones. If your CSV file contains columns with a mixture of timezones, the default result will be an object-dtype column with strings, even with parse_dates.

In [70]:
content = """\
a
2000-01-01T00:00:00+05:00
2000-01-01T00:00:00+06:00"""

df = pd.read_csv(StringIO(content), 
                 parse_dates=["a"])
df["a"]

0    2000-01-01 00:00:00+05:00
1    2000-01-01 00:00:00+06:00
Name: a, dtype: object

To parse the mixed-timezone values as a datetime column, pass a partially-applied to_datetime() with utc=True as the date_parser.

In [71]:
df = pd.read_csv(
    StringIO(content),
    parse_dates=["a"],
    date_parser=lambda col: pd.to_datetime(col, utc=True),
)
df["a"]

0   1999-12-31 19:00:00+00:00
1   1999-12-31 18:00:00+00:00
Name: a, dtype: datetime64[ns, UTC]

### Inferring datetime format
If you have parse_dates enabled for some or all of your columns, and your datetime strings are all formatted the same way, you may get a large speed up by setting infer_datetime_format=True. If set, pandas will attempt to guess the format of your datetime strings, and then use a faster means of parsing the strings. 5-10x parsing speeds have been observed. pandas will fallback to the usual parsing if either the format cannot be guessed or the format that was guessed cannot properly parse the entire column of strings. So in general, infer_datetime_format should not have any negative consequences if enabled.

Here are some examples of datetime strings that can be guessed (All representing December 30th, 2011 at 00:00:00):

* “20111230”
* “2011/12/30”
* “20111230 00:00:00”
* “12/30/2011 00:00:00”
* “30/Dec/2011 00:00:00”
* “30/December/2011 00:00:00”

Note that infer_datetime_format is sensitive to dayfirst. With dayfirst=True, it will guess “01/12/2011” to be December 1st. With dayfirst=False (default) it will guess “01/12/2011” to be January 12th.

In [72]:
# Try to infer the format for the index column
df = pd.read_csv(
    "data/file04_04.csv",
    index_col=0,
    parse_dates=True,
    infer_datetime_format=True,
)
df

      19990127  19:00:00  18:56:00  0.81
KORD
KORD  19990127  20:00:00  19:56:00  0.01
KORD  19990127  21:00:00  20:56:00 -0.59
KORD  19990127  21:00:00  21:18:00 -0.99
KORD  19990127  22:00:00  21:56:00 -0.59
KORD  19990127  23:00:00  22:56:00 -0.59

### International date formats
While US date formats tend to be MM/DD/YYYY, many international formats use DD/MM/YYYY instead. For convenience, a dayfirst keyword is provided:

In [73]:
df_tmp = pd.DataFrame(
    {
        1 : ["1/6/2000", "2/6/2000", "3/6/2000"],
        2 : [5, 10, 15],
        3 : ["a", "b", "c"],
    },
)

print(df_tmp)
df_tmp.to_csv("data/file04_05.csv", 
              header=False, 
              index=False)

          1   2  3
0  1/6/2000   5  a
1  2/6/2000  10  b
2  3/6/2000  15  c

In [74]:
print(open("data/file04_05.csv").read())

1/6/2000,5,a
2/6/2000,10,b
3/6/2000,15,c

In [75]:
pd.read_csv("data/file04_05.csv", 
            parse_dates=[0])

    1/6/2000   5  a
0 2000-02-06  10  b
1 2000-03-06  15  c

In [76]:
pd.read_csv("data/file04_05.csv", 
            dayfirst=True, 
            parse_dates=[0])

    1/6/2000   5  a
0 2000-06-02  10  b
1 2000-06-03  15  c

### Writing CSVs to binary file objects
*New in version 1.2.0.*

df.to_csv(..., mode="wb") allows writing a CSV to a file object opened binary mode. In most cases, it is not necessary to specify mode as Pandas will auto-detect whether the file object is opened in text or binary mode.

In [77]:
import io
data = pd.DataFrame([0, 1, 2])
buffer = io.BytesIO()
data.to_csv(buffer, 
            encoding="utf-8", 
            compression="gzip")

## Specifying method for floating-point conversion
The parameter float_precision can be specified in order to use a specific floating-point converter during parsing with the C engine. The options are the ordinary converter, the high-precision converter, and the round-trip converter (which is guaranteed to round-trip values after writing to a file). For example:

In [78]:
val = "0.3066101993807095471566981359501369297504425048828125"
data = "a,b,c\n1,2,{0}".format(val)
abs(
    pd.read_csv(
        StringIO(data),
        engine="c",
        float_precision=None,
    )["c"][0] - float(val)
)

5.551115123125783e-17

In [79]:
abs(
    pd.read_csv(
        StringIO(data),
        engine="c",
        float_precision="high",
        )["c"][0] - float(val)
)

5.551115123125783e-17

In [80]:
abs(
    pd.read_csv(StringIO(data), 
                engine="c", 
                float_precision="round_trip")
    ["c"][0] 
    - float(val)
)

0.0

## Thousand separators
For large numbers that have been written with a thousands separator, you can set the thousands keyword to a string of length 1 so that integers will be parsed correctly:

By default, numbers with a thousands separator will be parsed as strings:

In [81]:
df_tmp = pd.DataFrame(
    {
        "ID"       : ["Patient1", "Patient2", "Patient2"],
        "level"    : ["123,000", "23,000", "1,234018"],
        "category" : ["x", "y", "z"]
    },
    index = [0, 1, 2]
)
print(df_tmp)
df_tmp.to_csv("data/file04_06.csv", 
              sep = "|", 
              index = False)

         ID     level category
0  Patient1   123,000        x
1  Patient2    23,000        y
2  Patient2  1,234018        z

In [82]:
print(open("data/file04_06.csv").read())

ID|level|category
Patient1|123,000|x
Patient2|23,000|y
Patient2|1,234018|z

In [83]:
df = pd.read_csv("data/file04_06.csv", 
                 sep="|")
df

         ID     level category
0  Patient1   123,000        x
1  Patient2    23,000        y
2  Patient2  1,234018        z

In [84]:
df.level.dtype

dtype('O')

The thousands keyword allows integers to be parsed correctly:

In [85]:
print(open("data/file04_06.csv").read())

ID|level|category
Patient1|123,000|x
Patient2|23,000|y
Patient2|1,234018|z

In [86]:
df = pd.read_csv("data/file04_06.csv", 
                 sep="|", 
                 thousands=",")
df

         ID    level category
0  Patient1   123000        x
1  Patient2    23000        y
2  Patient2  1234018        z

In [87]:
df.level.dtype

dtype('int64')

## NA values
To control which values are parsed as missing values (which are signified by NaN), specify a string in na_values. If you specify a list of strings, then all values in it are considered to be missing values. If you specify a number (a float, like 5.0 or an integer like 5), the corresponding equivalent values will also imply a missing value (in this case effectively [5.0, 5] are recognized as NaN).

To completely override the default values that are recognized as missing, specify keep_default_na=False.

The default NaN recognized values are ['-1.#IND', '1.#QNAN', '1.#IND', '-1.#QNAN', '#N/A N/A', '#N/A', 'N/A', 'n/a', 'NA', '<NA>', '#NA', 'NULL', 'null', 'NaN', '-NaN', 'nan', '-nan', ''].

Let us consider some examples:

In [88]:
df = pd.DataFrame({"MyInt64": [5,
                               0,
                               "Nope",
                               '',
                               '-1.#IND',
                               '1.#QNAN',
                               '1.#IND',
                               '-1.#QNAN',
                               '#N/A N/A',
                               '#N/A',
                               'N/A',
                               'n/a',
                               'NA',
                               '<NA>',
                               '#NA',
                               'NULL',
                               'null',
                               'NaN',
                               '-NaN',
                               'nan',
                               '-nan']})
df.to_csv("data/file04_07.csv", 
          header=True)
pd.read_csv("data/file04_07.csv")

    Unnamed: 0 MyInt64
0            0       5
1            1       0
2            2    Nope
3            3     NaN
4            4     NaN
5            5     NaN
6            6     NaN
7            7     NaN
8            8     NaN
9            9     NaN
10          10     NaN
11          11     NaN
12          12     NaN
13          13     NaN
14          14     NaN
15          15     NaN
16          16     NaN
17          17     NaN
18          18     NaN
19          19     NaN
20          20     NaN

In [89]:
pd.read_csv("data/file04_07.csv", 
            na_values=[5])

    Unnamed: 0 MyInt64
0          0.0     NaN
1          1.0       0
2          2.0    Nope
3          3.0     NaN
4          4.0     NaN
5          NaN     NaN
6          6.0     NaN
7          7.0     NaN
8          8.0     NaN
9          9.0     NaN
10        10.0     NaN
11        11.0     NaN
12        12.0     NaN
13        13.0     NaN
14        14.0     NaN
15        15.0     NaN
16        16.0     NaN
17        17.0     NaN
18        18.0     NaN
19        19.0     NaN
20        20.0     NaN

In the example above 5 and 5.0 will be recognized as NaN, in addition to the defaults. A string will first be interpreted as a numerical 5, then as a NaN.

In [90]:
pd.read_csv("data/file04_07.csv", 
            keep_default_na=False, 
            na_values=[""])

    Unnamed: 0   MyInt64
0            0         5
1            1         0
2            2      Nope
3            3       NaN
4            4   -1.#IND
5            5   1.#QNAN
6            6    1.#IND
7            7  -1.#QNAN
8            8  #N/A N/A
9            9      #N/A
10          10       N/A
11          11       n/a
12          12        NA
13          13      <NA>
14          14       #NA
15          15      NULL
16          16      null
17          17       NaN
18          18      -NaN
19          19       nan
20          20      -nan

Above, only an empty field will be recognized as NaN.

In [91]:
pd.read_csv("data/file04_07.csv", 
            keep_default_na=False, 
            na_values=["NA", "0"])

    Unnamed: 0   MyInt64
0          NaN         5
1          1.0       NaN
2          2.0      Nope
3          3.0
4          4.0   -1.#IND
5          5.0   1.#QNAN
6          6.0    1.#IND
7          7.0  -1.#QNAN
8          8.0  #N/A N/A
9          9.0      #N/A
10        10.0       N/A
11        11.0       n/a
12        12.0       NaN
13        13.0      <NA>
14        14.0       #NA
15        15.0      NULL
16        16.0      null
17        17.0       NaN
18        18.0      -NaN
19        19.0       nan
20        20.0      -nan

Above, both NA and 0 as strings are NaN.

In [92]:
pd.read_csv("data/file04_07.csv", 
            na_values=["Nope"])

    Unnamed: 0  MyInt64
0            0      5.0
1            1      0.0
2            2      NaN
3            3      NaN
4            4      NaN
5            5      NaN
6            6      NaN
7            7      NaN
8            8      NaN
9            9      NaN
10          10      NaN
11          11      NaN
12          12      NaN
13          13      NaN
14          14      NaN
15          15      NaN
16          16      NaN
17          17      NaN
18          18      NaN
19          19      NaN
20          20      NaN

The default values, in addition to the string "Nope" are recognized as NaN.

## Infinity
inf like values will be parsed as np.inf (positive infinity), and -inf as -np.inf (negative infinity). These will ignore the case of the value, meaning Inf, will also be parsed as np.inf.

## Returning Series
Using the squeeze keyword, the parser will return output with a single column as a Series:

In [93]:
data = (
    'level\n'
    +'Patient1, 123000\n'
    +'Patient2, 23000\n'
    +'Patient3, 1234018\n'
)
print(data)

level
Patient1, 123000
Patient2, 23000
Patient3, 1234018

In [94]:
output = pd.read_csv(StringIO(data), 
                     squeeze=True)
output

Patient1     123000
Patient2      23000
Patient3    1234018
Name: level, dtype: int64

In [95]:
type(output)

pandas.core.series.Series

## Boolean values
The common values True, False, TRUE, and FALSE are all recognized as boolean. Occasionally you might want to recognize other values as being boolean. To do this, use the true_values and false_values options as follows:

In [96]:
data = "a,b,c\n1,Yes,2\n3,No,4"
print(data)

a,b,c
1,Yes,2
3,No,4

In [97]:
pd.read_csv(StringIO(data))

   a    b  c
0  1  Yes  2
1  3   No  4

In [98]:
pd.read_csv(StringIO(data), true_values=["Yes"], false_values=["No"])

   a      b  c
0  1   True  2
1  3  False  4

## Handling “bad” lines
Some files may have malformed lines with too few fields or too many. Lines with too few fields will have NA values filled in the trailing fields. Lines with too many fields will raise an error by default:

In [99]:
data = "a,b,c\n1,2,3\n4,5,6,7\n8,9,10"
try:
    pd.read_csv(StringIO(data))
except pd.errors.ParserError as err:
    print("ParserError: {0}".format(err))    
except:
    print("Unexpected error:", sys.exc_info()[0])
    raise
finally:
    print('continue after throwing error')

ParserError: Error tokenizing data. C error: Expected 3 fields in line 3, saw 4

continue after throwing error

You can elect to skip bad lines:

In [100]:
pd.read_csv(StringIO(data), error_bad_lines=False)

b'Skipping line 3: expected 3 fields, saw 4\n'

   a  b   c
0  1  2   3
1  8  9  10

You can also use the usecols parameter to eliminate extraneous column data that appear in some lines but not others:

In [101]:
pd.read_csv(StringIO(data), usecols=[0, 1, 2])

   a  b   c
0  1  2   3
1  4  5   6
2  8  9  10

## Dialect
The dialect keyword gives greater flexibility in specifying the file format. By default it uses the Excel dialect but you can specify either the dialect name or a csv.Dialect instance.

Suppose you had data with unenclosed quotes:

In [102]:
data = 'label1, index1, index2\nindex1, "a, c, e\nindex2, b, d, f'
print(data)

label1, index1, index2
index1, "a, c, e
index2, b, d, f

By default, read_csv uses the Excel dialect and treats the double quote as the quote character, which causes it to fail when it finds a newline before it finds the closing double quote.

We can get around this using dialect:

In [103]:
import csv
dia = csv.excel()
dia.quoting = csv.QUOTE_NONE
pd.read_csv(StringIO(data), dialect=dia)

       label1  index1  index2
index1     "a       c       e
index2      b       d       f

All of the dialect options can be specified separately by keyword arguments:

In [104]:
data = "a,b,c~1,2,3~4,5,6"
pd.read_csv(StringIO(data), lineterminator="~")

   a  b  c
0  1  2  3
1  4  5  6

Another common dialect option is skipinitialspace, to skip any whitespace after a delimiter:

In [105]:
data = "a, b, c\n1, 2, 3\n4, 5, 6"
print(data)

a, b, c
1, 2, 3
4, 5, 6

In [106]:
pd.read_csv(StringIO(data), skipinitialspace=True)

   a  b  c
0  1  2  3
1  4  5  6

The parsers make every attempt to “do the right thing” and not be fragile. Type inference is a pretty big deal. If a column can be coerced to integer dtype without altering the contents, the parser will do so. Any non-numeric columns will come through as object dtype as with the rest of pandas objects.

## Quoting and Escape Characters
Quotes (and other escape characters) in embedded fields can be handled in any number of ways. One way is to use backslashes; to properly parse this data, you should pass the escapechar option:

In [107]:
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'
print(data)

a,b
"hello, \"Bob\", nice to see you",5

In [108]:
pd.read_csv(StringIO(data), escapechar="\\")

                               a  b
0  hello, "Bob", nice to see you  5

## Files with fixed width columns
While read_csv() reads delimited data, the read_fwf() function works with data files that have known and fixed column widths. The function parameters to read_fwf are largely the same as read_csv with two extra parameters, and a different usage of the delimiter parameter:

* colspecs: A list of pairs (tuples) giving the extents of the fixed-width fields of each line as half-open intervals (i.e., [from, to[ ). String value ‘infer’ can be used to instruct the parser to try detecting the column specifications from the first 100 rows of the data. Default behavior, if not specified, is to infer.
* widths: A list of field widths which can be used instead of ‘colspecs’ if the intervals are contiguous.
* delimiter: Characters to consider as filler characters in the fixed-width file. Can be used to specify the filler character of the fields if it is not spaces (e.g., ‘~’).

Consider a typical fixed-width data file:

In [109]:
data = (
    'id8141    360.242940   149.910199   11950.7\n'
    +'id1594    444.953632   166.985655   11788.4\n'
    +'id1849    364.136849   183.628767   11806.2\n'
    +'id1230    413.836124   184.375703   11916.8\n'
    +'id1948    502.953953   173.237159   12468.3\n'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_08.csv",
          index=False)

In [110]:
print(open("data/file04_08.csv").read())

id8141    360.242940   149.910199   11950.7
id1594    444.953632   166.985655   11788.4
id1849    364.136849   183.628767   11806.2
id1230    413.836124   184.375703   11916.8
id1948    502.953953   173.237159   12468.3

In [111]:
# Column specifications are a list of half-intervals
colspecs = [(0, 6), (8, 20), (21, 33), (34, 43)]
df = pd.read_fwf("data/file04_08.csv", 
                 colspecs=colspecs, 
                 header=None, 
                 index_col=0)
df

                 1           2        3
0
id8141  360.242940  149.910199  11950.7
id1594  444.953632  166.985655  11788.4
id1849  364.136849  183.628767  11806.2
id1230  413.836124  184.375703  11916.8
id1948  502.953953  173.237159  12468.3

Note how the parser automatically picks column names X.<column number> when header=None argument is specified. Alternatively, you can supply just the column widths for contiguous columns

In [112]:
# Widths are a list of integers
widths = [6, 14, 13, 10]
df = pd.read_fwf("data/file04_08.csv", 
                 widths=widths, 
                 header=None)
df

        0           1           2        3
0  id8141  360.242940  149.910199  11950.7
1  id1594  444.953632  166.985655  11788.4
2  id1849  364.136849  183.628767  11806.2
3  id1230  413.836124  184.375703  11916.8
4  id1948  502.953953  173.237159  12468.3

The parser will take care of extra white spaces around the columns so it’s ok to have extra separation between the columns in the file.

By default, read_fwf will try to infer the file’s colspecs by using the first 100 rows of the file. It can do it only in cases when the columns are aligned and correctly separated by the provided delimiter (default delimiter is whitespace).

In [113]:
df = pd.read_fwf("data/file04_08.csv", header=None, index_col=0)
df

                 1           2        3
0
id8141  360.242940  149.910199  11950.7
id1594  444.953632  166.985655  11788.4
id1849  364.136849  183.628767  11806.2
id1230  413.836124  184.375703  11916.8
id1948  502.953953  173.237159  12468.3

read_fwf supports the dtype parameter for specifying the types of parsed columns to be different from the inferred type.

In [114]:
pd.read_fwf("data/file04_08.csv", header=None, index_col=0).dtypes

1    float64
2    float64
3    float64
dtype: object

In [115]:
pd.read_fwf("data/file04_08.csv", header=None, dtype={2: "object"}).dtypes

0     object
1    float64
2     object
3    float64
dtype: object

## Indexes
### Files with an “implicit” index column
Consider a file with one less entry in the header than the number of data column:

In [116]:
data = (
    'A,B,C\n'
    +'20090101,a,1,2\n'
    +'20090102,b,3,4\n'
    +'20090103,c,4,5'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_09.csv")
print(data)

A,B,C
20090101,a,1,2
20090102,b,3,4
20090103,c,4,5

In [117]:
print(open("data/file04_09.csv").read())

,A,B,C
20090101,a,1,2
20090102,b,3,4
20090103,c,4,5

In this special case, read_csv assumes that the first column is to be used as the index of the DataFrame:

In [118]:
pd.read_csv("data/file04_09.csv", index_col=0)

          A  B  C
20090101  a  1  2
20090102  b  3  4
20090103  c  4  5

Note that the dates weren’t automatically parsed. In that case you would need to do as before:

In [119]:
df = pd.read_csv("data/file04_09.csv", index_col=0, parse_dates=True)
df.index

DatetimeIndex(['2009-01-01', '2009-01-02', '2009-01-03'], dtype='datetime64[ns]', freq=None)

### Reading an index with a MultiIndex
Suppose you have data indexed by two columns:

In [120]:
data = (
    'year,indiv,zit,xit\n'
    +'1977,"A",1.2,.6\n'
    +'1977,"B",1.5,.5\n'
    +'1977,"C",1.7,.8\n'
    +'1978,"A",.2,.06\n'
    +'1978,"B",.7,.2\n'
    +'1978,"C",.8,.3\n'
    +'1978,"D",.9,.5\n'
    +'1978,"E",1.4,.9\n'
    +'1979,"C",.2,.15\n'
    +'1979,"D",.14,.05\n'
    +'1979,"E",.5,.15\n'
    +'1979,"F",1.2,.5\n'
    +'1979,"G",3.4,1.9\n'
    +'1979,"H",5.4,2.7\n'
    +'1979,"I",6.4,1.2\n'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_10.csv",
          index=False)
#print(data)

In [121]:
print(open("data/file04_10.csv").read())

year,indiv,zit,xit
1977,A,1.2,0.6
1977,B,1.5,0.5
1977,C,1.7,0.8
1978,A,0.2,0.06
1978,B,0.7,0.2
1978,C,0.8,0.3
1978,D,0.9,0.5
1978,E,1.4,0.9
1979,C,0.2,0.15
1979,D,0.14,0.05
1979,E,0.5,0.15
1979,F,1.2,0.5
1979,G,3.4,1.9
1979,H,5.4,2.7
1979,I,6.4,1.2

The index_col argument to read_csv can take a list of column numbers to turn multiple columns into a MultiIndex for the index of the returned object:

In [122]:
df = pd.read_csv("data/file04_10.csv",
                 index_col=[0, 1])
print(df)

             zit   xit
year indiv
1977 A      1.20  0.60
     B      1.50  0.50
     C      1.70  0.80
1978 A      0.20  0.06
     B      0.70  0.20
     C      0.80  0.30
     D      0.90  0.50
     E      1.40  0.90
1979 C      0.20  0.15
     D      0.14  0.05
     E      0.50  0.15
     F      1.20  0.50
     G      3.40  1.90
     H      5.40  2.70
     I      6.40  1.20

In [123]:
df.loc[1978]

       zit   xit
indiv
A      0.2  0.06
B      0.7  0.20
C      0.8  0.30
D      0.9  0.50
E      1.4  0.90

### Reading columns with a MultiIndex
By specifying list of row locations for the header argument, you can read in a MultiIndex for the columns. Specifying non-consecutive rows will skip the intervening rows.

In [124]:
from pandas._testing import makeCustomDataframe as mkdf
df = mkdf(5, 3, r_idx_nlevels=2, c_idx_nlevels=4)
df.to_csv("data/file04_11.csv")
print(open("data/file04_11.csv").read())

C0,,C_l0_g0,C_l0_g1,C_l0_g2
C1,,C_l1_g0,C_l1_g1,C_l1_g2
C2,,C_l2_g0,C_l2_g1,C_l2_g2
C3,,C_l3_g0,C_l3_g1,C_l3_g2
R0,R1,,,
R_l0_g0,R_l1_g0,R0C0,R0C1,R0C2
R_l0_g1,R_l1_g1,R1C0,R1C1,R1C2
R_l0_g2,R_l1_g2,R2C0,R2C1,R2C2
R_l0_g3,R_l1_g3,R3C0,R3C1,R3C2
R_l0_g4,R_l1_g4,R4C0,R4C1,R4C2

In [125]:
pd.read_csv("data/file04_11.csv", header=[0, 1, 2, 3], index_col=[0, 1])

C0              C_l0_g0 C_l0_g1 C_l0_g2
C1              C_l1_g0 C_l1_g1 C_l1_g2
C2              C_l2_g0 C_l2_g1 C_l2_g2
C3              C_l3_g0 C_l3_g1 C_l3_g2
R0      R1
R_l0_g0 R_l1_g0    R0C0    R0C1    R0C2
R_l0_g1 R_l1_g1    R1C0    R1C1    R1C2
R_l0_g2 R_l1_g2    R2C0    R2C1    R2C2
R_l0_g3 R_l1_g3    R3C0    R3C1    R3C2
R_l0_g4 R_l1_g4    R4C0    R4C1    R4C2

read_csv is also able to interpret a more common format of multi-columns indices.

In [126]:
data = (
    ',a,a,a,b,c,c\n'
    +',q,r,s,t,u,v\n'
    +'one,1,2,3,4,5,6\n'
    +'two,7,8,9,10,11,12'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_12.csv",
          index=False)
print(data)

,a,a,a,b,c,c
,q,r,s,t,u,v
one,1,2,3,4,5,6
two,7,8,9,10,11,12

In [127]:
print(open("data/file04_12.csv").read())

Unnamed: 0,a,a.1,a.2,b,c,c.1
,q,r,s,t,u,v
one,1,2,3,4,5,6
two,7,8,9,10,11,12

In [128]:
pd.read_csv("data/file04_12.csv", header=[0, 1], index_col=0)

Unnamed: 0  a a.1 a.2   b   c c.1
            q   r   s   t   u   v
one         1   2   3   4   5   6
two         7   8   9  10  11  12

Note: If an index_col is not specified (e.g. you don’t have an index, or wrote it with df.to_csv(..., index=False), then any names on the columns index will be lost.

## Automatically “sniffing” the delimiter
read_csv is capable of inferring delimited (not necessarily comma-separated) files, as pandas uses the csv.Sniffer class of the csv module. For this, you have to specify sep=None.

In [129]:
data = (
    ':0:1:2:3\n'
    +'0:0.4691122999071863:-0.2828633443286633:-1.5090585031735124:-1.1356323710171934\n'
    +'1:1.2121120250208506:-0.17321464905330858:0.11920871129693428:-1.0442359662799567\n'
    +'2:-0.8618489633477999:-2.1045692188948086:-0.4949292740687813:1.071803807037338\n'
    +'3:0.7215551622443669:-0.7067711336300845:-1.0395749851146963:0.27185988554282986\n'
    +'4:-0.42497232978883753:0.567020349793672:0.27623201927771873:-1.0874006912859915\n'
    +'5:-0.6736897080883706:0.1136484096888855:-1.4784265524372235:0.5249876671147047\n'
    +'6:0.4047052186802365:0.5770459859204836:-1.7150020161146375:-1.0392684835147725\n'
    +'7:-0.3706468582364464:-1.1578922506419993:-1.344311812731667:0.8448851414248841\n'
    +'8:1.0757697837155533:-0.10904997528022223:1.6435630703622064:-1.4693879595399115\n'
    +'9:0.35702056413309086:-0.6746001037299882:-1.776903716971867:-0.9689138124473498'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_12.csv",
          index=False)
#print(data)

In [130]:
print(open("data/file04_12.csv").read())

:0:1:2:3
0:0.4691122999071863:-0.2828633443286633:-1.5090585031735124:-1.1356323710171934
1:1.2121120250208506:-0.17321464905330858:0.11920871129693428:-1.0442359662799567
2:-0.8618489633477999:-2.1045692188948086:-0.4949292740687813:1.071803807037338
3:0.7215551622443669:-0.7067711336300845:-1.0395749851146963:0.27185988554282986
4:-0.42497232978883753:0.567020349793672:0.27623201927771873:-1.0874006912859915
5:-0.6736897080883706:0.1136484096888855:-1.4784265524372235:0.5249876671147047
6:0.4047052186802365:0.5770459859204836:-1.7150020161146375:-1.0392684835147725
7:-0.3706468582364464:-1.1578922506419993:-1.344311812731667:0.8448851414248841
8:1.0757697837155533:-0.10904997528022223:1.6435630703622064:-1.4693879595399115
9:0.35702056413309086:-0.6746001037299882:-1.776903716971867:-0.9689138124473498

In [131]:
pd.read_csv("data/file04_12.csv", 
            sep=None, 
            engine="python")

   Unnamed: 0         0         1         2         3
0           0  0.469112 -0.282863 -1.509059 -1.135632
1           1  1.212112 -0.173215  0.119209 -1.044236
2           2 -0.861849 -2.104569 -0.494929  1.071804
3           3  0.721555 -0.706771 -1.039575  0.271860
4           4 -0.424972  0.567020  0.276232 -1.087401
5           5 -0.673690  0.113648 -1.478427  0.524988
6           6  0.404705  0.577046 -1.715002 -1.039268
7           7 -0.370647 -1.157892 -1.344312  0.844885
8           8  1.075770 -0.109050  1.643563 -1.469388
9           9  0.357021 -0.674600 -1.776904 -0.968914

## Reading multiple files to create a single DataFrame
It’s best to use concat() to combine multiple files. See the cookbook for an example.

## Iterating through files chunk by chunk
Suppose you wish to iterate through a (potentially very large) file lazily rather than reading the entire file into memory, such as the following:

In [132]:
data = (
    '|0|1|2|3\n'
    +'0|0.4691122999071863|-0.2828633443286633|-1.5090585031735124|-1.1356323710171934\n'
    +'1|1.2121120250208506|-0.17321464905330858|0.11920871129693428|-1.0442359662799567\n'
    +'2|-0.8618489633477999|-2.1045692188948086|-0.4949292740687813|1.071803807037338\n'
    +'3|0.7215551622443669|-0.7067711336300845|-1.0395749851146963|0.27185988554282986\n'
    +'4|-0.42497232978883753|0.567020349793672|0.27623201927771873|-1.0874006912859915\n'
    +'5|-0.6736897080883706|0.1136484096888855|-1.4784265524372235|0.5249876671147047\n'
    +'6|0.4047052186802365|0.5770459859204836|-1.7150020161146375|-1.0392684835147725\n'
    +'7|-0.3706468582364464|-1.1578922506419993|-1.344311812731667|0.8448851414248841\n'
    +'8|1.0757697837155533|-0.10904997528022223|1.6435630703622064|-1.4693879595399115\n'
    +'9|0.35702056413309086|-0.6746001037299882|-1.776903716971867|-0.9689138124473498'
)
df = pd.read_csv(StringIO(data))
df.to_csv("data/file04_13.csv",
          index=False)
#print(data)

In [133]:
print(open("data/file04_13.csv").read())

|0|1|2|3
0|0.4691122999071863|-0.2828633443286633|-1.5090585031735124|-1.1356323710171934
1|1.2121120250208506|-0.17321464905330858|0.11920871129693428|-1.0442359662799567
2|-0.8618489633477999|-2.1045692188948086|-0.4949292740687813|1.071803807037338
3|0.7215551622443669|-0.7067711336300845|-1.0395749851146963|0.27185988554282986
4|-0.42497232978883753|0.567020349793672|0.27623201927771873|-1.0874006912859915
5|-0.6736897080883706|0.1136484096888855|-1.4784265524372235|0.5249876671147047
6|0.4047052186802365|0.5770459859204836|-1.7150020161146375|-1.0392684835147725
7|-0.3706468582364464|-1.1578922506419993|-1.344311812731667|0.8448851414248841
8|1.0757697837155533|-0.10904997528022223|1.6435630703622064|-1.4693879595399115
9|0.35702056413309086|-0.6746001037299882|-1.776903716971867|-0.9689138124473498

In [134]:
table = pd.read_csv("data/file04_13.csv", 
                    sep="|")
print(table)

   Unnamed: 0         0         1         2         3
0           0  0.469112 -0.282863 -1.509059 -1.135632
1           1  1.212112 -0.173215  0.119209 -1.044236
2           2 -0.861849 -2.104569 -0.494929  1.071804
3           3  0.721555 -0.706771 -1.039575  0.271860
4           4 -0.424972  0.567020  0.276232 -1.087401
5           5 -0.673690  0.113648 -1.478427  0.524988
6           6  0.404705  0.577046 -1.715002 -1.039268
7           7 -0.370647 -1.157892 -1.344312  0.844885
8           8  1.075770 -0.109050  1.643563 -1.469388
9           9  0.357021 -0.674600 -1.776904 -0.968914

By specifying a chunksize to read_csv, the return value will be an iterable object of type TextFileReader:

In [135]:
with pd.read_csv("data/file04_13.csv", sep="|", chunksize=4) as reader:
    reader
    for chunk in reader:
        print(chunk)

   Unnamed: 0         0         1         2         3
0           0  0.469112 -0.282863 -1.509059 -1.135632
1           1  1.212112 -0.173215  0.119209 -1.044236
2           2 -0.861849 -2.104569 -0.494929  1.071804
3           3  0.721555 -0.706771 -1.039575  0.271860
   Unnamed: 0         0         1         2         3
4           4 -0.424972  0.567020  0.276232 -1.087401
5           5 -0.673690  0.113648 -1.478427  0.524988
6           6  0.404705  0.577046 -1.715002 -1.039268
7           7 -0.370647 -1.157892 -1.344312  0.844885
   Unnamed: 0         0        1         2         3
8           8  1.075770 -0.10905  1.643563 -1.469388
9           9  0.357021 -0.67460 -1.776904 -0.968914

Changed in version 1.2: read_csv/json/sas return a context-manager when iterating through a file.

Specifying iterator=True will also return the TextFileReader object:

In [136]:
with pd.read_csv("data/file04_13.csv", sep="|", iterator=True) as reader:
    print(reader.get_chunk(5))

   Unnamed: 0         0         1         2         3
0           0  0.469112 -0.282863 -1.509059 -1.135632
1           1  1.212112 -0.173215  0.119209 -1.044236
2           2 -0.861849 -2.104569 -0.494929  1.071804
3           3  0.721555 -0.706771 -1.039575  0.271860
4           4 -0.424972  0.567020  0.276232 -1.087401

## Specifying the parser engine
Under the hood pandas uses a fast and efficient parser implemented in C as well as a Python implementation which is currently more feature-complete. Where possible pandas uses the C parser (specified as engine='c'), but may fall back to Python if C-unsupported options are specified. Currently, C-unsupported options include:

* sep other than a single character (e.g. regex separators)
* skipfooter
* sep=None with delim_whitespace=False

Specifying any of the above options will produce a ParserWarning unless the python engine is selected explicitly using engine='python'.

## Reading/writing remote files
You can pass in a URL to read or write remote files to many of pandas’ IO functions - the following example shows reading a CSV file:

In [137]:
df = pd.read_csv("https://download.bls.gov/pub/time.series/cu/cu.item", sep="\t")

All URLs which are not local files or HTTP(s) are handled by fsspec, if installed, and its various filesystem implementations (including Amazon S3, Google Cloud, SSH, FTP, webHDFS…). Some of these implementations will require additional packages to be installed, for example S3 URLs require the s3fs library:

In [138]:
try:
    df = pd.read_json("s3://pandas-test/adatafile.json")
except:
    print('you need a real account to do this')

you need a real account to do this

When dealing with remote storage systems, you might need extra configuration with environment variables or config files in special locations. For example, to access data in your S3 bucket, you will need to define credentials in one of the several ways listed in the S3Fs documentation. The same is true for several of the storage backends, and you should follow the links at fsimpl1 for implementations built into fsspec and fsimpl2 for those not included in the main fsspec distribution.

You can also pass parameters directly to the backend driver. For example, if you do not have S3 credentials, you can still access public data by specifying an anonymous connection, such as

New in version 1.2.0.

In [139]:
try:
    pd.read_csv(
        "s3://ncei-wcsd-archive/data/processed/SH1305/18kHz/SaKe2013"
        "-D20130523-T080854_to_SaKe2013-D20130523-T085643.csv",
        storage_options={"anon": True},
    )
except:
    print('you need a real account to do this also')

you need a real account to do this also

fsspec also allows complex URLs, for accessing data in compressed archives, local caching of files, and more. To locally cache the above example, you would modify the call to

In [140]:
try:
    pd.read_csv(
        "simplecache::s3://ncei-wcsd-archive/data/processed/SH1305/18kHz/"
        "SaKe2013-D20130523-T080854_to_SaKe2013-D20130523-T085643.csv",
        storage_options={"s3": {"anon": True}},
    )
except:
    print('you need a real account to do this as well')

you need a real account to do this as well

where we specify that the “anon” parameter is meant for the “s3” part of the implementation, not to the caching implementation. Note that this caches to a temporary directory for the duration of the session only, but you can also specify a permanent store.

## Writing out data
### Writing to CSV format
The Series and DataFrame objects have an instance method to_csv which allows storing the contents of the object as a comma-separated-values file. The function takes a number of arguments. Only the first is required.

* path_or_buf: A string path to the file to write or a file object. If a file object it must be opened with newline=''
* sep : Field delimiter for the output file (default “,”)
* na_rep: A string representation of a missing value (default ‘’)
* float_format: Format string for floating point numbers
* columns: Columns to write (default None)
* header: Whether to write out the column names (default True)
* index: whether to write row (index) names (default True)
* index_label: Column label(s) for index column(s) if desired. If None (default), and header and index are True, then the index names are used. (A sequence should be given if the DataFrame uses MultiIndex).
* mode : Python write mode, default ‘w’
* encoding: a string representing the encoding to use if the contents are non-ASCII, for Python versions prior to 3
* line_terminator: Character sequence denoting line end (default os.linesep)
* quoting: Set quoting rules as in csv module (default csv.QUOTE_MINIMAL). Note that if you have set a float_format then floats are converted to strings and csv.QUOTE_NONNUMERIC will treat them as non-numeric
* quotechar: Character used to quote fields (default ‘”’)
* doublequote: Control quoting of quotechar in fields (default True)
* escapechar: Character used to escape sep and quotechar when appropriate (default None)
* chunksize: Number of rows to write at a time
* date_format: Format string for datetime objects

### Writing a formatted string
The DataFrame object has an instance method to_string which allows control over the string representation of the object. All arguments are optional:

* buf default None, for example a StringIO object
* columns default None, which columns to write
* col_space default None, minimum width of each column.
* na_rep default NaN, representation of NA value
* formatters default None, a dictionary (by column) of functions each of which takes a single argument and returns a formatted string
* float_format default None, a function which takes a single (float) argument and returns a formatted string; to be applied to floats in the DataFrame.
* sparsify default True, set to False for a DataFrame with a hierarchical index to print every MultiIndex key at each row.
* index_names default True, will print the names of the indices
* index default True, will print the index (ie, row labels)
* header default True, will print the column labels
* justify default left, will print column headers left- or right-justified

The Series object also has a to_string method, but with only the buf, na_rep, float_format arguments. There is also a length argument which, if set to True, will additionally output the length of the Series.

-------

# JSON
Read and write JSON format files and strings.

## Writing JSON
A Series or DataFrame can be converted to a valid JSON string. Use to_json with optional parameters:

* path_or_buf : the pathname or buffer to write the output This can be None in which case a JSON string is returned
* orient :

  * Series:
    * default is index
    * allowed values are {split, records, index}
  * DataFrame:
    * default is columns
    * allowed values are {split, records, index, columns, values, table}

The format of the JSON string

| Method | Description |
|-------|-------|
| split | dict like {index -> [index], columns -> [columns], data -> [values]} |
| records | list like [{column -> value}, … , {column -> value}] |
| index | dict like {index -> {column -> value}} |
| columns | dict like {column -> {index -> value}} |
| values | just the values array |

* date_format : string, type of date conversion, ‘epoch’ for timestamp, ‘iso’ for ISO8601.
* double_precision : The number of decimal places to use when encoding floating point values, default 10.
* force_ascii : force encoded string to be ASCII, default True.
* date_unit : The time unit to encode to, governs timestamp and ISO8601 precision. One of ‘s’, ‘ms’, ‘us’ or ‘ns’ for seconds, milliseconds, microseconds and nanoseconds respectively. Default ‘ms’.
* default_handler : The handler to call if an object cannot otherwise be converted to a suitable format for JSON. Takes a single argument, which is the object to convert, and returns a serializable object.
* lines : If records orient, then will write each record per line as json.

Note NaN’s, NaT’s and None will be converted to null and datetime objects will be converted based on the date_format and date_unit parameters.

In [141]:
dfj = pd.DataFrame(np.random.randn(5, 2), columns=list("AB"))
json = dfj.to_json()
json

'{"A":{"0":-1.6368254672,"1":0.3909830064,"2":-1.8874322732,"3":0.9431407227,"4":-2.3326470578},"B":{"0":1.0732000476,"1":0.7068607735,"2":0.3100921491,"3":0.9504604358,"4":-1.07928764}}'

### Orient options
There are a number of different options for the format of the resulting JSON file / string. Consider the following DataFrame and Series:

In [142]:
dfjo = pd.DataFrame(
    dict(A=range(1, 4), B=range(4, 7), C=range(7, 10)),
    columns=list("ABC"),
    index=list("xyz"),
)
dfjo

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

In [143]:
sjo = pd.Series(dict(x=15, y=16, z=17), name="D")
sjo

x    15
y    16
z    17
Name: D, dtype: int64

Column oriented (the default for DataFrame) serializes the data as nested JSON objects with column labels acting as the primary index:

In [144]:
dfjo.to_json(orient="columns")

'{"A":{"x":1,"y":2,"z":3},"B":{"x":4,"y":5,"z":6},"C":{"x":7,"y":8,"z":9}}'

```
# Not available for Series
```
Index oriented (the default for Series) similar to column oriented but the index labels are now primary:

In [145]:
dfjo.to_json(orient="index")

'{"x":{"A":1,"B":4,"C":7},"y":{"A":2,"B":5,"C":8},"z":{"A":3,"B":6,"C":9}}'

In [146]:
sjo.to_json(orient="index")

'{"x":15,"y":16,"z":17}'

Record oriented serializes the data to a JSON array of column -> value records, index labels are not included. This is useful for passing DataFrame data to plotting libraries, for example the JavaScript library d3.js:

In [147]:
dfjo.to_json(orient="records")

'[{"A":1,"B":4,"C":7},{"A":2,"B":5,"C":8},{"A":3,"B":6,"C":9}]'

In [148]:
sjo.to_json(orient="records")

'[15,16,17]'

Value oriented is a bare-bones option which serializes to nested JSON arrays of values only, column and index labels are not included:

In [149]:
dfjo.to_json(orient="values")

'[[1,4,7],[2,5,8],[3,6,9]]'

```
# Not available for Series
```
Split oriented serializes to a JSON object containing separate entries for values, index and columns. Name is also included for Series:

In [150]:
dfjo.to_json(orient="split")

'{"columns":["A","B","C"],"index":["x","y","z"],"data":[[1,4,7],[2,5,8],[3,6,9]]}'

In [151]:
sjo.to_json(orient="split")

'{"name":"D","index":["x","y","z"],"data":[15,16,17]}'

Table oriented serializes to the JSON Table Schema, allowing for the preservation of metadata including but not limited to dtypes and index names.

>Note: Any orient option that encodes to a JSON object will not preserve the ordering of index and column labels during round-trip serialization. If you wish to preserve label ordering use the split option as it uses ordered containers.

### Date handling
Writing in ISO date format:

In [152]:
dfd = pd.DataFrame(np.random.randn(5, 2), columns=list("AB"))
dfd["date"] = pd.Timestamp("20130101")
dfd = dfd.sort_index(1, ascending=False)
json = dfd.to_json(date_format="iso")
json

'{"date":{"0":"2013-01-01T00:00:00.000Z","1":"2013-01-01T00:00:00.000Z","2":"2013-01-01T00:00:00.000Z","3":"2013-01-01T00:00:00.000Z","4":"2013-01-01T00:00:00.000Z"},"B":{"0":-2.1041340229,"1":-1.5043526144,"2":-0.5121569238,"3":-1.23566859,"4":0.5270003997},"A":{"0":0.4440363108,"1":-0.5264582759,"2":1.0986375821,"3":-0.7460476815,"4":0.0104313791}}'

Writing in ISO date format, with microseconds:

In [153]:
json = dfd.to_json(date_format="iso", date_unit="us")
json

'{"date":{"0":"2013-01-01T00:00:00.000000Z","1":"2013-01-01T00:00:00.000000Z","2":"2013-01-01T00:00:00.000000Z","3":"2013-01-01T00:00:00.000000Z","4":"2013-01-01T00:00:00.000000Z"},"B":{"0":-2.1041340229,"1":-1.5043526144,"2":-0.5121569238,"3":-1.23566859,"4":0.5270003997},"A":{"0":0.4440363108,"1":-0.5264582759,"2":1.0986375821,"3":-0.7460476815,"4":0.0104313791}}'

Epoch timestamps, in seconds:

In [154]:
json = dfd.to_json(date_format="epoch", date_unit="s")
json

'{"date":{"0":1356998400,"1":1356998400,"2":1356998400,"3":1356998400,"4":1356998400},"B":{"0":-2.1041340229,"1":-1.5043526144,"2":-0.5121569238,"3":-1.23566859,"4":0.5270003997},"A":{"0":0.4440363108,"1":-0.5264582759,"2":1.0986375821,"3":-0.7460476815,"4":0.0104313791}}'

Writing to a file, with a date index and a date column:

In [155]:
dfj2 = dfj.copy()
dfj2["date"] = pd.Timestamp("20130101")
dfj2["ints"] = list(range(5))
dfj2["bools"] = True
dfj2.index = pd.date_range("20130101", periods=5)
dfj2.to_json("data/file04_14.json")
with open("data/file04_14.json") as fh:
    print(fh.read())

{"A":{"1356998400000":-1.6368254672,"1357084800000":0.3909830064,"1357171200000":-1.8874322732,"1357257600000":0.9431407227,"1357344000000":-2.3326470578},"B":{"1356998400000":1.0732000476,"1357084800000":0.7068607735,"1357171200000":0.3100921491,"1357257600000":0.9504604358,"1357344000000":-1.07928764},"date":{"1356998400000":1356998400000,"1357084800000":1356998400000,"1357171200000":1356998400000,"1357257600000":1356998400000,"1357344000000":1356998400000},"ints":{"1356998400000":0,"1357084800000":1,"1357171200000":2,"1357257600000":3,"1357344000000":4},"bools":{"1356998400000":true,"1357084800000":true,"1357171200000":true,"1357257600000":true,"1357344000000":true}}

### Fallback behavior
If the JSON serializer cannot handle the container contents directly it will fall back in the following manner:

* if the dtype is unsupported (e.g. np.complex_) then the default_handler, if provided, will be called for each value, otherwise an exception is raised.
* if an object is unsupported it will attempt the following:
  * check if the object has defined a toDict method and call it. A toDict method should return a dict which will then be JSON serialized.
  * invoke the default_handler if one was provided.
  * convert the object to a dict by traversing its contents. However this will often fail with an OverflowError or give unexpected results.

In general the best approach for unsupported objects or dtypes is to provide a default_handler. For example:

In [156]:
try:
    DataFrame([1.0, 2.0, complex(1.0, 2.0)]).to_json()  # raises
except NameError as err:
    print("NameError: {0}".format(err))    
except:
    print("Unexpected error:", sys.exc_info()[0])
    raise
finally:
    print('continue after throwing error')

NameError: name 'DataFrame' is not defined
continue after throwing error

In [157]:
df = pd.DataFrame([1.0, 2.0, complex(1.0, 2.0)]).to_json(default_handler=str)
df

'{"0":{"0":"(1+0j)","1":"(2+0j)","2":"(1+2j)"}}'

## Reading JSON
Reading a JSON string to pandas object can take a number of parameters. The parser will try to parse a DataFrame if typ is not supplied or is None. To explicitly force Series parsing, pass typ=series

* filepath_or_buffer : a VALID JSON string or file handle / StringIO. The string could be a URL. Valid URL schemes include http, ftp, S3, and file. For file URLs, a host is expected. For instance, a local file could be file ://localhost/path/to/table.json
* typ : type of object to recover (series or frame), default ‘frame’
* orient :
  * Series :
    * default is index
    * allowed values are {split, records, index}
  * DataFrame
    * default is columns
    * allowed values are {split, records, index, columns, values, table}


The format of the JSON string

| Method | Description |
|-------|-------|
| split | dict like {index -> [index], columns -> [columns], data -> [values]} |
| records | list like [{column -> value}, … , {column -> value}] |
| index | dict like {index -> {column -> value}} |
| columns | dict like {column -> {index -> value}} |
| values | just the values array |
| table | adhering to the JSON Table Schema |

* dtype : if True, infer dtypes, if a dict of column to dtype, then use those, if False, then don’t infer dtypes at all, default is True, apply only to the data.
* convert_axes : boolean, try to convert the axes to the proper dtypes, default is True
* convert_dates : a list of columns to parse for dates; If True, then try to parse date-like columns, default is True.
* keep_default_dates : boolean, default True. If parsing dates, then parse the default date-like columns.
* numpy : direct decoding to NumPy arrays. default is False; Supports numeric data only, although labels may be non-numeric. Also note that the JSON ordering MUST be the same for each term if numpy=True.
* precise_float : boolean, default False. Set to enable usage of higher precision (strtod) function when decoding string to double values. Default (False) is to use fast but less precise builtin functionality.
* date_unit : string, the timestamp unit to detect if converting dates. Default None. By default the timestamp precision will be detected, if this is not desired then pass one of ‘s’, ‘ms’, ‘us’ or ‘ns’ to force timestamp precision to seconds, milliseconds, microseconds or nanoseconds respectively.
* lines : reads file as one json object per line.
* encoding : The encoding to use to decode py3 bytes.
* chunksize : when used in combination with lines=True, return a JsonReader which reads in chunksize lines per iteration.

The parser will raise one of ValueError/TypeError/AssertionError if the JSON is not parseable.

If a non-default orient was used when encoding to JSON be sure to pass the same option here so that decoding produces sensible results, see Orient Options for an overview.

### Data conversion
The default of convert_axes=True, dtype=True, and convert_dates=True will try to parse the axes, and all of the data into appropriate types, including dates. If you need to override specific dtypes, pass a dict to dtype. convert_axes should only be set to False if you need to preserve string-like numbers (e.g. ‘1’, ‘2’) in an axes.

>Note: Large integer values may be converted to dates if convert_dates=True and the data and / or column labels appear ‘date-like’. The exact threshold depends on the date_unit specified. ‘date-like’ means that the column label meets one of the following criteria:
>
>* it ends with '_at'
>* it ends with '_time'
>* it begins with 'timestamp'
>* it is 'modified'
>* it is 'date'

>Warning: When reading JSON data, automatic coercing into dtypes has some quirks:
>* an index can be reconstructed in a different order from serialization, that is, the returned order is not guaranteed to be the same as before serialization
>* a column that was float data will be converted to integer if it can be done safely, e.g. a column of 1.
>* bool columns will be converted to integer on reconstruction
>Thus there are times where you may want to specify specific dtypes via the dtype keyword argument.

Reading from a JSON string:

In [158]:
pd.read_json(json)

        date         B         A
0 2013-01-01 -2.104134  0.444036
1 2013-01-01 -1.504353 -0.526458
2 2013-01-01 -0.512157  1.098638
3 2013-01-01 -1.235669 -0.746048
4 2013-01-01  0.527000  0.010431

Reading from a file:

In [159]:
pd.read_json("data/file04_14.json")

                   A         B       date  ints  bools
2013-01-01 -1.636825  1.073200 2013-01-01     0   True
2013-01-02  0.390983  0.706861 2013-01-01     1   True
2013-01-03 -1.887432  0.310092 2013-01-01     2   True
2013-01-04  0.943141  0.950460 2013-01-01     3   True
2013-01-05 -2.332647 -1.079288 2013-01-01     4   True

Don’t convert any data (but still convert axes and dates):

In [160]:
pd.read_json("data/file04_14.json", dtype=object).dtypes

A        object
B        object
date     object
ints     object
bools    object
dtype: object

Specify dtypes for conversion:

In [161]:
pd.read_json("data/file04_14.json", dtype={"A": "float32", "bools": "int8"}).dtypes

A               float32
B               float64
date     datetime64[ns]
ints              int64
bools              int8
dtype: object

Preserve string indices:

In [162]:
si = pd.DataFrame(
    np.zeros((4, 4)), columns=list(range(4)), index=[str(i) for i in range(4)]
)
si

     0    1    2    3
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [163]:
si.index

Index(['0', '1', '2', '3'], dtype='object')

In [164]:
si.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [165]:
json = si.to_json()
sij = pd.read_json(json, convert_axes=False)
sij

   0  1  2  3
0  0  0  0  0
1  0  0  0  0
2  0  0  0  0
3  0  0  0  0

In [166]:
sij.index

Index(['0', '1', '2', '3'], dtype='object')

In [167]:
sij.columns

Index(['0', '1', '2', '3'], dtype='object')

Dates written in nanoseconds need to be read back in nanoseconds:

In [168]:
json = dfj2.to_json(date_unit="ns")

# Try to parse timestamps as milliseconds -> Won't Work
dfju = pd.read_json(json, date_unit="ms")
dfju

                            A         B                 date  ints  bools
1356998400000000000 -1.636825  1.073200  1356998400000000000     0   True
1357084800000000000  0.390983  0.706861  1356998400000000000     1   True
1357171200000000000 -1.887432  0.310092  1356998400000000000     2   True
1357257600000000000  0.943141  0.950460  1356998400000000000     3   True
1357344000000000000 -2.332647 -1.079288  1356998400000000000     4   True

In [169]:
# Let pandas detect the correct precision
dfju = pd.read_json(json)
dfju

                   A         B       date  ints  bools
2013-01-01 -1.636825  1.073200 2013-01-01     0   True
2013-01-02  0.390983  0.706861 2013-01-01     1   True
2013-01-03 -1.887432  0.310092 2013-01-01     2   True
2013-01-04  0.943141  0.950460 2013-01-01     3   True
2013-01-05 -2.332647 -1.079288 2013-01-01     4   True

In [170]:
# Or specify that all timestamps are in nanoseconds
dfju = pd.read_json(json, date_unit="ns")
dfju

                   A         B       date  ints  bools
2013-01-01 -1.636825  1.073200 2013-01-01     0   True
2013-01-02  0.390983  0.706861 2013-01-01     1   True
2013-01-03 -1.887432  0.310092 2013-01-01     2   True
2013-01-04  0.943141  0.950460 2013-01-01     3   True
2013-01-05 -2.332647 -1.079288 2013-01-01     4   True

### The Numpy parameter
>Note: This param has been deprecated as of version 1.0.0 and will raise a FutureWarning.
>
>This supports numeric data only. Index and columns labels may be non-numeric, e.g. strings, dates etc.

If numpy=True is passed to read_json an attempt will be made to sniff an appropriate dtype during deserialization and to subsequently decode directly to NumPy arrays, bypassing the need for intermediate Python objects.

This can provide speedups if you are deserialising a large amount of numeric data:

In [171]:
randfloats = np.random.uniform(-100, 1000, 10000)
randfloats.shape = (1000, 10)
dffloats = pd.DataFrame(randfloats, columns=list("ABCDEFGHIJ"))
jsonfloats = dffloats.to_json()

In [172]:
%timeit pd.read_json(jsonfloats)

27.2 ms ± 2.67 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [173]:
import warnings
with warnings.catch_warnings():
    warnings.simplefilter(action='ignore', category=FutureWarning)
    # Warning-causing lines of code here
    %timeit pd.read_json(jsonfloats, numpy=True)

20.6 ms ± 3.38 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

The speedup is less noticeable for smaller datasets:

In [174]:
jsonfloats = dffloats.head(100).to_json()

In [175]:
%timeit pd.read_json(jsonfloats)

11.7 ms ± 1.16 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [176]:
with warnings.catch_warnings():
    warnings.simplefilter(action='ignore', category=FutureWarning)
    # Warning-causing lines of code here
    %timeit pd.read_json(jsonfloats, numpy=True)

9.5 ms ± 619 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

>Warning: Direct NumPy decoding makes a number of assumptions and may fail or produce unexpected output if these assumptions are not satisfied:
>
>* data is numeric.
>* data is uniform. The dtype is sniffed from the first value decoded. A ValueError may be raised, or incorrect output may be produced if this condition is not satisfied.
>* labels are ordered. Labels are only read from the first container, it is assumed that each subsequent row / column has been encoded in the same order. This should be satisfied if the data was encoded using to_json but may not be the case if the JSON is from another source.

### Normalization
pandas provides a utility function to take a dict or list of dicts and normalize this semi-structured data into a flat table.

In [177]:
data = [
    {"id": 1, "name": {"first": "Coleen", "last": "Volk"}},
    {"name": {"given": "Mose", "family": "Regner"}},
    {"id": 2, "name": "Faye Raker"},
]
pd.json_normalize(data)

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mose      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker

In [178]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "county": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "county": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]
pd.json_normalize(data, "county", ["state", "shortname", ["info", "governor"]])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

The max_level parameter provides more control over which level to end normalization. With max_level=1 the following snippet normalizes until 1st nesting level of the provided dict.

In [179]:
data = [
    {
        "CreatedBy": {"Name": "User001"},
        "Lookup": {
            "TextField": "Some text",
            "UserField": {"Id": "ID001", "Name": "Name001"},
        },
        "Image": {"a": "b"},
    }
]
pd.json_normalize(data, max_level=1)

  CreatedBy.Name Lookup.TextField                    Lookup.UserField Image.a
0        User001        Some text  {'Id': 'ID001', 'Name': 'Name001'}       b

### Line delimited json
pandas is able to read and write line-delimited json files that are common in data processing pipelines using Hadoop or Spark.

For line-delimited json files, pandas can also return an iterator which reads in chunksize lines at a time. This can be useful for large files or to read from a stream.

In [180]:
jsonl = """
{"a": 1, "b": 2}
{"a": 3, "b": 4}
"""
df = pd.read_json(jsonl, lines=True)
df

   a  b
0  1  2
1  3  4

In [181]:
df.to_json(orient="records", lines=True)

'{"a":1,"b":2}\n{"a":3,"b":4}\n'

In [182]:
# reader is an iterator that returns ``chunksize`` lines each iteration
with pd.read_json(StringIO(jsonl), lines=True, chunksize=1) as reader:
    reader
    for chunk in reader:
        print(chunk)

Empty DataFrame
Columns: []
Index: []
   a  b
0  1  2
   a  b
1  3  4

### Table schema
Table Schema is a spec for describing tabular datasets as a JSON object. The JSON includes information on the field names, types, and other attributes. You can use the orient table to build a JSON string with two fields, schema and data.Table schema
Table Schema is a spec for describing tabular datasets as a JSON object. The JSON includes information on the field names, types, and other attributes. You can use the orient table to build a JSON string with two fields, schema and data.

In [183]:
df = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": ["a", "b", "c"],
        "C": pd.date_range("2016-01-01", freq="d", periods=3),
    },
    index=pd.Index(range(3), name="idx"),
)
df

     A  B          C
idx
0    1  a 2016-01-01
1    2  b 2016-01-02
2    3  c 2016-01-03

In [184]:
df.to_json(orient="table", date_format="iso")

'{"schema":{"fields":[{"name":"idx","type":"integer"},{"name":"A","type":"integer"},{"name":"B","type":"string"},{"name":"C","type":"datetime"}],"primaryKey":["idx"],"pandas_version":"0.20.0"},"data":[{"idx":0,"A":1,"B":"a","C":"2016-01-01T00:00:00.000Z"},{"idx":1,"A":2,"B":"b","C":"2016-01-02T00:00:00.000Z"},{"idx":2,"A":3,"B":"c","C":"2016-01-03T00:00:00.000Z"}]}'

The schema field contains the fields key, which itself contains a list of column name to type pairs, including the Index or MultiIndex (see below for a list of types). The schema field also contains a primaryKey field if the (Multi)index is unique.

The second field, data, contains the serialized data with the records orient. The index is included, and any datetimes are ISO 8601 formatted, as required by the Table Schema spec.

The full list of types supported are described in the Table Schema spec. This table shows the mapping from pandas types:

| *pandas type* | *Table Schema type* |
|---------------|---------------------|
| int64 | integer |
| float64 | number |
| bool | boolean |
| datetime64[ns] | datetime |
| timedelta64[ns] | duration |
| categorical | any |
| object | str |

A few notes on the generated table schema:

* The schema object contains a pandas_version field. This contains the version of pandas’ dialect of the schema, and will be incremented with each revision.
* All dates are converted to UTC when serializing. Even timezone naive values, which are treated as UTC with an offset of 0.

In [185]:
from pandas.io.json import build_table_schema
s = pd.Series(pd.date_range("2016", periods=4))
build_table_schema(s)

{'fields': [{'name': 'index', 'type': 'integer'},
  {'name': 'values', 'type': 'datetime'}],
 'primaryKey': ['index'],
 'pandas_version': '0.20.0'}

* datetimes with a timezone (before serializing), include an additional field tz with the time zone name (e.g. 'US/Central').

In [186]:
s_tz = pd.Series(pd.date_range("2016", periods=12, tz="US/Central"))
build_table_schema(s_tz)

{'fields': [{'name': 'index', 'type': 'integer'},
  {'name': 'values', 'type': 'datetime', 'tz': 'US/Central'}],
 'primaryKey': ['index'],
 'pandas_version': '0.20.0'}

* Periods are converted to timestamps before serialization, and so have the same behavior of being converted to UTC. In addition, periods will contain and additional field freq with the period’s frequency, e.g. 'A-DEC'.

In [187]:
s_per = pd.Series(1, index=pd.period_range("2016", freq="A-DEC", periods=4))
build_table_schema(s_per)

{'fields': [{'name': 'index', 'type': 'datetime', 'freq': 'A-DEC'},
  {'name': 'values', 'type': 'integer'}],
 'primaryKey': ['index'],
 'pandas_version': '0.20.0'}

* Categoricals use the any type and an enum constraint listing the set of possible values. Additionally, an ordered field is included:

In [188]:
s_cat = pd.Series(pd.Categorical(["a", "b", "a"]))
build_table_schema(s_cat)

{'fields': [{'name': 'index', 'type': 'integer'},
  {'name': 'values',
   'type': 'any',
   'constraints': {'enum': ['a', 'b']},
   'ordered': False}],
 'primaryKey': ['index'],
 'pandas_version': '0.20.0'}

* A primaryKey field, containing an array of labels, is included if the index is unique:

In [189]:
s_dupe = pd.Series([1, 2], index=[1, 1])
build_table_schema(s_dupe)

{'fields': [{'name': 'index', 'type': 'integer'},
  {'name': 'values', 'type': 'integer'}],
 'pandas_version': '0.20.0'}

* The primaryKey behavior is the same with MultiIndexes, but in this case the primaryKey is an array:

In [190]:
s_multi = pd.Series(1, index=pd.MultiIndex.from_product([("a", "b"), (0, 1)]))
build_table_schema(s_multi)

{'fields': [{'name': 'level_0', 'type': 'string'},
  {'name': 'level_1', 'type': 'integer'},
  {'name': 'values', 'type': 'integer'}],
 'primaryKey': FrozenList(['level_0', 'level_1']),
 'pandas_version': '0.20.0'}

* The default naming roughly follows these rules:
  * For series, the object.name is used. If that’s none, then the name is values
  * For DataFrames, the stringified version of the column name is used
  * For Index (not MultiIndex), index.name is used, with a fallback to index if that is None.
  * For MultiIndex, mi.names is used. If any level has no name, then level_<i> is used.

read_json also accepts orient='table' as an argument. This allows for the preservation of metadata such as dtypes and index names in a round-trippable manner.

In [191]:
df = pd.DataFrame(
    {
        "foo": [1, 2, 3, 4],
        "bar": ["a", "b", "c", "d"],
        "baz": pd.date_range("2018-01-01", freq="d", periods=4),
        "qux": pd.Categorical(["a", "b", "c", "c"]),
    },
    index=pd.Index(range(4), name="idx"),
)
df

     foo bar        baz qux
idx
0      1   a 2018-01-01   a
1      2   b 2018-01-02   b
2      3   c 2018-01-03   c
3      4   d 2018-01-04   c

In [192]:
df.dtypes

foo             int64
bar            object
baz    datetime64[ns]
qux          category
dtype: object

In [193]:
df.to_json("data/file04_15.json", orient="table")
new_df = pd.read_json("data/file04_15.json", orient="table")
new_df

     foo bar        baz qux
idx
0      1   a 2018-01-01   a
1      2   b 2018-01-02   b
2      3   c 2018-01-03   c
3      4   d 2018-01-04   c

In [194]:
new_df.dtypes

foo             int64
bar            object
baz    datetime64[ns]
qux          category
dtype: object

Please note that the literal string ‘index’ as the name of an Index is not round-trippable, nor are any names beginning with 'level_' within a MultiIndex. These are used by default in DataFrame.to_json() to indicate missing values and the subsequent read cannot distinguish the intent.

In [195]:
df.index.name = "index"
df.to_json("data/file04_16.json", orient="table")
new_df = pd.read_json("data/file04_16.json", orient="table")
print(new_df.index.name)

None

C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\pandas\io\json\_table_schema.py:87: UserWarning: Index name of 'index' is not round-trippable
  warnings.warn("Index name of 'index' is not round-trippable")

# HTML
## Reading HTML content
>Warning: We highly encourage you to read the HTML Table Parsing gotchas below regarding the issues surrounding the BeautifulSoup4/html5lib/lxml parsers.

The top-level read_html() function can accept an HTML string/file/URL and will parse HTML tables into list of pandas DataFrames. Let’s look at a few examples.

>Note: read_html returns a list of DataFrame objects, even if there is only a single table contained in the HTML content.

>Note: test files are available at `pandas\pandas\tests\io\data\html`

Read a URL with no options:

In [196]:
url = (
    "data/spam.html"
)
dfs = pd.read_html(url)
dfs

[                              Nutrient        Unit Value per 100.0g  \
 0                           Proximates  Proximates       Proximates
 1                                Water           g            51.70
 2                               Energy        kcal              315
 3                              Protein           g            13.40
 4                    Total lipid (fat)           g            26.60
 5          Carbohydrate, by difference           g             4.60
 6                 Fiber, total dietary           g              0.0
 7                        Sugars, total           g             0.00
 8                             Minerals    Minerals         Minerals
 9                          Calcium, Ca          mg                0
 10                            Iron, Fe          mg             0.64
 11                       Magnesium, Mg          mg               14
 12                       Phosphorus, P          mg              151
 13                        Potassium, K          mg              409
 14                          Sodium, Na          mg             1411
 15                            Zinc, Zn          mg             1.59
 16                            Vitamins    Vitamins         Vitamins
 17      Vitamin C, total ascorbic acid          mg              0.0
 18                             Thiamin          mg            0.317
 19                          Riboflavin          mg            0.176
 20                              Niacin          mg            3.530
 21                         Vitamin B-6          mg            0.218
 22                         Folate, DFE          µg                3
 23                        Vitamin B-12          µg             0.45
 24                      Vitamin A, RAE          µg                0
 25                       Vitamin A, IU          IU                0
 26        Vitamin E (alpha-tocopherol)          mg             0.42
 27                 Vitamin D (D2 + D3)          µg              0.6
 28                           Vitamin D          IU               26
 29           Vitamin K (phylloquinone)          µg              0.0
 30                              Lipids      Lipids           Lipids
 31        Fatty acids, total saturated           g            9.987
 32  Fatty acids, total monounsaturated           g           13.505
 33  Fatty acids, total polyunsaturated           g            2.019
 34                         Cholesterol          mg               71
 35                               Other       Other            Other
 36                            Caffeine          mg                0

    oz 1 NLEA serving  56g  Unnamed: 4  Unnamed: 5
 0              Proximates  Proximates  Proximates
 1                   28.95         NaN         NaN
 2                     176         NaN         NaN
 3                    7.50         NaN         NaN
 4                   14.90         NaN         NaN
 5                    2.58         NaN         NaN
 6                     0.0         NaN         NaN
 7                    0.00         NaN         NaN
 8                Minerals    Minerals    Minerals
 9                       0         NaN         NaN
 10                   0.36         NaN         NaN
 11                      8         NaN         NaN
 12                     85         NaN         NaN
 13                    229         NaN         NaN
 14                    790         NaN         NaN
 15                   0.89         NaN         NaN
 16               Vitamins    Vitamins    Vitamins
 17                    0.0         NaN         NaN
 18                  0.178         NaN         NaN
 19                  0.099         NaN         NaN
 20                  1.977         NaN         NaN
 21                  0.122         NaN         NaN
 22                      2         NaN         NaN
 23                   0.25         NaN         NaN
 24                      0         NaN         NaN
 25                      0         NaN         NaN
 26                   0.24         NaN         NaN
 27                    0.3         NaN         NaN
 28                     15         NaN         NaN
 29                    0.0         NaN         NaN
 30                 Lipids      Lipids      Lipids
 31                  5.593         NaN         NaN
 32                  7.563         NaN         NaN
 33                  1.131         NaN         NaN
 34                     40         NaN         NaN
 35                  Other       Other       Other
 36                      0         NaN         NaN  ]

Read in the content of the “banklist.html” file and pass it to read_html as a string:

In [197]:
with open("data/banklist.html", "r") as f:
    dfs = pd.read_html(f.read())
dfs

[                                    Bank Name          City  ST   CERT  \
 0    Banks of Wisconsin d/b/a Bank of Kenosha       Kenosha  WI  35386
 1                        Central Arizona Bank    Scottsdale  AZ  34527
 2                                Sunrise Bank      Valdosta  GA  58185
 3                       Pisgah Community Bank     Asheville  NC  58701
 4                         Douglas County Bank  Douglasville  GA  21649
 ..                                        ...           ...  ..    ...
 501                        Superior Bank, FSB      Hinsdale  IL  32646
 502                       Malta National Bank         Malta  OH   6629
 503           First Alliance Bank & Trust Co.    Manchester  NH  34264
 504         National State Bank of Metropolis    Metropolis  IL   3815
 505                          Bank of Honolulu      Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                  North Shore Bank, FSB       May 31, 2013       May 31, 2013
 1                     Western State Bank       May 14, 2013       May 20, 2013
 2                           Synovus Bank       May 10, 2013       May 21, 2013
 3                     Capital Bank, N.A.       May 10, 2013       May 14, 2013
 4                    Hamilton State Bank     April 26, 2013       May 16, 2013
 ..                                   ...                ...                ...
 501                Superior Federal, FSB      July 27, 2001       June 5, 2012
 502                    North Valley Bank        May 3, 2001  November 18, 2002
 503  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 504              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 505                   Bank of the Orient   October 13, 2000     March 17, 2005

 [506 rows x 7 columns]]

You can even pass in an instance of StringIO if you so desire:

In [198]:
with open("data/banklist.html", "r") as f:
    sio = StringIO(f.read())
dfs = pd.read_html(sio)
dfs

[                                    Bank Name          City  ST   CERT  \
 0    Banks of Wisconsin d/b/a Bank of Kenosha       Kenosha  WI  35386
 1                        Central Arizona Bank    Scottsdale  AZ  34527
 2                                Sunrise Bank      Valdosta  GA  58185
 3                       Pisgah Community Bank     Asheville  NC  58701
 4                         Douglas County Bank  Douglasville  GA  21649
 ..                                        ...           ...  ..    ...
 501                        Superior Bank, FSB      Hinsdale  IL  32646
 502                       Malta National Bank         Malta  OH   6629
 503           First Alliance Bank & Trust Co.    Manchester  NH  34264
 504         National State Bank of Metropolis    Metropolis  IL   3815
 505                          Bank of Honolulu      Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                  North Shore Bank, FSB       May 31, 2013       May 31, 2013
 1                     Western State Bank       May 14, 2013       May 20, 2013
 2                           Synovus Bank       May 10, 2013       May 21, 2013
 3                     Capital Bank, N.A.       May 10, 2013       May 14, 2013
 4                    Hamilton State Bank     April 26, 2013       May 16, 2013
 ..                                   ...                ...                ...
 501                Superior Federal, FSB      July 27, 2001       June 5, 2012
 502                    North Valley Bank        May 3, 2001  November 18, 2002
 503  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 504              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 505                   Bank of the Orient   October 13, 2000     March 17, 2005

 [506 rows x 7 columns]]

>Note: The following examples are not run by the IPython evaluator due to the fact that having so many network-accessing functions slows down the documentation build. If you spot an error or an example that doesn’t run, please do not hesitate to report it over on pandas GitHub issues page.

Read a URL and match a table that contains specific text:

In [199]:
match = "Metcalf Bank"
df_list = pd.read_html(sio, 
                       match=match)
df_list

[                                    Bank Name          City  ST   CERT  \
 0    Banks of Wisconsin d/b/a Bank of Kenosha       Kenosha  WI  35386
 1                        Central Arizona Bank    Scottsdale  AZ  34527
 2                                Sunrise Bank      Valdosta  GA  58185
 3                       Pisgah Community Bank     Asheville  NC  58701
 4                         Douglas County Bank  Douglasville  GA  21649
 ..                                        ...           ...  ..    ...
 501                        Superior Bank, FSB      Hinsdale  IL  32646
 502                       Malta National Bank         Malta  OH   6629
 503           First Alliance Bank & Trust Co.    Manchester  NH  34264
 504         National State Bank of Metropolis    Metropolis  IL   3815
 505                          Bank of Honolulu      Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                  North Shore Bank, FSB       May 31, 2013       May 31, 2013
 1                     Western State Bank       May 14, 2013       May 20, 2013
 2                           Synovus Bank       May 10, 2013       May 21, 2013
 3                     Capital Bank, N.A.       May 10, 2013       May 14, 2013
 4                    Hamilton State Bank     April 26, 2013       May 16, 2013
 ..                                   ...                ...                ...
 501                Superior Federal, FSB      July 27, 2001       June 5, 2012
 502                    North Valley Bank        May 3, 2001  November 18, 2002
 503  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 504              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 505                   Bank of the Orient   October 13, 2000     March 17, 2005

 [506 rows x 7 columns]]

Specify a header row (by default <th> or <td> elements located within a <thead> are used to form the column index, if multiple rows are contained within <thead> then a MultiIndex is created); if specified, the header row is taken from the data minus the parsed header elements (<th> elements).

In [200]:
dfs = pd.read_html(sio, header=0)

Specify an index column:

In [201]:
dfs = pd.read_html(sio, index_col=0)

Specify a number of rows to skip:

In [202]:
dfs = pd.read_html(sio, skiprows=0)

Specify a number of rows to skip using a list (range works as well):

In [203]:
dfs = pd.read_html(sio, skiprows=range(2))

Specify an HTML attribute:

In [204]:
dfs1 = pd.read_html(sio, attrs={"id": "table"})
dfs2 = pd.read_html(sio, attrs={"class": "sortable"})
print(np.array_equal(dfs1[0], dfs2[0]))  # Should be True

True

Specify values that should be converted to NaN:

In [205]:
dfs = pd.read_html(sio, na_values=["No Acquirer"])

Specify whether to keep the default set of NaN values:

In [206]:
dfs = pd.read_html(sio, keep_default_na=False)

Specify converters for columns. This is useful for numerical text data that has leading zeros. By default columns that are numerical are cast to numeric types and the leading zeros are lost. To avoid this, we can convert these columns to strings.

In [207]:
url_mcc = "https://en.wikipedia.org/wiki/Mobile_country_code"
dfs = pd.read_html(
    url_mcc,
    match="Albania",
    header=0,
    converters={"MNC": str},
)

Use some combination of the above:

In [208]:
dfs = pd.read_html(sio, match="Metcalf Bank", index_col=0)

Read in pandas to_html output (with some loss of floating point precision):

In [209]:
df = pd.DataFrame(np.random.randn(2, 2))
s = df.to_html(float_format="{0:.40g}".format)
dfin = pd.read_html(s, index_col=0)

The lxml backend will raise an error on a failed parse if that is the only parser you provide. If you only have a single parser you can provide just a string, but it is considered good practice to pass a list with one string if, for example, the function expects a sequence of strings. You may use:

In [210]:
dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor=["lxml"])

<ipython-input-210-7d897054d927>:1: FutureWarning: Starting with Pandas version 2.0 all arguments of read_html except for the argument 'io' will be keyword-only
  dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor=["lxml"])

Or you could pass flavor='lxml' without a list:

In [211]:
dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor="lxml")

<ipython-input-211-4e84947dfc8b>:1: FutureWarning: Starting with Pandas version 2.0 all arguments of read_html except for the argument 'io' will be keyword-only
  dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor="lxml")

However, if you have bs4 and html5lib installed and pass None or ['lxml', 'bs4'] then the parse will most likely succeed. Note that as soon as a parse succeeds, the function will return.

In [212]:
dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor=["lxml", "bs4"])

<ipython-input-212-6eb827d3b42c>:1: FutureWarning: Starting with Pandas version 2.0 all arguments of read_html except for the argument 'io' will be keyword-only
  dfs = pd.read_html(sio, "Metcalf Bank", index_col=0, flavor=["lxml", "bs4"])

## Writing to HTML files
DataFrame objects have an instance method to_html which renders the contents of the DataFrame as an HTML table. The function arguments are as in the method to_string described above.

>Note: Not all of the possible options for DataFrame.to_html are shown here for brevity’s sake. See to_html() for the full set of options.

```python
df = pd.DataFrame(np.random.randn(2, 2))
df
```
|--| **0** | **1** |
|--|---|---|
| **0** |-0.184744 | 0.496971 |
| **1** | -0.856240 | 1.857977 |

In [213]:
df = pd.DataFrame({0: [-0.184744, -0.856240], 1: [0.496971, 1.857977]}, index=[0, 1])
df

          0         1
0 -0.184744  0.496971
1 -0.856240  1.857977

In [214]:
print(df.to_html())  # raw html

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>-0.184744</td>
      <td>0.496971</td>
    </tr>
    <tr>
      <th>1</th>
      <td>-0.856240</td>
      <td>1.857977</td>
    </tr>
  </tbody>
</table>

HTML:

|--| **0** | **1** |
|--|---|---|
| **0** |-0.184744 | 0.496971 |
| **1** | -0.856240 | 1.857977 |

------

The columns argument will limit the columns shown:

In [215]:
print(df.to_html(columns=[0]))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>-0.184744</td>
    </tr>
    <tr>
      <th>1</th>
      <td>-0.856240</td>
    </tr>
  </tbody>
</table>

HTML:

|--| **0** |
|--|---|
| **0** |-0.184744 |
| **1** | -0.856240 |

------

float_format takes a Python callable to control the precision of floating point values:

In [216]:
print(df.to_html(float_format="{0:.10f}".format))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>-0.1847440000</td>
      <td>0.4969710000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>-0.8562400000</td>
      <td>1.8579770000</td>
    </tr>
  </tbody>
</table>

HTML:

|--| **0** | **1** |
|--|---|---|
| **0** |-0.184744 | 0.496971 |
| **1** | -0.856240 | 1.857977 |

------

bold_rows will make the row labels bold by default, but you can turn that off:

In [217]:
print(df.to_html(bold_rows=False))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>0</td>
      <td>-0.184744</td>
      <td>0.496971</td>
    </tr>
    <tr>
      <td>1</td>
      <td>-0.856240</td>
      <td>1.857977</td>
    </tr>
  </tbody>
</table>

HTML:

|--| **0** | **1** |
|--|---|---|
| 0 |-0.184744 | 0.496971 |
| 1 | -0.856240 | 1.857977 |

------

The classes argument provides the ability to give the resulting HTML table CSS classes. Note that these classes are appended to the existing 'dataframe' class.

In [218]:
print(df.to_html(classes=["awesome_table_class", "even_more_awesome_class"]))

<table border="1" class="dataframe awesome_table_class even_more_awesome_class">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>-0.184744</td>
      <td>0.496971</td>
    </tr>
    <tr>
      <th>1</th>
      <td>-0.856240</td>
      <td>1.857977</td>
    </tr>
  </tbody>
</table>

The render_links argument provides the ability to add hyperlinks to cells that contain URLs.

*New in version 0.24.*

In [219]:
url_df = pd.DataFrame(
    {
        "name": ["Python", "pandas"],
        "url": ["https://www.python.org/", "https://pandas.pydata.org"],
    }
)
print(url_df.to_html(render_links=True))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>url</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Python</td>
      <td><a href="https://www.python.org/" target="_blank">https://www.python.org/</a></td>
    </tr>
    <tr>
      <th>1</th>
      <td>pandas</td>
      <td><a href="https://pandas.pydata.org" target="_blank">https://pandas.pydata.org</a></td>
    </tr>
  </tbody>
</table>

HTML:

|--| **name** | **url** |
|--|---|---|
| **0** | Python | https://www.python.org/ |
| **1** | pandas | https://pandas.pydata.org |

------

Finally, the escape argument allows you to control whether the “<”, “>” and “&” characters escaped in the resulting HTML (by default it is True). So to get the HTML without escaped characters pass escape=False

```python
df = pd.DataFrame({"a": list("&<>"), "b": np.random.randn(3)})
```

In [220]:
df = pd.DataFrame({'a': ['&', '<', '>'], 'b': [-0.474063, -0.230305, -0.400654]})

In [221]:
print(df.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>&amp;</td>
      <td>-0.474063</td>
    </tr>
    <tr>
      <th>1</th>
      <td>&lt;</td>
      <td>-0.230305</td>
    </tr>
    <tr>
      <th>2</th>
      <td>&gt;</td>
      <td>-0.400654</td>
    </tr>
  </tbody>
</table>

In [222]:
df

   a         b
0  & -0.474063
1  < -0.230305
2  > -0.400654


----

Not escaped:

In [223]:
print(df.to_html(escape=False))

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>&</td>
      <td>-0.474063</td>
    </tr>
    <tr>
      <th>1</th>
      <td><</td>
      <td>-0.230305</td>
    </tr>
    <tr>
      <th>2</th>
      <td>></td>
      <td>-0.400654</td>
    </tr>
  </tbody>
</table>

In [224]:
df

   a         b
0  & -0.474063
1  < -0.230305
2  > -0.400654

>Note: Some browsers may not show a difference in the rendering of the previous two HTML tables.

## HTML Table Parsing Gotchas
There are some versioning issues surrounding the libraries that are used to parse HTML tables in the top-level pandas io function read_html.

#### Issues with lxml

* Benefits
  * lxml is very fast.
  * lxml requires Cython to install correctly.
* Drawbacks
  * lxml does not make any guarantees about the results of its parse unless it is given strictly valid markup.
  * In light of the above, we have chosen to allow you, the user, to use the lxml backend, but this backend will use html5lib if lxml fails to parse
  * It is therefore highly recommended that you install both BeautifulSoup4 and html5lib, so that you will still get a valid result (provided everything else is valid) even if lxml fails.

#### Issues with BeautifulSoup4 using lxml as a backend

* The above issues hold here as well since BeautifulSoup4 is essentially just a wrapper around a parser backend.

#### Issues with BeautifulSoup4 using html5lib as a backend

* Benefits
  * html5lib is far more lenient than lxml and consequently deals with real-life markup in a much saner way rather than just, e.g., dropping an element without notifying you.
  * html5lib generates valid HTML5 markup from invalid markup automatically. This is extremely important for parsing HTML tables, since it guarantees a valid document. However, that does NOT mean that it is “correct”, since the process of fixing markup does not have a single definition.
  * html5lib is pure Python and requires no additional build steps beyond its own installation.

* Drawbacks
  * The biggest drawback to using html5lib is that it is slow as molasses. However consider the fact that many tables on the web are not big enough for the parsing algorithm runtime to matter. It is more likely that the bottleneck will be in the process of reading the raw text from the URL over the web, i.e., IO (input-output). For very large tables, this might not be true.

# Excel files
The read_excel() method can read Excel 2007+ (.xlsx) files using the openpyxl Python module. Excel 2003 (.xls) files can be read using xlrd. Binary Excel (.xlsb) files can be read using pyxlsb. The to_excel() instance method is used for saving a DataFrame to Excel. Generally the semantics are similar to working with csv data. See the cookbook for some advanced strategies.

>Warning: The xlwt package for writing old-style .xls excel files is no longer maintained. The xlrd package is now only for reading old-style .xls files.
>
>Before pandas 1.2.0, the default argument engine=None to read_excel() would result in using the xlrd engine in many cases, including new Excel 2007+ (.xlsx) files. If openpyxl is installed, many of these cases will now default to using the openpyxl engine. See the read_excel() documentation for more details.
>
>Thus, it is strongly encouraged to install openpyxl to read Excel 2007+ (.xlsx) files. Please do not report issues when using ``xlrd`` to read ``.xlsx`` files. This is no longer supported, switch to using openpyxl instead.
>
>Attempting to use the the xlwt engine will raise a FutureWarning unless the option io.excel.xls.writer is set to "xlwt". While this option is now deprecated and will also raise a FutureWarning, it can be globally set and the warning suppressed. Users are recommended to write .xlsx files using the openpyxl engine instead.

## Reading Excel files
In the most basic use-case, read_excel takes a path to an Excel file, and the sheet_name indicating which sheet to parse.

In [225]:
# use writer to close file handle
writer = pd.ExcelWriter("data/file04_17.xls", engine='xlwt')

C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\IPython\core\interactiveshell.py:3357: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  if (await self.run_code(code, result,  async_=asy)):

In [226]:
# create target
df = pd.DataFrame({"A": ["A2", "A3", "A4"], 
                   "B": ["B2", "B3", "B4"]})
#df.to_excel("data/file04_17.xls")         # this leaves file handle open, unable to delete file
df.to_excel(writer)
writer.close()                             # you should be able to delete the file now

In [227]:
# Returns a DataFrame
pd.read_excel("data/file04_17.xls", sheet_name="Sheet1")  # reads to not leave a file handle open

   Unnamed: 0   A   B
0           0  A2  B2
1           1  A3  B3
2           2  A4  B4

### ExcelFile class
To facilitate working with multiple sheets from the same file, the ExcelFile class can be used to wrap the file and can be passed into read_excel There will be a performance benefit for reading multiple sheets as the file is read into memory only once.

In [228]:
xlsx = pd.ExcelFile(writer)
df = pd.read_excel(xlsx, "Sheet1")         # this leaves file handle open, unable to delete file
xlsx.close()                               # you should be able to delete the file now
print(df)

   Unnamed: 0   A   B
0           0  A2  B2
1           1  A3  B3
2           2  A4  B4


-----

In [229]:
# create target
df1i = pd.DataFrame({"a": [1, 2, 3, 4]})
df2i = pd.DataFrame({"b": [5, 6, 7, 8]})
df3i = pd.DataFrame({"c": [9, 10, 11, 12]})
df4i = pd.DataFrame({"d": [13, 14, 15, 16]})

# writer with context (with) will close file handle
with pd.ExcelWriter("data/file04_18.xls") as writer:
    df1i.to_excel(writer, sheet_name="Sheet1")
    df2i.to_excel(writer, sheet_name="Sheet2")
    df3i.to_excel(writer, sheet_name="Sheet3")
    df4i.to_excel(writer, sheet_name="Sheet4")

C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\IPython\core\interactiveshell.py:3357: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  if (await self.run_code(code, result,  async_=asy)):

The ExcelFile class can also be used as a context manager.

In [230]:
with pd.ExcelFile("data/file04_18.xls") as xls:
    df1 = pd.read_excel(xls, "Sheet1")
    df2 = pd.read_excel(xls, "Sheet2")

The sheet_names property will generate a list of the sheet names in the file.

The primary use-case for an ExcelFile is parsing multiple sheets with different parameters:

In [231]:
data = {}
# For when Sheet1's format differs from Sheet2
with pd.ExcelFile("data/file04_18.xls") as xls:
    data["Sheet1"] = pd.read_excel(xls, "Sheet1", index_col=None, na_values=["NA"])
    data["Sheet2"] = pd.read_excel(xls, "Sheet2", index_col=1)

Note that if the same parsing parameters are used for all sheets, a list of sheet names can simply be passed to read_excel with no loss in performance.

In [232]:
# using the ExcelFile class
data = {}
with pd.ExcelFile("data/file04_18.xls") as xls:
    data["Sheet1"] = pd.read_excel(xls, "Sheet1", index_col=None, na_values=["NA"])
    data["Sheet2"] = pd.read_excel(xls, "Sheet2", index_col=None, na_values=["NA"])

# equivalent using the read_excel function
data = pd.read_excel(
    "data/file04_18.xls", ["Sheet1", "Sheet2"], index_col=None, na_values=["NA"]
)

ExcelFile can also be called with a xlrd.book.Book object as a parameter. This allows the user to control how the excel file is read. For example, sheets can be loaded on demand by calling xlrd.open_workbook() with on_demand=True.

In [233]:
import xlrd

xlrd_book = xlrd.open_workbook("data/file04_18.xls", on_demand=True)
with pd.ExcelFile(xlrd_book) as xls:
    df1 = pd.read_excel(xls, "Sheet1")
    df2 = pd.read_excel(xls, "Sheet2")
    df3 = pd.read_excel(xls, "Sheet3")
    df4 = pd.read_excel(xls, "Sheet4")

# cleanup, close file handle and remove resource
xlrd_book.release_resources()
del xlrd_book

### Specifying sheets
> Note: The second argument is sheet_name, not to be confused with ExcelFile.sheet_names.

>Note: An ExcelFile’s attribute sheet_names provides access to a list of sheets.

* The arguments sheet_name allows specifying the sheet or sheets to read.
* The default value for sheet_name is 0, indicating to read the first sheet
* Pass a string to refer to the name of a particular sheet in the workbook.
* Pass an integer to refer to the index of a sheet. Indices follow Python convention, beginning at 0.
* Pass a list of either strings or integers, to return a dictionary of specified sheets.
* Pass a None to return a dictionary of all available sheets.

In [234]:
# Returns a DataFrame
pd.read_excel("data/file04_18.xls", "Sheet1", index_col=None, na_values=["NA"])

   Unnamed: 0  a
0           0  1
1           1  2
2           2  3
3           3  4

Using the sheet index:

In [235]:
# Returns a DataFrame
pd.read_excel("data/file04_18.xls", 0, index_col=None, na_values=["NA"])

   Unnamed: 0  a
0           0  1
1           1  2
2           2  3
3           3  4

Using all default values:

In [236]:
# Returns a DataFrame
pd.read_excel("data/file04_18.xls")

   Unnamed: 0  a
0           0  1
1           1  2
2           2  3
3           3  4

Using None to get all sheets:

In [237]:
# Returns a dictionary of DataFrames
pd.read_excel("data/file04_18.xls", sheet_name=None)

{'Sheet1':    Unnamed: 0  a
 0           0  1
 1           1  2
 2           2  3
 3           3  4,
 'Sheet2':    Unnamed: 0  b
 0           0  5
 1           1  6
 2           2  7
 3           3  8,
 'Sheet3':    Unnamed: 0   c
 0           0   9
 1           1  10
 2           2  11
 3           3  12,
 'Sheet4':    Unnamed: 0   d
 0           0  13
 1           1  14
 2           2  15
 3           3  16}

Using a list to get multiple sheets:

In [238]:
# Returns the 1st and 4th sheet, as a dictionary of DataFrames.
pd.read_excel("data/file04_18.xls", sheet_name=["Sheet1", 3])

{'Sheet1':    Unnamed: 0  a
 0           0  1
 1           1  2
 2           2  3
 3           3  4,
 3:    Unnamed: 0   d
 0           0  13
 1           1  14
 2           2  15
 3           3  16}

read_excel can read more than one sheet, by setting sheet_name to either a list of sheet names, a list of sheet positions, or None to read all sheets. Sheets can be specified by sheet index or sheet name, using an integer or string, respectively.

### Reading a MultiIndex
read_excel can read a MultiIndex index, by passing a list of columns to index_col and a MultiIndex column by passing a list of rows to header. If either the index or columns have serialized level names those will be read in as well by specifying the rows/columns that make up the levels.

For example, to read in a MultiIndex index without names:

In [239]:
df = pd.DataFrame(
    {"a": [1, 2, 3, 4], "b": [5, 6, 7, 8]},
    index=pd.MultiIndex.from_product([["a", "b"], ["c", "d"]]),
)

In [240]:
df.to_excel("data/file04_19.xlsx")
df = pd.read_excel("data/file04_19.xlsx", index_col=[0, 1])
print(df)

     a  b
a c  1  5
  d  2  6
b c  3  7
  d  4  8

If the index has level names, they will parsed as well, using the same parameters.

In [241]:
df.index = df.index.set_names(["lvl1", "lvl2"])
df.to_excel("data/file04_20.xlsx")
df = pd.read_excel("data/file04_20.xlsx", index_col=[0, 1])
print(df)

           a  b
lvl1 lvl2
a    c     1  5
     d     2  6
b    c     3  7
     d     4  8

If the source file has both MultiIndex index and columns, lists specifying each should be passed to index_col and header:

In [242]:
df.columns = pd.MultiIndex.from_product([["a"], ["b", "d"]], names=["c1", "c2"])
df.to_excel("data/file04_21.xlsx")
df = pd.read_excel("data/file04_21.xlsx", index_col=[0, 1], header=[0, 1])
print(df)

c1         a
c2         b  d
lvl1 lvl2
a    c     1  5
     d     2  6
b    c     3  7
     d     4  8

### Parsing specific columns
It is often the case that users will insert columns to do temporary computations in Excel and you may not want to read in those columns. read_excel takes a usecols keyword to allow you to specify a subset of columns to parse.

Changed in version 1.0.0.

Passing in an integer for usecols will no longer work. Please pass in a list of ints from 0 to usecols inclusive instead.

You can specify a comma-delimited set of Excel columns and ranges as a string:

In [243]:
# create target
df = pd.DataFrame({"A": ["A2", "A3", "A4"], 
                   "B": ["B2", "B3", "B4"],
                   "C": ["C2", "C3", "C4"],
                   "D": ["D2", "D3", "D4"],
                   "E": ["E2", "E3", "E4"],
                   "F": ["F2", "F3", "F4"],
                  })
df.to_excel("data/file04_22.xls")

<ipython-input-243-457570f4a5fd>:9: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel("data/file04_22.xls")

In [244]:
pd.read_excel("data/file04_22.xls", "Sheet1", usecols="A,C:E")  
# reindexed 1st col user data = 'A' so we miss the real data in the file

   Unnamed: 0   B   C   D
0           0  B2  C2  D2
1           1  B3  C3  D3
2           2  B4  C4  D4

If usecols is a list of integers, then it is assumed to be the file column indices to be parsed.

In [245]:
pd.read_excel("data/file04_22.xls", "Sheet1", usecols=[0, 2, 3])

   Unnamed: 0   B   C
0           0  B2  C2
1           1  B3  C3
2           2  B4  C4

Element order is ignored, so usecols=[0, 1] is the same as [1, 0].

New in version 0.24.

If usecols is a list of strings, it is assumed that each string corresponds to a column name provided either by the user in names or inferred from the document header row(s). Those strings define which columns will be parsed:

In [246]:
df = pd.DataFrame({"foo": [1, 2, 3, 4], "bar": [5, 6, 7, 8]})
df.to_excel("data/file04_23.xlsx")

In [247]:
pd.read_excel("data/file04_23.xlsx", "Sheet1", usecols=["foo", "bar"])

   foo  bar
0    1    5
1    2    6
2    3    7
3    4    8

Element order is ignored, so usecols=['baz', 'joe'] is the same as ['joe', 'baz'].

New in version 0.24.

If usecols is callable, the callable function will be evaluated against the column names, returning names where the callable function evaluates to True.

In [248]:
pd.read_excel("data/file04_19.xlsx", "Sheet1", usecols=lambda x: x.isalpha())

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

### Parsing dates
Datetime-like values are normally automatically converted to the appropriate dtype when reading the excel file. But if you have a column of strings that look like dates (but are not actually formatted as dates in excel), you can use the parse_dates keyword to parse those strings to datetimes:

In [249]:
df = pd.DataFrame({"date_strings": ["2021-06-03", "06/03/21", "06-03-21"], 
                   "raw_date_str": ["2021-06-03", "06/03/21", "06-03-21"]})
df.to_excel("data/file04_24.xlsx")

In [250]:
pd.read_excel("data/file04_24.xlsx", "Sheet1", 
              parse_dates=["date_strings"], 
              usecols=["date_strings", "raw_date_str"])

  date_strings raw_date_str
0   2021-06-03   2021-06-03
1   2021-06-03     06/03/21
2   2021-06-03     06-03-21

### Cell converters
It is possible to transform the contents of Excel cells via the converters option. For instance, to convert a column to boolean:

In [251]:
df = pd.DataFrame({"MyBools": [True, False, "TRUE", "FALSE"],
                   "expected": ["True", "False", "TRUE", "FALSE"]})
df.to_excel("data/file04_25.xlsx")

In [252]:
pd.read_excel("data/file04_25.xlsx", "Sheet1", 
              converters={"MyBools": bool}, 
              usecols=["MyBools", "expected"])

# Note:  strings will not be converted correctly so rows 2-3 are forced to `True`

   MyBools  expected
0     True      True
1    False     False
2     True      True
3     True     False

This options handles missing values and treats exceptions in the converters as missing data. Transformations are applied cell by cell rather than to the column as a whole, so the array dtype is not guaranteed. For instance, a column of integers with missing values cannot be transformed to an array with integer dtype, because NaN is strictly a float. You can manually mask missing data to recover integer dtype:

In [253]:
df = pd.DataFrame({"MyInts": ['', 'NaN', 'NA', 'NULL']})
df.to_excel("data/file04_26.xlsx")

In [254]:
def cfun(x):
    return int(x) if x else -1

pd.read_excel("data/file04_26.xlsx", "Sheet1", 
              converters={"MyInts": cfun},              
              usecols=["MyInts"])

  MyInts
0    NaN
1    NaN
2    NaN
3    NaN

Dtype specifications
As an alternative to converters, the type for an entire column can be specified using the dtype keyword, which takes a dictionary mapping column names to types. To interpret data with no type inference, use the type str or object.

In [255]:
df = pd.DataFrame({"MyInt64": [1, 2, 3, 4],
                  "MyInt64str": ['1', '2', '3', '4']})
df.to_excel("data/file04_27.xlsx")

In [256]:
pd.read_excel("data/file04_27.xlsx", "Sheet1", 
              dtype={"MyInt64": "int64", "MyInt64str": str},
              usecols=["MyInt64", "MyInt64str"])

# Note: dtype throws an exception if it can't cast the value to the type

   MyInt64 MyInt64str
0        1          1
1        2          2
2        3          3
3        4          4

## Writing Excel files
### Writing Excel files to disk
To write a DataFrame object to a sheet of an Excel file, you can use the to_excel instance method. The arguments are largely the same as to_csv described above, the first argument being the name of the excel file, and the optional second argument the name of the sheet to which the DataFrame should be written. For example:

In [257]:
df.to_excel("data/file04_27.xlsx", sheet_name="Sheet1")

Files with a .xls extension will be written using xlwt and those with a .xlsx extension will be written using xlsxwriter (if available) or openpyxl.

The DataFrame will be written in a way that tries to mimic the REPL output. The index_label will be placed in the second row instead of the first. You can place it in the first row by setting the merge_cells option in to_excel() to False:

In [258]:
df = pd.DataFrame({"MyInt64": [1, 2, 3, 4]})

In [259]:
df.to_excel("data/file04_28.xlsx", 
            index_label="label", 
            merge_cells=False)

In [260]:
pd.read_excel("data/file04_28.xlsx", "Sheet1", 
              dtype={"MyInt64": "int64"},
              usecols=["MyInt64"])

   MyInt64
0        1
1        2
2        3
3        4

In order to write separate DataFrames to separate sheets in a single Excel file, one can pass an ExcelWriter.

In [261]:
df1 = pd.DataFrame({"a": [1, 2, 3, 4]})
df2 = pd.DataFrame({"b": [5, 6, 7, 8]})

In [262]:
with pd.ExcelWriter("data/file04_29.xlsx") as writer:
    df1.to_excel(writer, sheet_name="Sheet1")
    df2.to_excel(writer, sheet_name="Sheet2")

>Note: Wringing a little more performance out of read_excel Internally, Excel stores all numeric data as floats. Because this can produce unexpected behavior when reading in data, pandas defaults to trying to convert integers to floats if it doesn’t lose information (1.0 --> 1). You can pass convert_float=False to disable this behavior, which may give a slight performance improvement.

### Writing Excel files to memory
pandas supports writing Excel files to buffer-like objects such as StringIO or BytesIO using ExcelWriter.

In [263]:
from io import BytesIO

bio = BytesIO()       # example of a `buffer-like object`

# By setting the 'engine' in the ExcelWriter constructor.
writer = pd.ExcelWriter(bio, engine="xlsxwriter")
df.to_excel(writer, sheet_name="Sheet1")

# Save the workbook
writer.save()

# Seek to the beginning and read to copy the workbook to a variable in memory
bio.seek(0)
workbook = bio.read()

>Note: engine is optional but recommended. Setting the engine determines the version of workbook produced. Setting engine='xlrd' will produce an Excel 2003-format workbook (xls). Using either 'openpyxl' or 'xlsxwriter' will produce an Excel 2007-format workbook (xlsx). If omitted, an Excel 2007-formatted workbook is produced.

## Excel writer engines
>Deprecated since version 1.2.0: As the xlwt package is no longer maintained, the xlwt engine will be removed from a future version of pandas. This is the only engine in pandas that supports writing to .xls files.

pandas chooses an Excel writer via two methods:

1. the engine keyword argument
2. the filename extension (via the default specified in config options)

By default, pandas uses the XlsxWriter for .xlsx, openpyxl for .xlsm, and xlwt for .xls files. If you have multiple engines installed, you can set the default engine through setting the config options io.excel.xlsx.writer and io.excel.xls.writer. pandas will fall back on openpyxl for .xlsx files if Xlsxwriter is not available.

To specify which writer you want to use, you can pass an engine keyword argument to to_excel and to ExcelWriter. The built-in engines are:

* openpyxl: version 2.4 or higher is required
* xlsxwriter
* xlwt

In [264]:
df = pd.DataFrame({"a": [8, 9, 10, 11]})
# By setting the 'engine' in the DataFrame 'to_excel()' methods.
df.to_excel("data/file04_30.xlsx", sheet_name="Sheet1", engine="xlsxwriter")

# By setting the 'engine' in the ExcelWriter constructor.
writer = pd.ExcelWriter("data/file04_30.xlsx", engine="xlsxwriter")
writer.close()                             # you should be able to delete the file now

In [265]:
# Or via pandas configuration.
from pandas import options  # noqa: E402

options.io.excel.xlsx.writer = "xlsxwriter"
df.to_excel("data/file04_31.xlsx", sheet_name="Sheet1")
# the file handle is closed using this approach so you should be able to delete the file now

### Style and formatting
The look and feel of Excel worksheets created from pandas can be modified using the following parameters on the DataFrame’s to_excel method.

* float_format : Format string for floating point numbers (default None).
* freeze_panes : A tuple of two integers representing the bottommost row and rightmost column to freeze. Each of these parameters is one-based, so (1, 1) will freeze the first row and first column (default None).

Using the Xlsxwriter engine provides many options for controlling the format of an Excel worksheet created with the to_excel method. Excellent examples can be found in the Xlsxwriter documentation here: https://xlsxwriter.readthedocs.io/working_with_pandas.html

## OpenDocument Spreadsheets
New in version 0.25.

The read_excel() method can also read OpenDocument spreadsheets using the odfpy module. The semantics and features for reading OpenDocument spreadsheets match what can be done for Excel files using engine='odf'.

>Note: We are using `pyexcel_ods3` to write the `ods` file!

In [266]:
# create target
from collections import OrderedDict
from pyexcel_ods3 import save_data
data = OrderedDict()
data.update({"Sheet 1": [[1, 2, 3], [4, 5, 6]]})
data.update({"Sheet 2": [["row 1", "row 2", "row 3"]]})
save_data("data/file04_32.ods", data)

C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\pyexcel_io\book.py:32: UserWarning: Deprecated since v0.6.0! Although backward compatibility is preserved, it is recommended to upgrade to get new features.
  warnings.warn(DEPRECATED_SINCE_0_6_0)

In [267]:
# Returns a DataFrame
print('from pyexcel_ods3 import get_data')
from pyexcel_ods3 import get_data

print('rdata = get_data("data/file04_32.ods")')
rdata = get_data("data/file04_32.ods")

print('\nprint(rdata)')
print(rdata)

print('\nfrom pprint import PrettyPrinter')
from pprint import PrettyPrinter
print('PrettyPrinter(sort_dicts=False).pprint(rdata)')
PrettyPrinter(sort_dicts=False).pprint(rdata)

print('\nimport json')
import json
print('print(json.dumps(rdata))')
print(json.dumps(rdata))

print('\nimport pprint')
import pprint
print('pprint.pprint(json.dumps(rdata)))')
pprint.pprint(json.dumps(rdata))

from pyexcel_ods3 import get_data
rdata = get_data("data/file04_32.ods")

print(rdata)
OrderedDict([('Sheet 1', [[1, 2, 3], [4, 5, 6]]), ('Sheet 2', [['row 1', 'row 2', 'row 3']])])

from pprint import PrettyPrinter
PrettyPrinter(sort_dicts=False).pprint(rdata)
OrderedDict([('Sheet 1', [[1, 2, 3], [4, 5, 6]]),
             ('Sheet 2', [['row 1', 'row 2', 'row 3']])])

import json
print(json.dumps(rdata))
{"Sheet 1": [[1, 2, 3], [4, 5, 6]], "Sheet 2": [["row 1", "row 2", "row 3"]]}

import pprint
pprint.pprint(json.dumps(rdata)))
'{"Sheet 1": [[1, 2, 3], [4, 5, 6]], "Sheet 2": [["row 1", "row 2", "row 3"]]}'

>Note: Currently pandas only supports reading OpenDocument spreadsheets. Writing is not implemented.

## Binary Excel (.xlsb) files
*New in version 1.0.0.*

The read_excel() method can also read binary Excel files using the pyxlsb module. The semantics and features for reading binary Excel files mostly match what can be done for Excel files using engine='pyxlsb'. pyxlsb does not recognize datetime types in files and will return floats instead.

>Note: There is no good way to write `xlsb` files from python, all we can do is read!

In [268]:
# Returns a DataFrame
pd.read_excel("data/baseball.xlsb", 
              engine="pyxlsb")

,id,player,year,stint,team,lg,g,ab,r,h,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,88641,womacto01,2006,2,CHN,NL,19,50,6,14,...,2,1,1,4,4,0,0,3,0,0
1,88643,schilcu01,2006,1,BOS,AL,31,2,0,1,...,0,0,0,0,1,0,0,0,0,0
2,88645,myersmi01,2006,1,NYA,AL,62,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,88649,helliri01,2006,1,MIL,NL,20,3,0,0,...,0,0,0,0,2,0,0,0,0,0
4,88650,johnsra05,2006,1,NYA,AL,33,6,0,1,...,0,0,0,0,4,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,89525,benitar01,2007,2,FLO,NL,34,0,0,0,...,0,0,0,0,0,0,0,0,0,0
96,89526,benitar01,2007,1,SFN,NL,19,0,0,0,...,0,0,0,0,0,0,0,0,0,0
97,89530,ausmubr01,2007,1,HOU,NL,117,349,38,82,...,25,6,1,37,74,3,6,4,1,11
98,89533,aloumo01,2007,1,NYN,NL,87,328,51,112,...,49,3,0,27,30,5,2,0,3,13
99,89534,alomasa02,2007,1,NYN,NL,8,22,1,3,...,0,0,0,0,3,0,0,0,0,0

>Note: Currently pandas only supports reading binary Excel files. Writing is not implemented.

## Clipboard
A handy way to grab data is to use the read_clipboard() method, which takes the contents of the clipboard buffer and passes them to the read_csv method. For instance, you can copy the following text to the clipboard (CTRL-C on many operating systems):
```shell
  A B C
x 1 4 p
y 2 5 q
z 3 6 r
```
And then import the data directly to a DataFrame by calling:

In [269]:
# from the keyboard, copy the above matrix, then run the python code
# I'll cheat and load the clipboard from code
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": ["p", "q", "r"]}, index=["x", "y", "z"])
df.to_clipboard()

In [270]:
clipdf = pd.read_clipboard()
clipdf

   A  B  C
x  1  4  p
y  2  5  q
z  3  6  r

The to_clipboard method can be used to write the contents of a DataFrame to the clipboard. Following which you can paste the clipboard contents into other applications (CTRL-V on many operating systems). Here we illustrate writing a DataFrame into clipboard and reading it back.

In [271]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": ["p", "q", "r"]}, index=["x", "y", "z"])
df

   A  B  C
x  1  4  p
y  2  5  q
z  3  6  r

In [272]:
df.to_clipboard()
pd.read_clipboard()

   A  B  C
x  1  4  p
y  2  5  q
z  3  6  r

We can see that we got the same content back, which we had earlier written to the clipboard.

>Note: You may need to install xclip or xsel (with PyQt5, PyQt4 or qtpy) on Linux to use these methods.

## Pickling
All pandas objects are equipped with to_pickle methods which use Python’s cPickle module to save data structures to disk using the pickle format.

In [273]:
df = pd.read_excel("data/file04_21.xlsx", index_col=[0, 1], header=[0, 1])
print(df)
df.to_pickle("data/file04_33.pkl")

c1         a
c2         b  d
lvl1 lvl2
a    c     1  5
     d     2  6
b    c     3  7
     d     4  8

The read_pickle function in the pandas namespace can be used to load any pickled pandas object (or any other pickled object) from file:

In [274]:
pd.read_pickle("data/file04_33.pkl")

c1         a
c2         b  d
lvl1 lvl2
a    c     1  5
     d     2  6
b    c     3  7
     d     4  8

>Warning: Loading pickled data received from untrusted sources can be unsafe.
>
>See: https://docs.python.org/3/library/pickle.html

>Warning: read_pickle() is only guaranteed backwards compatible back to pandas version 0.20.3

### Compressed pickle files
read_pickle(), DataFrame.to_pickle() and Series.to_pickle() can read and write compressed pickle files. The compression types of gzip, bz2, xz are supported for reading and writing. The zip file format only supports reading and must contain only one data file to be read.

The compression type can be an explicit parameter or be inferred from the file extension. If ‘infer’, then use gzip, bz2, zip, or xz if filename ends in '.gz', '.bz2', '.zip', or '.xz', respectively.

The compression parameter can also be a dict in order to pass options to the compression protocol. It must have a 'method' key set to the name of the compression protocol, which must be one of {'zip', 'gzip', 'bz2'}. All other key-value pairs are passed to the underlying compression library.

In [275]:
df = pd.DataFrame(
    {
        "A": np.random.randn(1000),
        "B": "foo",
        "C": pd.date_range("20130101", periods=1000, freq="s"),
    }
)
df

            A    B                   C
0   -0.055994  foo 2013-01-01 00:00:00
1   -0.602745  foo 2013-01-01 00:00:01
2    0.893215  foo 2013-01-01 00:00:02
3   -0.595898  foo 2013-01-01 00:00:03
4    0.676481  foo 2013-01-01 00:00:04
..        ...  ...                 ...
995 -0.076506  foo 2013-01-01 00:16:35
996 -1.275506  foo 2013-01-01 00:16:36
997  0.665411  foo 2013-01-01 00:16:37
998  1.042901  foo 2013-01-01 00:16:38
999  0.657634  foo 2013-01-01 00:16:39

[1000 rows x 3 columns]

Using an explicit compression type:

In [276]:
df.to_pickle("data/file04_34.pkl.compress", compression="gzip")
rt = pd.read_pickle("data/file04_34.pkl.compress", compression="gzip")
rt

            A    B                   C
0   -0.055994  foo 2013-01-01 00:00:00
1   -0.602745  foo 2013-01-01 00:00:01
2    0.893215  foo 2013-01-01 00:00:02
3   -0.595898  foo 2013-01-01 00:00:03
4    0.676481  foo 2013-01-01 00:00:04
..        ...  ...                 ...
995 -0.076506  foo 2013-01-01 00:16:35
996 -1.275506  foo 2013-01-01 00:16:36
997  0.665411  foo 2013-01-01 00:16:37
998  1.042901  foo 2013-01-01 00:16:38
999  0.657634  foo 2013-01-01 00:16:39

[1000 rows x 3 columns]

Inferring compression type from the extension:

In [277]:
df.to_pickle("data/file04_35.pkl.xz", compression="infer")
rt = pd.read_pickle("data/file04_35.pkl.xz", compression="infer")
rt

            A    B                   C
0   -0.055994  foo 2013-01-01 00:00:00
1   -0.602745  foo 2013-01-01 00:00:01
2    0.893215  foo 2013-01-01 00:00:02
3   -0.595898  foo 2013-01-01 00:00:03
4    0.676481  foo 2013-01-01 00:00:04
..        ...  ...                 ...
995 -0.076506  foo 2013-01-01 00:16:35
996 -1.275506  foo 2013-01-01 00:16:36
997  0.665411  foo 2013-01-01 00:16:37
998  1.042901  foo 2013-01-01 00:16:38
999  0.657634  foo 2013-01-01 00:16:39

[1000 rows x 3 columns]

The default is to ‘infer’:

In [278]:
df.to_pickle("data/file04_36.pkl.gz")
rt = pd.read_pickle("data/file04_36.pkl.gz")
rt

            A    B                   C
0   -0.055994  foo 2013-01-01 00:00:00
1   -0.602745  foo 2013-01-01 00:00:01
2    0.893215  foo 2013-01-01 00:00:02
3   -0.595898  foo 2013-01-01 00:00:03
4    0.676481  foo 2013-01-01 00:00:04
..        ...  ...                 ...
995 -0.076506  foo 2013-01-01 00:16:35
996 -1.275506  foo 2013-01-01 00:16:36
997  0.665411  foo 2013-01-01 00:16:37
998  1.042901  foo 2013-01-01 00:16:38
999  0.657634  foo 2013-01-01 00:16:39

[1000 rows x 3 columns]

In [279]:
df["A"].to_pickle("data/file04_37.pkl.bz2")
rt = pd.read_pickle("data/file04_37.pkl.bz2")
rt

0     -0.055994
1     -0.602745
2      0.893215
3     -0.595898
4      0.676481
         ...
995   -0.076506
996   -1.275506
997    0.665411
998    1.042901
999    0.657634
Name: A, Length: 1000, dtype: float64

Passing options to the compression protocol in order to speed up compression:

In [280]:
df["A"].to_pickle("data/file04_38.pkl.bz2")
df.to_pickle("data/file04_39.pkl.gz", compression={"method": "gzip", "compresslevel": 1})

### msgpack
pandas support for msgpack has been removed in version 1.0.0. It is recommended to use pyarrow for on-the-wire transmission of pandas objects.

### pyarrow
Example pyarrow usage:

In [281]:
import pandas as pd
import pyarrow as pa

df = pd.DataFrame({"A": [1, 2, 3]})

context = pa.default_serialization_context()
df_bytestring = context.serialize(df).to_buffer().to_pybytes()

<ipython-input-281-b526ae71b4a3>:6: FutureWarning: 'pyarrow.default_serialization_context' is deprecated as of 2.0.0 and will be removed in a future version. Use pickle or the pyarrow IPC functionality instead.
  context = pa.default_serialization_context()
C:\bin\anaconda3\envs\eda_dev39\lib\site-packages\IPython\core\interactiveshell.py:3357: FutureWarning: 'pyarrow.serialize' is deprecated as of 2.0.0 and will be removed in a future version. Use pickle or the pyarrow IPC functionality instead.
  if (await self.run_code(code, result,  async_=asy)):

For documentation on pyarrow, see [here](https://arrow.apache.org/docs/python/index.html).

## HDF5 (PyTables)
HDFStore is a dict-like object which reads and writes pandas using the high performance HDF5 format using the excellent PyTables library. See the cookbook for some advanced strategies

>Warning: pandas uses PyTables for reading and writing HDF5 files, which allows serializing object-dtype data with pickle. Loading pickled data received from untrusted sources can be unsafe.

See: https://docs.python.org/3/library/pickle.html for more.

In [282]:
store = pd.HDFStore("data/file04_40.h5")
print(store)

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_40.h5

Objects can be written to the file just like adding key-value pairs to a dict:

In [283]:
index = pd.date_range("1/1/2000", periods=8)
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])

# store.put('s', s) is an equivalent method
store["s"] = s
store["df"] = df
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_40.h5

In a current or later Python session, you can retrieve stored objects:

In [284]:
# store.get('df') is an equivalent method
store["df"]

                   A         B         C
2000-01-01 -0.636763  0.578060  1.222532
2000-01-02  0.867940 -0.493793 -1.074471
2000-01-03  0.567582 -1.167105 -1.251558
2000-01-04  0.332973  1.081091 -1.494339
2000-01-05  0.385350  0.627424  1.085825
2000-01-06  0.544428 -1.108716  1.291070
2000-01-07  1.283860 -0.447312  0.950420
2000-01-08 -0.992713 -0.322635  0.742713

In [285]:
# dotted (attribute) access provides get as well
store.df

                   A         B         C
2000-01-01 -0.636763  0.578060  1.222532
2000-01-02  0.867940 -0.493793 -1.074471
2000-01-03  0.567582 -1.167105 -1.251558
2000-01-04  0.332973  1.081091 -1.494339
2000-01-05  0.385350  0.627424  1.085825
2000-01-06  0.544428 -1.108716  1.291070
2000-01-07  1.283860 -0.447312  0.950420
2000-01-08 -0.992713 -0.322635  0.742713

Deletion of the object specified by the key:

In [286]:
# store.remove('df') is an equivalent method
del store["df"]
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_40.h5

Closing a Store and using a context manager:

In [287]:
store.close()
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_40.h5

In [288]:
store.is_open

False

In [289]:
# Working with, and automatically closing the store using a context manager
with pd.HDFStore("data/file04_40.h5") as store:
    store.keys()
store.is_open

False

### Read/write API
HDFStore supports a top-level API using read_hdf for reading and to_hdf for writing, similar to how read_csv and to_csv work.

In [290]:
df_tl = pd.DataFrame({"A": list(range(5)), "B": list(range(5))})
df_tl.to_hdf("data/file04_41.h5", "table", append=True)
pd.read_hdf("data/file04_41.h5", "table", where=["index>2"])

   A  B
3  3  3
4  4  4

HDFStore will by default not drop rows that are all missing. This behavior can be changed by setting dropna=True.

In [291]:
df_with_missing = pd.DataFrame(
    {
        "col1": [0, np.nan, 2],
        "col2": [1, np.nan, np.nan],
    }
)
df_with_missing

   col1  col2
0   0.0   1.0
1   NaN   NaN
2   2.0   NaN

In [292]:
df_with_missing.to_hdf("data/file04_42.h5", "df_with_missing", format="table", mode="w")
pd.read_hdf("data/file04_42.h5", "df_with_missing")

   col1  col2
0   0.0   1.0
1   NaN   NaN
2   2.0   NaN

In [293]:
df_with_missing.to_hdf(
    "data/file04_43.h5", "df_with_missing", format="table", mode="w", dropna=True
)
pd.read_hdf("data/file04_43.h5", "df_with_missing")

   col1  col2
0   0.0   1.0
2   2.0   NaN

>Note: the `dropna=True` only looked at `col1`

### Fixed format
The examples above show storing using put, which write the HDF5 to PyTables in a fixed array format, called the fixed format. These types of stores are not appendable once written (though you can simply remove them and rewrite). Nor are they queryable; they must be retrieved in their entirety. They also do not support dataframes with non-unique column names. The fixed format stores offer very fast writing and slightly faster reading than table stores. This format is specified by default when using put or to_hdf or by format='fixed' or format='f'.

>Warning: A fixed format will raise a TypeError if you try to retrieve using a where:

In [294]:
pd.DataFrame(np.random.randn(10, 2)).to_hdf("data/file04_44.h5", "df")

In [295]:
try:
    pd.read_hdf("data/file04_44.h5", "df", where="index>5")
except:
    print('Unexpected error:', sys.exc_info()[0])
    print('TypeError: cannot pass a where specification when reading from a Fixed format store. \n'
          +'\tThis store must be selected in its entirety.')

Unexpected error: <class 'TypeError'>
TypeError: cannot pass a where specification when reading from a Fixed format store.
	This store must be selected in its entirety.

### Table format
HDFStore supports another PyTables format on disk, the table format. Conceptually a table is shaped very much like a DataFrame, with rows and columns. A table may be appended to in the same or other sessions. In addition, delete and query type operations are supported. This format is specified by format='table' or format='t' to append or put or to_hdf.

This format can be set as an option as well pd.set_option('io.hdf.default_format','table') to enable put/append/to_hdf to by default store in the table format.

In [296]:
store = pd.HDFStore("data/file04_45.h5")
print(store)

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_45.h5

In [297]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789
2000-01-02 -1.463188  0.007477  1.078177
2000-01-03  0.564553  0.187894 -1.187380
2000-01-04  0.884425  1.311461  1.728887
2000-01-05 -2.464715  1.675300 -0.616764
2000-01-06 -1.496193  1.216072  0.189168
2000-01-07  1.177967 -0.186760 -0.801760
2000-01-08  0.143245 -1.599118 -0.530735

In [298]:
df1 = df[0:4]
df1

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789
2000-01-02 -1.463188  0.007477  1.078177
2000-01-03  0.564553  0.187894 -1.187380
2000-01-04  0.884425  1.311461  1.728887

In [299]:
df2 = df[4:]
df2

                   A         B         C
2000-01-05 -2.464715  1.675300 -0.616764
2000-01-06 -1.496193  1.216072  0.189168
2000-01-07  1.177967 -0.186760 -0.801760
2000-01-08  0.143245 -1.599118 -0.530735

In [300]:
df3 = df[:1]
df3

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789

In [301]:
# append data (creates a table automatically)
store.append("df", df)
store.append("df1", df1)
store.append("df2", df2)
store.append("df3", df3)
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_45.h5

In [302]:
store.select("df")

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789
2000-01-02 -1.463188  0.007477  1.078177
2000-01-03  0.564553  0.187894 -1.187380
2000-01-04  0.884425  1.311461  1.728887
2000-01-05 -2.464715  1.675300 -0.616764
2000-01-06 -1.496193  1.216072  0.189168
2000-01-07  1.177967 -0.186760 -0.801760
2000-01-08  0.143245 -1.599118 -0.530735

In [303]:
store.select("df1")

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789
2000-01-02 -1.463188  0.007477  1.078177
2000-01-03  0.564553  0.187894 -1.187380
2000-01-04  0.884425  1.311461  1.728887

In [304]:
store.select("df2")

                   A         B         C
2000-01-05 -2.464715  1.675300 -0.616764
2000-01-06 -1.496193  1.216072  0.189168
2000-01-07  1.177967 -0.186760 -0.801760
2000-01-08  0.143245 -1.599118 -0.530735

In [305]:
store.select("df3")

                   A         B         C
2000-01-01 -0.975202 -2.625011  0.439789

In [306]:
store.root.df._v_attrs.pandas_type

'frame_table'

In [307]:
# don't forget to close the resource, the file handle will be left open if you don't
store.close()

>Note: You can also create a table by passing format='table' or format='t' to a put operation.

### Hierarchical keys
Keys to a store can be specified as a string. These can be in a hierarchical path-name like format (e.g. foo/bar/bah), which will generate a hierarchy of sub-stores (or Groups in PyTables parlance). Keys can be specified without the leading ‘/’ and are always absolute (e.g. ‘foo’ refers to ‘/foo’). Removal operations can remove everything in the sub-store and below, so be careful.

In [308]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
store = pd.HDFStore("data/file04_46.h5")

In [309]:
store.put("foo/bar/bah", df)
store.append("food/orange", df[0:4])
store.append("food/apple", df[:1])
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_46.h5

In [310]:
# a list of keys are returned
store.keys()

['/food/apple', '/food/orange', '/foo/bar/bah']

In [311]:
# remove all nodes under this level
store.remove("food")
store.keys()

['/foo/bar/bah']

You can walk through the group hierarchy using the walk method which will yield a tuple for each group key along with the relative keys of its contents.

*New in version 0.24.0.*

In [312]:
for (path, subgroups, subkeys) in store.walk():
    for subgroup in subgroups:
        print("GROUP: {}/{}".format(path, subgroup))
    for subkey in subkeys:
        key = "/".join([path, subkey])
        print("KEY: {}".format(key))
        print(store.get(key))

GROUP: /foo
GROUP: /foo/bar
KEY: /foo/bar/bah
                   A         B         C
2000-01-01  0.983328  0.932681  1.157480
2000-01-02 -0.431009  0.322871 -1.195069
2000-01-03 -0.484128  0.227366  1.504793
2000-01-04  0.711290 -0.912889 -0.952198
2000-01-05  3.026639  0.053869  0.580684
2000-01-06  0.192220 -0.801456 -0.535061
2000-01-07  0.320628  0.868178 -0.705522
2000-01-08  0.630164 -1.106466 -0.929840

>Warning: Hierarchical keys cannot be retrieved as dotted (attribute) access as described above for items stored under the root node.

In [313]:
try:
    store.foo.bar.bah
except:
    print('Unexpected error:', sys.exc_info()[0])
    print('TypeError: cannot create a storer if the object is not existing nor a value are passed.')

Unexpected error: <class 'TypeError'>
TypeError: cannot create a storer if the object is not existing nor a value are passed.

In [314]:
# you can directly access the actual PyTables node but using the root node
store.root.foo.bar.bah

/foo/bar/bah (Group) ''
  children := ['axis0' (Array), 'axis1' (Array), 'block0_values' (Array), 'block0_items' (Array)]

Instead, use explicit string based keys:

In [315]:
store["foo/bar/bah"]

                   A         B         C
2000-01-01  0.983328  0.932681  1.157480
2000-01-02 -0.431009  0.322871 -1.195069
2000-01-03 -0.484128  0.227366  1.504793
2000-01-04  0.711290 -0.912889 -0.952198
2000-01-05  3.026639  0.053869  0.580684
2000-01-06  0.192220 -0.801456 -0.535061
2000-01-07  0.320628  0.868178 -0.705522
2000-01-08  0.630164 -1.106466 -0.929840

In [316]:
store.close()

### Storing types
#### Storing mixed types in a table
Storing mixed-dtype data is supported. Strings are stored as a fixed-width using the maximum size of the appended column. Subsequent attempts at appending longer strings will raise a ValueError.

Passing min_itemsize={`values`: size} as a parameter to append will set a larger minimum for the string columns. Storing floats, strings, ints, bools, datetime64 are currently supported. For string columns, passing nan_rep = 'nan' to append will change the default nan representation on disk (which converts to/from np.nan), this defaults to nan.

In [317]:
df_mixed = pd.DataFrame(
    {
        "A": np.random.randn(8),
        "B": np.random.randn(8),
        "C": np.array(np.random.randn(8), dtype="float32"),
        "string": "string",
        "int": 1,
        "bool": True,
        "datetime64": pd.Timestamp("20010102"),
    },
    index=list(range(8)),
)

df_mixed.loc[df_mixed.index[3:5], ["A", "B", "string", "datetime64"]] = np.nan

store = pd.HDFStore("data/file04_47.h5")
store.append("df_mixed", df_mixed, min_itemsize={"values": 50})
df_mixed1 = store.select("df_mixed")
df_mixed1

          A         B         C  string  int  bool datetime64
0  2.113752 -1.834772 -0.470658  string    1  True 2001-01-02
1  1.363262  0.427580 -0.293256  string    1  True 2001-01-02
2 -1.120075  1.079311 -1.102497  string    1  True 2001-01-02
3       NaN       NaN -0.285166     NaN    1  True        NaT
4       NaN       NaN  0.210084     NaN    1  True        NaT
5  0.751756 -1.664341 -0.711739  string    1  True 2001-01-02
6  0.192397 -0.882056 -0.590617  string    1  True 2001-01-02
7 -1.058230 -2.360188  0.463767  string    1  True 2001-01-02

In [318]:
df_mixed1.dtypes.value_counts()

float64           2
bool              1
datetime64[ns]    1
int64             1
float32           1
object            1
dtype: int64

In [319]:
# we have provided a minimum string column size
store.root.df_mixed.table

/df_mixed/table (Table(8,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": Float64Col(shape=(2,), dflt=0.0, pos=1),
  "values_block_1": Float32Col(shape=(1,), dflt=0.0, pos=2),
  "values_block_2": Int64Col(shape=(1,), dflt=0, pos=3),
  "values_block_3": Int64Col(shape=(1,), dflt=0, pos=4),
  "values_block_4": BoolCol(shape=(1,), dflt=False, pos=5),
  "values_block_5": StringCol(itemsize=50, shape=(1,), dflt=b'', pos=6)}
  byteorder := 'little'
  chunkshape := (689,)
  autoindex := True
  colindexes := {
    "index": Index(6, medium, shuffle, zlib(1)).is_csi=False}

In [320]:
store.close()

#### Storing MultiIndex DataFrames
Storing MultiIndex DataFrames as tables is very similar to storing/selecting from homogeneous index DataFrames.

In [321]:
index = pd.MultiIndex(
    levels=[["foo", "bar", "baz", "qux"], ["one", "two", "three"]],
    codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 1, 2, 0, 1, 2]],
    names=["foo", "bar"],
)
df_mi = pd.DataFrame(np.random.randn(10, 3), index=index, columns=["A", "B", "C"])
df_mi

                  A         B         C
foo bar
foo one    1.251018 -0.003045  0.447864
    two   -1.534600 -1.215062 -0.375679
    three  0.045785 -0.599398  0.441749
bar one   -0.491959  0.035842  0.437345
    two   -0.944658  1.338196 -1.241824
baz two   -1.127524 -2.030763 -0.069002
    three  0.736787  0.126669  0.869999
qux one    0.514076  1.371846 -0.207619
    two    0.052535  1.020090 -1.041080
    three -0.616166 -0.382846 -1.971053

In [322]:
store = pd.HDFStore("data/file04_48.h5")
store.append("df_mi", df_mi)
df_mi1 = store.select("df_mi")
df_mi1

                  A         B         C
foo bar
foo one    1.251018 -0.003045  0.447864
    two   -1.534600 -1.215062 -0.375679
    three  0.045785 -0.599398  0.441749
bar one   -0.491959  0.035842  0.437345
    two   -0.944658  1.338196 -1.241824
baz two   -1.127524 -2.030763 -0.069002
    three  0.736787  0.126669  0.869999
qux one    0.514076  1.371846 -0.207619
    two    0.052535  1.020090 -1.041080
    three -0.616166 -0.382846 -1.971053

In [323]:
# the levels are automatically included as data columns
In [399]: store.select("df_mi", "foo=bar")

                A         B         C
foo bar
bar one -0.491959  0.035842  0.437345
    two -0.944658  1.338196 -1.241824

In [324]:
store.close()

>Note: The index keyword is reserved and cannot be use as a level name.

### Querying
#### Querying a table
select and delete operations have an optional criterion that can be specified to select/delete only a subset of the data. This allows one to have a very large on-disk table and retrieve only a portion of the data.

A query is specified using the Term class under the hood, as a boolean expression.

* index and columns are supported indexers of DataFrames.
* if data_columns are specified, these can be used as additional indexers.
* level name in a MultiIndex, with default name level_0, level_1, … if not provided.

Valid comparison operators are:

=, ==, !=, >, >=, <, <=

Valid boolean expressions are combined with:

* | : or
* & : and
* ( and ) : for grouping

These rules are similar to how boolean expressions are used in pandas for indexing.

>Note: 
> * = will be automatically expanded to the comparison operator ==
> * ~ is the not operator, but can only be used in very limited circumstances
> * If a list/tuple of expressions is passed they will be combined via &

The following are valid expressions:

* 'index >= date'
* "columns = ['A', 'D']"
* "columns in ['A', 'D']"
* 'columns = A'
* 'columns == A'
* "~(columns = ['A', 'B'])"
* 'index > df.index[3] & string = "bar"'
* '(index > df.index[3] & index <= df.index[6]) | string = "bar"'
* "ts >= Timestamp('2012-02-01')"
* "major_axis>=20130101"

The indexers are on the left-hand side of the sub-expression:

columns, major_axis, ts

The right-hand side of the sub-expression (after a comparison operator) can be:

* functions that will be evaluated, e.g. Timestamp('2012-02-01')
* strings, e.g. "bar"
* date-like, e.g. 20130101, or "20130101"
* lists, e.g. "['A', 'B']"
* variables that are defined in the local names space, e.g. date


>Note: Passing a string to a query by interpolating it into the query expression is not recommended. Simply assign the string of interest to a variable and use that variable in an expression. For example, do this
>```python
>string = "HolyMoly'"
>store.select("df", "index == string")
>```
>instead of this
>```python
>string = "HolyMoly'"
>store.select('df', f'index == {string}')
>```
>The latter will not work and will raise a SyntaxError.Note that there’s a single quote followed by a double quote in the string variable.
>
>If you must interpolate, use the '%r' format specifier
>```python
>store.select("df", "index == %r" % string)
>```
>which will quote string.

Here are some examples:

In [325]:
store = pd.HDFStore("data/file04_49.h5")

In [326]:
dfq = pd.DataFrame(
    np.random.randn(10, 4),
    columns=list("ABCD"),
    index=pd.date_range("20130101", periods=10),
)
dfq

                   A         B         C         D
2013-01-01  0.905053 -1.067355 -0.761626 -1.113889
2013-01-02  0.466743  0.453790  0.356966  1.260954
2013-01-03  0.915585 -1.206538  0.275254  1.588291
2013-01-04 -0.039486  0.939992 -0.756323  1.484583
2013-01-05 -0.001997  1.037357 -0.377774 -0.839533
2013-01-06 -0.850562  0.513218 -0.491895  0.545390
2013-01-07 -0.890672 -0.190876 -0.066494 -0.001352
2013-01-08  1.816608 -0.585117  0.759088  0.872618
2013-01-09  0.569887  0.683198  0.872856 -0.928826
2013-01-10  2.022122  0.343987 -2.122715 -0.029016

In [327]:
store.append("dfq", dfq, format="table", data_columns=True)
store

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_49.h5

Use boolean expressions, with in-line function evaluation.

In [328]:
store.select("dfq", "index>pd.Timestamp('20130104') & columns=['A', 'B']")

                   A         B
2013-01-05 -0.001997  1.037357
2013-01-06 -0.850562  0.513218
2013-01-07 -0.890672 -0.190876
2013-01-08  1.816608 -0.585117
2013-01-09  0.569887  0.683198
2013-01-10  2.022122  0.343987

Use inline column reference.

In [329]:
store.select("dfq", where="A>0 or C>0")

                   A         B         C         D
2013-01-01  0.905053 -1.067355 -0.761626 -1.113889
2013-01-02  0.466743  0.453790  0.356966  1.260954
2013-01-03  0.915585 -1.206538  0.275254  1.588291
2013-01-08  1.816608 -0.585117  0.759088  0.872618
2013-01-09  0.569887  0.683198  0.872856 -0.928826
2013-01-10  2.022122  0.343987 -2.122715 -0.029016

The columns keyword can be supplied to select a list of columns to be returned, this is equivalent to passing a 'columns=list_of_columns_to_filter':

In [330]:
store.select("dfq", "columns=['A', 'B']")

                   A         B
2013-01-01  0.905053 -1.067355
2013-01-02  0.466743  0.453790
2013-01-03  0.915585 -1.206538
2013-01-04 -0.039486  0.939992
2013-01-05 -0.001997  1.037357
2013-01-06 -0.850562  0.513218
2013-01-07 -0.890672 -0.190876
2013-01-08  1.816608 -0.585117
2013-01-09  0.569887  0.683198
2013-01-10  2.022122  0.343987

In [331]:
store.close()

start and stop parameters can be specified to limit the total search space. These are in terms of the total number of rows in a table.

>Note: select will raise a ValueError if the query expression has an unknown variable reference. Usually this means that you are trying to select on a column that is not a data_column.
>
>select will raise a SyntaxError if the query expression is not valid.

#### Query timedelta64[ns]
You can store and query using the timedelta64[ns] type. Terms can be specified in the format: <float>(<unit>), where float may be signed (and fractional), and unit can be D,s,ms,us,ns for the timedelta. Here’s an example:

In [332]:
from datetime import timedelta

dftd = pd.DataFrame(
    {
        "A": pd.Timestamp("20130101"),
        "B": [
            pd.Timestamp("20130101") + timedelta(days=i, seconds=10)
            for i in range(10)
        ],
    }
)

dftd["C"] = dftd["A"] - dftd["B"]
dftd

           A                   B                  C
0 2013-01-01 2013-01-01 00:00:10  -1 days +23:59:50
1 2013-01-01 2013-01-02 00:00:10  -2 days +23:59:50
2 2013-01-01 2013-01-03 00:00:10  -3 days +23:59:50
3 2013-01-01 2013-01-04 00:00:10  -4 days +23:59:50
4 2013-01-01 2013-01-05 00:00:10  -5 days +23:59:50
5 2013-01-01 2013-01-06 00:00:10  -6 days +23:59:50
6 2013-01-01 2013-01-07 00:00:10  -7 days +23:59:50
7 2013-01-01 2013-01-08 00:00:10  -8 days +23:59:50
8 2013-01-01 2013-01-09 00:00:10  -9 days +23:59:50
9 2013-01-01 2013-01-10 00:00:10 -10 days +23:59:50

In [333]:
store = pd.HDFStore("data/file04_50.h5")

In [334]:
store.append("dftd", dftd, data_columns=True)
store.select("dftd", "C<'-3.5D'")

           A                   B                  C
4 2013-01-01 2013-01-05 00:00:10  -5 days +23:59:50
5 2013-01-01 2013-01-06 00:00:10  -6 days +23:59:50
6 2013-01-01 2013-01-07 00:00:10  -7 days +23:59:50
7 2013-01-01 2013-01-08 00:00:10  -8 days +23:59:50
8 2013-01-01 2013-01-09 00:00:10  -9 days +23:59:50
9 2013-01-01 2013-01-10 00:00:10 -10 days +23:59:50

In [335]:
store.close()

#### Query MultiIndex
Selecting from a MultiIndex can be achieved by using the name of the level.

In [336]:
df_mi.index.names

FrozenList(['foo', 'bar'])

In [337]:
# copy our previous file to append to here
shutil.copyfile('data/file04_48.h5', 'data/file04_51.h5')

'data/file04_51.h5'

In [338]:
store = pd.HDFStore("data/file04_51.h5")
store.select("df_mi", "foo=baz and bar=two")

                A         B         C
foo bar
baz two -1.127524 -2.030763 -0.069002

If the MultiIndex levels names are None, the levels are automatically made available via the level_n keyword with n the level of the MultiIndex you want to select from.

In [339]:
In [413]: index = pd.MultiIndex(
    levels=[["foo", "bar", "baz", "qux"], ["one", "two", "three"]],
    codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 1, 2, 0, 1, 2]],
)
df_mi_2 = pd.DataFrame(np.random.randn(10, 3), index=index, columns=["A", "B", "C"])
df_mi_2

                  A         B         C
foo one    0.342078 -1.055398  0.970607
    two    0.189734 -0.276271  0.422375
    three  1.073456  0.284636  0.395458
bar one   -0.158010 -0.628031 -0.084475
    two   -0.337429  1.653661 -1.126349
baz two   -0.146433 -0.861466  1.012513
    three  1.653665  1.514563  0.128527
qux one   -1.672435 -0.939815 -0.467962
    two    1.024652  0.278126  0.413356
    three -0.709268 -0.726727  0.313404

In [340]:
store.append("df_mi_2", df_mi_2)

# the levels are automatically included as data columns with keyword level_n
store.select("df_mi_2", "level_0=foo and level_1=two")

                A         B         C
foo two  0.189734 -0.276271  0.422375

In [341]:
store.close()

#### Indexing
You can create/modify an index for a table with create_table_index after data is already in the table (after and append/put operation). Creating a table index is highly encouraged. This will speed your queries a great deal when you use a select with the indexed dimension as the where.

>Note: Indexes are automagically created on the indexables and any data columns you specify. This behavior can be turned off by passing index=False to append.

In [342]:
# copy our previous file to append to here
shutil.copyfile('data/file04_51.h5', 'data/file04_52.h5')

'data/file04_52.h5'

In [343]:
store = pd.HDFStore("data/file04_52.h5")
store.keys()

['/df_mi', '/df_mi_2']

In [344]:
# we have automagically already created an index (in the first section)
i = store.root.df_mi.table.cols.index.index
i.optlevel, i.kind

(6, 'medium')

In [345]:
# change an index by passing new parameters
store.create_table_index("df_mi", optlevel=9, kind="full")
i = store.root.df_mi.table.cols.index.index
i.optlevel, i.kind

(9, 'full')

In [346]:
store.close()

Oftentimes when appending large amounts of data to a store, it is useful to turn off index creation for each append, then recreate at the end.

In [347]:
df_1 = pd.DataFrame(np.random.randn(10, 2), columns=list("AB"))
df_2 = pd.DataFrame(np.random.randn(10, 2), columns=list("AB"))

st = pd.HDFStore("data/file04_53.h5")
st.append("df", df_1, data_columns=["B"], index=False)
st.append("df", df_2, data_columns=["B"], index=False)
st.get_storer("df").table

/df/table (Table(20,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": Float64Col(shape=(1,), dflt=0.0, pos=1),
  "B": Float64Col(shape=(), dflt=0.0, pos=2)}
  byteorder := 'little'
  chunkshape := (2730,)

Then create the index when finished appending.

In [348]:
st.create_table_index("df", columns=["B"], optlevel=9, kind="full")
st.get_storer("df").table

/df/table (Table(20,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": Float64Col(shape=(1,), dflt=0.0, pos=1),
  "B": Float64Col(shape=(), dflt=0.0, pos=2)}
  byteorder := 'little'
  chunkshape := (2730,)
  autoindex := True
  colindexes := {
    "B": Index(9, full, shuffle, zlib(1)).is_csi=True}

In [349]:
st.keys()

['/df']

In [350]:
st.close()

See here for how to create a completely-sorted-index (CSI) on an existing store.

#### Query via data columns
You can designate (and index) certain columns that you want to be able to perform queries (other than the indexable columns, which you can always query). For instance say you want to perform this common operation, on-disk, and return just the frame that matches this query. You can specify data_columns = True to force all columns to be data_columns.

In [351]:
df = pd.DataFrame(
    np.random.randn(8, 3),
    columns=list("ABC"),
    index=pd.date_range("20130101", periods=8),
)
store = pd.HDFStore("data/file04_54.h5")
store.append('df', df)
df

                   A         B         C
2013-01-01 -1.098994 -2.212534  1.347193
2013-01-02  0.394654  1.053934 -0.794448
2013-01-03  1.906845  0.369776  0.911906
2013-01-04  0.875725 -0.081801 -0.826382
2013-01-05  0.045432  0.338353 -0.205531
2013-01-06 -0.198231  2.307986  0.871551
2013-01-07  1.667438  2.202381 -1.443562
2013-01-08 -0.450557  0.778629 -0.151286

In [352]:
df_dc = df.copy()
df_dc["string"] = "foo"
df_dc.loc[df_dc.index[4:6], "string"] = np.nan
df_dc.loc[df_dc.index[7:9], "string"] = "bar"
df_dc["string2"] = "cool"
df_dc.loc[df_dc.index[1:3], ["B", "C"]] = 1.0
df_dc

                   A         B         C string string2
2013-01-01 -1.098994 -2.212534  1.347193    foo    cool
2013-01-02  0.394654  1.000000  1.000000    foo    cool
2013-01-03  1.906845  1.000000  1.000000    foo    cool
2013-01-04  0.875725 -0.081801 -0.826382    foo    cool
2013-01-05  0.045432  0.338353 -0.205531    NaN    cool
2013-01-06 -0.198231  2.307986  0.871551    NaN    cool
2013-01-07  1.667438  2.202381 -1.443562    foo    cool
2013-01-08 -0.450557  0.778629 -0.151286    bar    cool

In [353]:
# on-disk operations
store.append("df_dc", df_dc, data_columns=["B", "C", "string", "string2"])
store.select("df_dc", where="B > 0")

                   A         B         C string string2
2013-01-02  0.394654  1.000000  1.000000    foo    cool
2013-01-03  1.906845  1.000000  1.000000    foo    cool
2013-01-05  0.045432  0.338353 -0.205531    NaN    cool
2013-01-06 -0.198231  2.307986  0.871551    NaN    cool
2013-01-07  1.667438  2.202381 -1.443562    foo    cool
2013-01-08 -0.450557  0.778629 -0.151286    bar    cool

In [354]:
# getting creative
store.select("df_dc", "B > 0 & C > 0 & string == foo")

                   A    B    C string string2
2013-01-02  0.394654  1.0  1.0    foo    cool
2013-01-03  1.906845  1.0  1.0    foo    cool

In [355]:
# this is in-memory version of this type of selection
df_dc[(df_dc.B > 0) & (df_dc.C > 0) & (df_dc.string == "foo")]

                   A    B    C string string2
2013-01-02  0.394654  1.0  1.0    foo    cool
2013-01-03  1.906845  1.0  1.0    foo    cool

In [356]:
# we have automagically created this index and the B/C/string/string2
# columns are stored separately as ``PyTables`` columns
store.root.df_dc.table

/df_dc/table (Table(8,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": Float64Col(shape=(1,), dflt=0.0, pos=1),
  "B": Float64Col(shape=(), dflt=0.0, pos=2),
  "C": Float64Col(shape=(), dflt=0.0, pos=3),
  "string": StringCol(itemsize=3, shape=(), dflt=b'', pos=4),
  "string2": StringCol(itemsize=4, shape=(), dflt=b'', pos=5)}
  byteorder := 'little'
  chunkshape := (1680,)
  autoindex := True
  colindexes := {
    "index": Index(6, medium, shuffle, zlib(1)).is_csi=False,
    "B": Index(6, medium, shuffle, zlib(1)).is_csi=False,
    "C": Index(6, medium, shuffle, zlib(1)).is_csi=False,
    "string": Index(6, medium, shuffle, zlib(1)).is_csi=False,
    "string2": Index(6, medium, shuffle, zlib(1)).is_csi=False}

There is some performance degradation by making lots of columns into data columns, so it is up to the user to designate these. In addition, you cannot change data columns (nor indexables) after the first append/put operation (Of course you can simply read in the data and create a new table!).

#### Iterator
You can pass iterator=True or chunksize=number_in_a_chunk to select and select_as_multiple to return an iterator on the results. The default is 50,000 rows returned in a chunk.

In [357]:
for df in store.select("df", chunksize=3):
    print(df)

                   A         B         C
2013-01-01 -1.098994 -2.212534  1.347193
2013-01-02  0.394654  1.053934 -0.794448
2013-01-03  1.906845  0.369776  0.911906
                   A         B         C
2013-01-04  0.875725 -0.081801 -0.826382
2013-01-05  0.045432  0.338353 -0.205531
2013-01-06 -0.198231  2.307986  0.871551
                   A         B         C
2013-01-07  1.667438  2.202381 -1.443562
2013-01-08 -0.450557  0.778629 -0.151286

>Note: You can also use the iterator with read_hdf which will open, then automatically close the store when finished iterating.
>
>```python
>for df in pd.read_hdf("store.h5", "df", chunksize=3):
>    print(df)
>```

Note, that the chunksize keyword applies to the source rows. So if you are doing a query, then the chunksize will subdivide the total rows in the table and the query applied, returning an iterator on potentially unequal sized chunks.

Here is a recipe for generating a query and using it to create equal sized return chunks.

In [358]:
dfeq = pd.DataFrame({"number": np.arange(1, 11)})
dfeq

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [359]:
store.append("dfeq", dfeq, data_columns=["number"])
def chunks(l, n):
    return [l[i: i + n] for i in range(0, len(l), n)]

evens = [2, 4, 6, 8, 10]
coordinates = store.select_as_coordinates("dfeq", "number=evens")
for c in chunks(coordinates, 2):
    print(store.select("dfeq", where=c))

   number
1       2
3       4
   number
5       6
7       8
   number
9      10

#### Advanced queries
##### Select a single column
To retrieve a single indexable or data column, use the method select_column. This will, for example, enable you to get the index very quickly. These return a Series of the result, indexed by the row number. These do not currently accept the where selector.

In [360]:
store.select_column("df_dc", "index")

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
4   2013-01-05
5   2013-01-06
6   2013-01-07
7   2013-01-08
Name: index, dtype: datetime64[ns]

In [361]:
store.select_column("df_dc", "string")

0    foo
1    foo
2    foo
3    foo
4    NaN
5    NaN
6    foo
7    bar
Name: string, dtype: object

##### Selecting coordinates
Sometimes you want to get the coordinates (a.k.a the index locations) of your query. This returns an Int64Index of the resulting locations. These coordinates can also be passed to subsequent where operations.

In [362]:
df_coord = pd.DataFrame(
    np.random.randn(1000, 2), index=pd.date_range("20000101", periods=1000)
)

store.append("df_coord", df_coord)
c = store.select_as_coordinates("df_coord", "index > 20020101")
c

Int64Index([732, 733, 734, 735, 736, 737, 738, 739, 740, 741,
            ...
            990, 991, 992, 993, 994, 995, 996, 997, 998, 999],
           dtype='int64', length=268)

In [363]:
store.select("df_coord", where=c)

                   0         1
2002-01-02 -0.905523 -3.343300
2002-01-03 -1.777195 -0.056666
2002-01-04  0.240575 -0.048063
2002-01-05 -0.330434  0.379281
2002-01-06 -2.453642 -0.010556
...              ...       ...
2002-09-22  0.936734  1.220464
2002-09-23  1.505077 -0.774103
2002-09-24  1.023241 -0.057879
2002-09-25  0.372566 -0.123045
2002-09-26  0.097445  1.998330

[268 rows x 2 columns]

##### Selecting using a where mask
Sometime your query can involve creating a list of rows to select. Usually this mask would be a resulting index from an indexing operation. This example selects the months of a datetimeindex which are 5.

In [364]:
df_mask = pd.DataFrame(
    np.random.randn(1000, 2), index=pd.date_range("20000101", periods=1000)
)

store.append("df_mask", df_mask)
c = store.select_column("df_mask", "index")
where = c[pd.DatetimeIndex(c).month == 5].index
store.select("df_mask", where=where)

                   0         1
2000-05-01 -1.029155  0.754445
2000-05-02  1.273936  1.416079
2000-05-03 -0.251513 -0.116767
2000-05-04 -1.062312 -0.493859
2000-05-05 -1.249588 -1.331857
...              ...       ...
2002-05-27  0.648508 -0.840052
2002-05-28  0.605216  0.648544
2002-05-29 -0.111582 -0.748883
2002-05-30  1.462311  0.324249
2002-05-31 -0.863901  0.576119

[93 rows x 2 columns]

##### Storer object
If you want to inspect the stored object, retrieve via get_storer. You could use this programmatically to say get the number of rows in an object.

In [365]:
store.get_storer("df_dc").nrows

8

In [366]:
store.close()

### Multiple table queries
The methods append_to_multiple and select_as_multiple can perform appending/selecting from multiple tables at once. The idea is to have one table (call it the selector table) that you index most/all of the columns, and perform your queries. The other table(s) are data tables with an index matching the selector table’s index. You can then perform a very fast query on the selector table, yet get lots of data back. This method is similar to having a very wide table, but enables more efficient queries.

The append_to_multiple method splits a given single DataFrame into multiple tables according to d, a dictionary that maps the table names to a list of ‘columns’ you want in that table. If None is used in place of a list, that table will have the remaining unspecified columns of the given DataFrame. The argument selector defines which table is the selector table (which you can make queries from). The argument dropna will drop rows from the input DataFrame to ensure tables are synchronized. This means that if a row for one of the tables being written to is entirely np.NaN, that row will be dropped from all tables.

If dropna is False, THE USER IS RESPONSIBLE FOR SYNCHRONIZING THE TABLES. Remember that entirely np.Nan rows are not written to the HDFStore, so if you choose to call dropna=False, some tables may have more rows than others, and therefore select_as_multiple may not work or it may return unexpected results.

In [367]:
# copy our previous file to append to here
shutil.copyfile('data/file04_54.h5', 'data/file04_55.h5')
store = pd.HDFStore("data/file04_55.h5")
store.keys()

['/df', '/df_coord', '/df_dc', '/df_mask', '/dfeq']

In [368]:
df_mt = pd.DataFrame(
    np.random.randn(8, 6),
    index=pd.date_range("1/1/2000", periods=8),
    columns=["A", "B", "C", "D", "E", "F"],
)

df_mt["foo"] = "bar"
df_mt.loc[df_mt.index[1], ("A", "B")] = np.nan

df_mt

                   A         B         C         D         E         F  foo
2000-01-01 -2.338330  0.621847  0.942323  1.497706  0.889529  1.696711  bar
2000-01-02       NaN       NaN -0.624514 -0.877787 -0.800591 -0.989669  bar
2000-01-03 -2.131328 -1.482058 -2.135255 -1.322247  1.183284  0.908904  bar
2000-01-04  2.097254 -1.163663 -1.292974 -1.307723  0.016076 -2.210948  bar
2000-01-05  0.259296  1.887754 -0.162612  0.340019 -0.229894  2.063171  bar
2000-01-06 -1.333700 -0.137727 -0.607916 -2.137739 -1.103334 -0.244727  bar
2000-01-07 -1.900246  0.379887  2.137561  0.945517  0.020290  1.666657  bar
2000-01-08 -1.277641  0.904837  0.780628  1.643649 -0.616384  0.030056  bar

In [369]:
# you can also create the tables individually
store.append_to_multiple(
    {"df1_mt": ["A", "B"], "df2_mt": None}, df_mt, selector="df1_mt"
)

store.keys()

['/df', '/df1_mt', '/df2_mt', '/df_coord', '/df_dc', '/df_mask', '/dfeq']

In [370]:
store.select("df1_mt")

                   A         B
2000-01-01 -2.338330  0.621847
2000-01-02       NaN       NaN
2000-01-03 -2.131328 -1.482058
2000-01-04  2.097254 -1.163663
2000-01-05  0.259296  1.887754
2000-01-06 -1.333700 -0.137727
2000-01-07 -1.900246  0.379887
2000-01-08 -1.277641  0.904837

In [371]:
store.select("df2_mt")

                   C         D         E         F  foo
2000-01-01  0.942323  1.497706  0.889529  1.696711  bar
2000-01-02 -0.624514 -0.877787 -0.800591 -0.989669  bar
2000-01-03 -2.135255 -1.322247  1.183284  0.908904  bar
2000-01-04 -1.292974 -1.307723  0.016076 -2.210948  bar
2000-01-05 -0.162612  0.340019 -0.229894  2.063171  bar
2000-01-06 -0.607916 -2.137739 -1.103334 -0.244727  bar
2000-01-07  2.137561  0.945517  0.020290  1.666657  bar
2000-01-08  0.780628  1.643649 -0.616384  0.030056  bar

In [372]:
store.select_as_multiple(
    ["df1_mt", "df2_mt"],
    where=["A>0", "B>0"],
    selector="df1_mt",
)

                   A         B         C         D         E         F  foo
2000-01-05  0.259296  1.887754 -0.162612  0.340019 -0.229894  2.063171  bar

In [373]:
store.close()

### Delete from a table
You can delete from a table selectively by specifying a where. In deleting rows, it is important to understand the PyTables deletes rows by erasing the rows, then moving the following data. Thus deleting can potentially be a very expensive operation depending on the orientation of your data. To get optimal performance, it’s worthwhile to have the dimension you are deleting be the first of the indexables.

Data is ordered (on the disk) in terms of the indexables. Here’s a simple use case. You store panel-type data, with dates in the major_axis and ids in the minor_axis. The data is then interleaved like this:

* date_1
  * id_1
  * id_2
  * .
  * id_n
* date_2
  * id_1
  * .
  * id_n

It should be clear that a delete operation on the major_axis will be fairly quick, as one chunk is removed, then the following data moved. On the other hand a delete operation on the minor_axis will be very expensive. In this case it would almost certainly be faster to rewrite the table using a where that selects all but the missing data.

>Warning: Please note that HDF5 DOES NOT RECLAIM SPACE in the h5 files automatically. Thus, repeatedly deleting (or removing nodes) and adding again, WILL TEND TO INCREASE THE FILE SIZE.
>
>To repack and clean the file, use ptrepack.

### Notes & caveats
#### Compression
PyTables allows the stored data to be compressed. This applies to all kinds of stores, not just tables. Two parameters are used to control compression: complevel and complib.

* complevel specifies if and how hard data is to be compressed. complevel=0 and complevel=None disables compression and 0<complevel<10 enables compression.
* complib specifies which compression library to use. If nothing is specified the default library zlib is used. A compression library usually optimizes for either good compression rates or speed and the results will depend on the type of data. Which type of compression to choose depends on your specific needs and data. The list of supported compression libraries:

  * zlib: The default compression library. A classic in terms of compression, achieves good compression rates but is somewhat slow.
  * lzo: Fast compression and decompression.
  * bzip2: Good compression rates.
  * blosc: Fast compression and decompression.
    * Support for alternative blosc compressors:
      - blosc:blosclz This is the default compressor for blosc
      - blosc:lz4: A compact, very popular and fast compressor.
      - blosc:lz4hc: A tweaked version of LZ4, produces better compression ratios at the expense of speed.
      - blosc:snappy: A popular compressor used in many places.
      - blosc:zlib: A classic; somewhat slower than the previous ones, but achieving better compression ratios.
      - blosc:zstd: An extremely well balanced codec; it provides the best compression ratios among the others above, and at reasonably fast speed.
  * If complib is defined as something other than the listed libraries a ValueError exception is issued.

>Note: If the library specified with the complib option is missing on your platform, compression defaults to zlib without further ado.

Enable compression for all objects within the file:
```python
store_compressed = pd.HDFStore(
    "store_compressed.h5", complevel=9, complib="blosc:blosclz"
)
```
Or on-the-fly compression (this only applies to tables) in stores where compression is not enabled:
```python
store.append("df", df, complib="zlib", complevel=5)
```

#### ptrepack
PyTables offers better write performance when tables are compressed after they are written, as opposed to turning on compression at the very beginning. You can use the supplied PyTables utility ptrepack. In addition, ptrepack can change compression levels after the fact.

ptrepack --chunkshape=auto --propindexes --complevel=9 --complib=blosc in.h5 out.h5
Furthermore ptrepack in.h5 out.h5 will repack the file to allow you to reuse previously deleted space. Alternatively, one can simply remove the file and write again, or use the copy method.

#### Caveats
>Warning:HDFStore is not-threadsafe for writing. The underlying PyTables only supports concurrent reads (via threading or processes). If you need reading and writing at the same time, you need to serialize these operations in a single thread in a single process. You will corrupt your data otherwise. See the (GH2397) for more information.

* If you use locks to manage write access between multiple processes, you may want to use fsync() before releasing write locks. For convenience you can use store.flush(fsync=True) to do this for you.
* Once a table is created columns (DataFrame) are fixed; only exactly the same columns can be appended
* Be aware that timezones (e.g., pytz.timezone('US/Eastern')) are not necessarily equal across timezone versions. So if data is localized to a specific timezone in the HDFStore using one version of a timezone library and that data is updated with another version, the data will be converted to UTC since these timezones are not considered equal. Either use the same version of timezone library or use tz_convert with the updated timezone definition.

>Warning: PyTables will show a NaturalNameWarning if a column name cannot be used as an attribute selector. Natural identifiers contain only letters, numbers, and underscores, and may not begin with a number. Other identifiers cannot be used in a where clause and are generally a bad idea.

### DataTypes
HDFStore will map an object dtype to the PyTables underlying dtype. This means the following types are known to work:

| Type                                 | Represents missing values |
|--------------------------------------|---------------------------|
| floating : float64, float32, float16 | np.nan |
| integer : int64, int32, int8, uint64,uint32, uint8 | |
| boolean | |
| datetime64[ns] | NaT |
| timedelta64[ns] | NaT |
| categorical : see the section below | |
| object : strings | np.nan |

unicode columns are not supported, and WILL FAIL.

#### Categorical data
You can write data that contains category dtypes to a HDFStore. Queries work the same as if it was an object array. However, the category dtyped data is stored in a more efficient manner.

In [374]:
dfcat = pd.DataFrame(
    {"A": pd.Series(list("aabbcdba")).astype("category"), "B": np.random.randn(8)}
)

dfcat

   A         B
0  a -0.134797
1  a  1.438069
2  b  0.251487
3  b -0.222708
4  c -0.693715
5  d -1.278480
6  b -1.612682
7  a -1.254909

In [375]:
dfcat.dtypes

A    category
B     float64
dtype: object

In [376]:
cstore = pd.HDFStore("data/file04_56.h5", mode="w")
cstore.append("dfcat", dfcat, format="table", data_columns=["A"])
result = cstore.select("dfcat", where="A in ['b', 'c']")
result

   A         B
2  b  0.251487
3  b -0.222708
4  c -0.693715
6  b -1.612682

In [377]:
result.dtypes

A    category
B     float64
dtype: object

In [378]:
cstore.close()

#### String columns
##### min_itemsize

The underlying implementation of HDFStore uses a fixed column width (itemsize) for string columns. A string column itemsize is calculated as the maximum of the length of data (for that column) that is passed to the HDFStore, in the first append. Subsequent appends, may introduce a string for a column larger than the column can hold, an Exception will be raised (otherwise you could have a silent truncation of these columns, leading to loss of information). In the future we may relax this and allow a user-specified truncation to occur.

Pass min_itemsize on the first table creation to a-priori specify the minimum length of a particular string column. min_itemsize can be an integer, or a dict mapping a column name to an integer. You can pass values as a key to allow all indexables or data_columns to have this min_itemsize.

Passing a min_itemsize dict will cause all passed columns to be created as data_columns automatically.

>Note: If you are not passing any data_columns, then the min_itemsize will be the maximum of the length of any string passed

In [379]:
store = pd.HDFStore("data/file04_57.h5")

In [380]:
dfs = pd.DataFrame({"A": "foo", "B": "bar"}, index=list(range(5)))
dfs

     A    B
0  foo  bar
1  foo  bar
2  foo  bar
3  foo  bar
4  foo  bar

In [381]:
# A and B have a size of 30
store.append("dfs", dfs, min_itemsize=30)
store.get_storer("dfs").table

/dfs/table (Table(5,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": StringCol(itemsize=30, shape=(2,), dflt=b'', pos=1)}
  byteorder := 'little'
  chunkshape := (963,)
  autoindex := True
  colindexes := {
    "index": Index(6, medium, shuffle, zlib(1)).is_csi=False}

In [382]:
# A is created as a data_column with a size of 30
# B is size is calculated
store.append("dfs2", dfs, min_itemsize={"A": 30})
store.get_storer("dfs2").table

/dfs2/table (Table(5,)) ''
  description := {
  "index": Int64Col(shape=(), dflt=0, pos=0),
  "values_block_0": StringCol(itemsize=3, shape=(1,), dflt=b'', pos=1),
  "A": StringCol(itemsize=30, shape=(), dflt=b'', pos=2)}
  byteorder := 'little'
  chunkshape := (1598,)
  autoindex := True
  colindexes := {
    "index": Index(6, medium, shuffle, zlib(1)).is_csi=False,
    "A": Index(6, medium, shuffle, zlib(1)).is_csi=False}

##### nan_rep

String columns will serialize a np.nan (a missing value) with the nan_rep string representation. This defaults to the string value nan. You could inadvertently turn an actual nan value into a missing value.

In [383]:
dfss = pd.DataFrame({"A": ["foo", "bar", "nan"]})
dfss

     A
0  foo
1  bar
2  nan

In [384]:
store.append("dfss", dfss)
store.select("dfss")

     A
0  foo
1  bar
2  NaN

In [385]:
# here you need to specify a different nan rep
store.append("dfss2", dfss, nan_rep="_nan_")
store.select("dfss2")

     A
0  foo
1  bar
2  nan

In [386]:
store.close()

### External compatibility
HDFStore writes table format objects in specific formats suitable for producing loss-less round trips to pandas objects. For external compatibility, HDFStore can read native PyTables format tables.

It is possible to write an HDFStore object that can easily be imported into R using the rhdf5 library (Package website). Create a table format store like this:

In [387]:
df_for_r = pd.DataFrame(
    {
        "first": np.random.rand(100),
        "second": np.random.rand(100),
        "class": np.random.randint(0, 2, (100,)),
    },
    index=range(100),
)

df_for_r.head()

      first    second  class
0  0.316735  0.279673      0
1  0.661644  0.044393      1
2  0.209630  0.756144      1
3  0.072397  0.138025      0
4  0.717793  0.883660      0

In [388]:
store_export = pd.HDFStore("data/file04_58.h5")
store_export.append("df_for_r", df_for_r, data_columns=df_dc.columns)
store_export

<class 'pandas.io.pytables.HDFStore'>
File path: data/file04_58.h5

In [389]:
store_export.close()

In R this file can be read into a data.frame object using the rhdf5 library. The following example function reads the corresponding column names and data values from the values and assembles them into a data.frame:

```shell
# Load values and column names for all datasets from corresponding nodes and
# insert them into one data.frame object.

library(rhdf5)

loadhdf5data <- function(h5File) {

listing <- h5ls(h5File)
# Find all data nodes, values are stored in *_values and corresponding column
# titles in *_items
data_nodes <- grep("_values", listing$name)
name_nodes <- grep("_items", listing$name)
data_paths = paste(listing$group[data_nodes], listing$name[data_nodes], sep = "/")
name_paths = paste(listing$group[name_nodes], listing$name[name_nodes], sep = "/")
columns = list()
for (idx in seq(data_paths)) {
  # NOTE: matrices returned by h5read have to be transposed to obtain
  # required Fortran order!
  data <- data.frame(t(h5read(h5File, data_paths[idx])))
  names <- t(h5read(h5File, name_paths[idx]))
  entry <- data.frame(data)
  colnames(entry) <- names
  columns <- append(columns, entry)
}

data <- data.frame(columns)

return(data)
}
```

Now you can import the DataFrame into R:

```shell
> data = loadhdf5data("transfer.hdf5")
> head(data)
         first    second class
1 0.4170220047 0.3266449     0
2 0.7203244934 0.5270581     0
3 0.0001143748 0.8859421     1
4 0.3023325726 0.3572698     1
5 0.1467558908 0.9085352     1
6 0.0923385948 0.6233601     1
```

>Note: The R function lists the entire HDF5 file’s contents and assembles the data.frame object from all matching nodes, so use this only as a starting point if you have stored multiple DataFrame objects to a single HDF5 file.

### Performance
* tables format come with a writing performance penalty as compared to fixed stores. The benefit is the ability to append/delete and query (potentially very large amounts of data). Write times are generally longer as compared with regular stores. Query times can be quite fast, especially on an indexed axis.
* You can pass chunksize=<int> to append, specifying the write chunksize (default is 50000). This will significantly lower your memory usage on writing.
* You can pass expectedrows=<int> to the first append, to set the TOTAL number of rows that PyTables will expect. This will optimize read/write performance.
* Duplicate rows can be written to tables, but are filtered out in selection (with the last items being selected; thus a table is unique on major, minor pairs)
* A PerformanceWarning will be raised if you are attempting to store types that will be pickled by PyTables (rather than stored as endemic types). See Here for more information and some solutions.

## Feather
Feather provides binary columnar serialization for data frames. It is designed to make reading and writing data frames efficient, and to make sharing data across data analysis languages easy.

Feather is designed to faithfully serialize and de-serialize DataFrames, supporting all of the pandas dtypes, including extension dtypes such as categorical and datetime with tz.

Several caveats:

* The format will NOT write an Index, or MultiIndex for the DataFrame and will raise an error if a non-default one is provided. You can .reset_index() to store the index or .reset_index(drop=True) to ignore it.
* Duplicate column names and non-string columns names are not supported
* Actual Python objects in object dtype columns are not supported. These will raise a helpful error message on an attempt at serialization.

See the Full Documentation.

In [390]:
df = pd.DataFrame(
    {
        "a": list("abc"),
        "b": list(range(1, 4)),
        "c": np.arange(3, 6).astype("u1"),
        "d": np.arange(4.0, 7.0, dtype="float64"),
        "e": [True, False, True],
        "f": pd.Categorical(list("abc")),
        "g": pd.date_range("20130101", periods=3),
        "h": pd.date_range("20130101", periods=3, tz="US/Eastern"),
        "i": pd.date_range("20130101", periods=3, freq="ns"),
    }
)

df

,a,b,c,d,e,f,g,h,i
0,a,1,3,4.0,True,a,2013-01-01,2013-01-01 00:00:00-05:00,2013-01-01 00:00:00.000000000
1,b,2,4,5.0,False,b,2013-01-02,2013-01-02 00:00:00-05:00,2013-01-01 00:00:00.000000001
2,c,3,5,6.0,True,c,2013-01-03,2013-01-03 00:00:00-05:00,2013-01-01 00:00:00.000000002

In [391]:
df.dtypes

a                        object
b                         int64
c                         uint8
d                       float64
e                          bool
f                      category
g                datetime64[ns]
h    datetime64[ns, US/Eastern]
i                datetime64[ns]
dtype: object

Write to a feather file.

In [392]:
df.to_feather("data/file04_60.feather")

Read from a feather file

In [393]:
result = pd.read_feather("data/file04_60.feather")
result

,a,b,c,d,e,f,g,h,i
0,a,1,3,4.0,True,a,2013-01-01,2013-01-01 00:00:00-05:00,2013-01-01 00:00:00.000000000
1,b,2,4,5.0,False,b,2013-01-02,2013-01-02 00:00:00-05:00,2013-01-01 00:00:00.000000001
2,c,3,5,6.0,True,c,2013-01-03,2013-01-03 00:00:00-05:00,2013-01-01 00:00:00.000000002

In [394]:
# we preserve dtypes
result.dtypes

a                        object
b                         int64
c                         uint8
d                       float64
e                          bool
f                      category
g                datetime64[ns]
h    datetime64[ns, US/Eastern]
i                datetime64[ns]
dtype: object

## Parquet
Apache Parquet provides a partitioned binary columnar serialization for data frames. It is designed to make reading and writing data frames efficient, and to make sharing data across data analysis languages easy. Parquet can use a variety of compression techniques to shrink the file size as much as possible while still maintaining good read performance.

Parquet is designed to faithfully serialize and de-serialize DataFrame s, supporting all of the pandas dtypes, including extension dtypes such as datetime with tz.

Several caveats.

* Duplicate column names and non-string columns names are not supported.
* The pyarrow engine always writes the index to the output, but fastparquet only writes non-default indexes. This extra column can cause problems for non-pandas consumers that are not expecting it. You can force including or omitting indexes with the index argument, regardless of the underlying engine.
* Index level names, if specified, must be strings.
* In the pyarrow engine, categorical dtypes for non-string types can be serialized to parquet, but will de-serialize as their primitive dtype.
* The pyarrow engine preserves the ordered flag of categorical dtypes with string types. fastparquet does not preserve the ordered flag.
* Non supported types include Interval and actual Python object types. These will raise a helpful error message on an attempt at serialization. Period type is supported with pyarrow >= 0.16.0.
* The pyarrow engine preserves extension data types such as the nullable integer and string data type (requiring pyarrow >= 0.16.0, and requiring the extension type to implement the needed protocols, see the extension types documentation).

You can specify an engine to direct the serialization. This can be one of pyarrow, or fastparquet, or auto. If the engine is NOT specified, then the pd.options.io.parquet.engine option is checked; if this is also auto, then pyarrow is tried, and falling back to fastparquet.

See the documentation for pyarrow and fastparquet.

>Note: These engines are very similar and should read/write nearly identical parquet format files. Currently pyarrow does not support timedelta data, fastparquet>=0.1.4 supports timezone aware datetimes. These libraries differ by having different underlying dependencies (fastparquet by using numba, while pyarrow uses a c-library).

In [395]:
df = pd.DataFrame(
    {
        "a": list("abc"),
        "b": list(range(1, 4)),
        "c": np.arange(3, 6).astype("u1"),
        "d": np.arange(4.0, 7.0, dtype="float64"),
        "e": [True, False, True],
        "f": pd.date_range("20130101", periods=3),
        "g": pd.date_range("20130101", periods=3, tz="US/Eastern"),
        "h": pd.Categorical(list("abc")),
        "i": pd.Categorical(list("abc"), ordered=True),
    }
)

df

   a  b  c    d      e          f                         g  h  i
0  a  1  3  4.0   True 2013-01-01 2013-01-01 00:00:00-05:00  a  a
1  b  2  4  5.0  False 2013-01-02 2013-01-02 00:00:00-05:00  b  b
2  c  3  5  6.0   True 2013-01-03 2013-01-03 00:00:00-05:00  c  c

In [396]:
df.dtypes

a                        object
b                         int64
c                         uint8
d                       float64
e                          bool
f                datetime64[ns]
g    datetime64[ns, US/Eastern]
h                      category
i                      category
dtype: object

Write to a parquet file.

In [397]:
df.to_parquet("data/file04_61_pa.parquet", engine="pyarrow")
df.to_parquet("data/file04_62_fp.parquet", engine="fastparquet")

Read from a parquet file.

In [398]:
result = pd.read_parquet("data/file04_62_fp.parquet", engine="fastparquet")
result = pd.read_parquet("data/file04_61_pa.parquet", engine="pyarrow")
result.dtypes

a                        object
b                         int64
c                         uint8
d                       float64
e                          bool
f                datetime64[ns]
g    datetime64[ns, US/Eastern]
h                      category
i                      category
dtype: object

Read only certain columns of a parquet file.

In [399]:
pd.read_parquet(
    "data/file04_62_fp.parquet",
    engine="fastparquet",
    columns=["a", "b"],
)

result = pd.read_parquet(
    "data/file04_61_pa.parquet",
    engine="pyarrow",
    columns=["a", "b"],
)

result.dtypes

a    object
b     int64
dtype: object

#### Handling indexes
Serializing a DataFrame to parquet may include the implicit index as one or more columns in the output file. Thus, this code:

In [400]:
df = pd.DataFrame({"a": [1, 2], "b": [3, 4]})
df.to_parquet("data/file04_63.parquet", engine="pyarrow")

creates a parquet file with three columns if you use pyarrow for serialization: a, b, and __index_level_0__. If you’re using fastparquet, the index may or may not be written to the file.

This unexpected extra column causes some databases like Amazon Redshift to reject the file, because that column doesn’t exist in the target table.

If you want to omit a dataframe’s indexes when writing, pass index=False to to_parquet():

In [401]:
df.to_parquet("data/file04_63.parquet", index=False)

This creates a parquet file with just the two expected columns, a and b. If your DataFrame has a custom index, you won’t get it back when you load this file into a DataFrame.

Passing index=True will always write the index, even if that’s not the underlying engine’s default behavior.

#### Partitioning Parquet files
New in version 0.24.0.

Parquet supports partitioning of data based on the values of one or more columns.

In [402]:
df = pd.DataFrame({"a": [0, 0, 1, 1], "b": [0, 1, 0, 1]})
df.to_parquet(path="data/test", engine="pyarrow", partition_cols=["a"], compression=None)

The path specifies the parent directory to which data will be saved. The partition_cols are the column names by which the dataset will be partitioned. Columns are partitioned in the order they are given. The partition splits are determined by the unique values in the partition columns. The above example creates a partitioned dataset that may look like:

```shell
test
├── a=0
│   ├── 0bac803e32dc42ae83fddfd029cbdebc.parquet
│   └──  ...
└── a=1
    ├── e6ab24a4f45147b49b54a662f0c412a3.parquet
    └── ...
```

## ORC
New in version 1.0.0.

Similar to the parquet format, the ORC Format is a binary columnar serialization for data frames. It is designed to make reading data frames efficient. pandas provides only a reader for the ORC format, read_orc(). This requires the pyarrow library.

## SQL queries
The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.

If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

| x  | x  |
|----|----|
| read_sql_table(table_name, con[, schema, …]) | Read SQL database table into a DataFrame. |
| read_sql_query(sql, con[, index_col, …]) | Read SQL query into a DataFrame. |
| read_sql(sql, con[, index_col, …]) | Read SQL query or database table into a DataFrame. |
| DataFrame.to_sql(name, con[, schema, …]) | Write records stored in a DataFrame to a SQL database. |

>Note: The function read_sql() is a convenience wrapper around read_sql_table() and read_sql_query() (and for backward compatibility) and will delegate to specific function depending on the provided input (database table name or sql query). Table names do not need to be quoted if they have special characters.

In the following example, we use the SQlite SQL database engine. You can use a temporary SQLite database where data are stored in “memory”.

To connect with SQLAlchemy you use the create_engine() function to create an engine object from database URI. You only need to create the engine once per database you are connecting to. For more information on create_engine() and the URI formatting, see the examples below and the SQLAlchemy documentation

In [403]:
from sqlalchemy import create_engine

# Create your engine.
engine = create_engine("sqlite:///:memory:")

If you want to manage your own connections you can pass one of those instead:

In [404]:
# in case the 'data' table already exists, we can replace it here

In [405]:
"""
# create data table
data = {
   id       Date Col_1  Col_2  Col_3
0  26 2010-10-18     X  27.50   True
1  42 2010-10-19     Y -12.50  False
2  63 2010-10-20     Z   5.73   True
}
"""
data = pd.DataFrame(
    {
        "id": [26, 42, 63],
        "Date": pd.date_range("2010-10-18",periods=3),
        "Col_1": ["X", "Y", "Z"],
        "Col_2": [27.50, -12.50, 5.73],
        "Col_3": [True, False, True],
    }
)

try:
    data.to_sql("data", engine)
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'ValueError: Table data already exists. \n'
    msg = msg + 'FIX: delete the "data" table \n'
    print(msg)
    data.to_sql("data", con=engine, if_exists='replace')

In [406]:
with engine.connect() as conn, conn.begin():
    try:
        data = pd.read_sql_table("data", conn)
    except:
        msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
        msg = msg + 'ValueError: Table data not found \n'
        msg = msg + 'FIX: verify/write the "data" table if it is missing \n'
        print(msg)

#### Writing DataFrames
Assuming the following data is in a DataFrame data, we can insert it into the database using to_sql().

| id | Date | Col_1 | Col_2 | Col_3 |
|----|------|-------|-------|-------|
| 26 | 2012-10-18 | X |  25.7  | True  |
| 42 | 2012-10-19 | Y | -12.4  | False |
| 63 | 2012-10-20 | Z |   5.73 | True  |

In [407]:
data

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2010-10-18     X  27.50   True
1      1  42 2010-10-19     Y -12.50  False
2      2  63 2010-10-20     Z   5.73   True

In [408]:
try:
    data.to_sql("data", engine)
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'ValueError: Table data already exists. \n'
    msg = msg + 'FIX: delete the "data" table \n'
    print(msg)

sys.exc_info(): <class 'ValueError'>
ValueError: Table data already exists.
FIX: delete the "data" table

With some databases, writing large DataFrames can result in errors due to packet size limitations being exceeded. This can be avoided by setting the chunksize parameter when calling to_sql. For example, the following writes data to the database in batches of 1000 rows at a time:

In [409]:
try:
    data.to_sql("data_chunked", engine, chunksize=1000)
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'ValueError: Table data already exists. \n'
    msg = msg + 'FIX: delete the "data" table \n'
    print(msg)
    data.to_sql("data_chunked", con=engine, if_exists='replace')

##### SQL data types
to_sql() will try to map your data to an appropriate SQL data type based on the dtype of the data. When you have columns of dtype object, pandas will try to infer the data type.

You can always override the default type by specifying the desired SQL type of any of the columns by using the dtype argument. This argument needs a dictionary mapping column names to SQLAlchemy types (or strings for the sqlite3 fallback mode). For example, specifying to use the sqlalchemy String type instead of the default Text type for string columns:

In [410]:
from sqlalchemy.types import String
data.to_sql("data_dtype", engine, dtype={"Col_1": String})

>Note: Due to the limited support for timedelta’s in the different database flavors, columns with type timedelta64 will be written as integer values as nanoseconds to the database and a warning will be raised.

>Note: Columns of category dtype will be converted to the dense representation as you would get with np.asarray(categorical) (e.g. for string categories this gives an array of strings). Because of this, reading the database table back in does not generate a categorical.

#### Datetime data types
Using SQLAlchemy, to_sql() is capable of writing datetime data that is timezone naive or timezone aware. However, the resulting data stored in the database ultimately depends on the supported data type for datetime data of the database system being used.

The following table lists supported data types for datetime data for some common databases. Other database dialects may have different data types for datetime data.

| Database | SQL Datetime Types | Timezone Support |
|----------|--------------------|------------------|
| SQLite | TEXT | No |
| MySQL | TIMESTAMP or DATETIME | No |
| PostgreSQL | TIMESTAMP or TIMESTAMP WITH TIME ZONE | Yes |

When writing timezone aware data to databases that do not support timezones, the data will be written as timezone naive timestamps that are in local time with respect to the timezone.

read_sql_table() is also capable of reading datetime data that is timezone aware or naive. When reading TIMESTAMP WITH TIME ZONE types, pandas will convert the data to UTC.

##### Insertion method
*New in version 0.24.0.*

The parameter method controls the SQL insertion clause used. Possible values are:

* None: Uses standard SQL INSERT clause (one per row).
* 'multi': Pass multiple values in a single INSERT clause. It uses a special SQL syntax not supported by all backends. This usually provides better performance for analytic databases like Presto and Redshift, but has worse performance for traditional SQL backend if the table contains many columns. For more information check the SQLAlchemy documentation.
* callable with signature (pd_table, conn, keys, data_iter): This can be used to implement a more performant insertion method based on specific backend dialect features.

Example of a callable using PostgreSQL COPY clause:

In [411]:
# Alternative to_sql() *method* for DBs that support COPY FROM
import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    """
    Execute SQL statement inserting data

    Parameters
    ----------
    table : pandas.io.sql.SQLTable
    conn : sqlalchemy.engine.Engine or sqlalchemy.engine.Connection
    keys : list of str
        Column names
    data_iter : Iterable that iterates the values to be inserted
    """
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

#### Reading tables
read_sql_table() will read a database table given the table name and optionally a subset of columns to read.

>Note: In order to use read_sql_table(), you must have the SQLAlchemy optional dependency installed.

In [412]:
pd.read_sql_table("data", engine)

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2010-10-18     X  27.50   True
1      1  42 2010-10-19     Y -12.50  False
2      2  63 2010-10-20     Z   5.73   True

>Note: Note that pandas infers column dtypes from query outputs, and not by looking up data types in the physical database schema. For example, assume userid is an integer column in a table. Then, intuitively, select userid ... will return integer-valued series, while select cast(userid as text) ... will return object-valued (str) series. Accordingly, if the query output is empty, then all resulting columns will be returned as object-valued (since they are most general). If you foresee that your query will sometimes generate an empty result, you may want to explicitly typecast afterwards to ensure dtype integrity.

You can also specify the name of the column as the DataFrame index, and specify a subset of columns to be read.

In [413]:
pd.read_sql_table("data", engine, index_col="id")

    index       Date Col_1  Col_2  Col_3
id
26      0 2010-10-18     X  27.50   True
42      1 2010-10-19     Y -12.50  False
63      2 2010-10-20     Z   5.73   True

In [414]:
pd.read_sql_table("data", engine, columns=["Col_1", "Col_2"])

  Col_1  Col_2
0     X  27.50
1     Y -12.50
2     Z   5.73

And you can explicitly force columns to be parsed as dates:

In [415]:
pd.read_sql_table("data", engine, parse_dates=["Date"])

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2010-10-18     X  27.50   True
1      1  42 2010-10-19     Y -12.50  False
2      2  63 2010-10-20     Z   5.73   True

If needed you can explicitly specify a format string, or a dict of arguments to pass to pandas.to_datetime():

In [416]:
pd.read_sql_table("data", engine, parse_dates={"Date": "%Y-%m-%d"})

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2010-10-18     X  27.50   True
1      1  42 2010-10-19     Y -12.50  False
2      2  63 2010-10-20     Z   5.73   True

In [417]:
pd.read_sql_table(
    "data",
    engine,
    parse_dates={"Date": {"format": "%Y-%m-%d %H:%M:%S"}},
)

   index  id       Date Col_1  Col_2  Col_3
0      0  26 2010-10-18     X  27.50   True
1      1  42 2010-10-19     Y -12.50  False
2      2  63 2010-10-20     Z   5.73   True

You can check if a table exists using has_table()

#### Schema support
Reading from and writing to different schema’s is supported through the schema keyword in the read_sql_table() and to_sql() functions. Note however that this depends on the database flavor (sqlite does not have schema’s). For example:

In [418]:
try:
    df.to_sql("table", engine, schema="other_schema")
    pd.read_sql_table("table", engine, schema="other_schema")
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'OperationalError: (sqlite3.OperationalError) unknown database "other_schema" \n'
    msg = msg + '[SQL: PRAGMA "other_schema".table_info("table")] \n'
    msg = msg + '(Background on this error at: http://sqlalche.me/e/14/e3q8) \n'
    msg = msg + 'FIX: define "other_schema" \n'
    print(msg)

sys.exc_info(): <class 'sqlalchemy.exc.OperationalError'>
OperationalError: (sqlite3.OperationalError) unknown database "other_schema"
[SQL: PRAGMA "other_schema".table_info("table")]
(Background on this error at: http://sqlalche.me/e/14/e3q8)
FIX: define "other_schema"

#### Querying
You can query using raw SQL in the read_sql_query() function. In this case you must use the SQL variant appropriate for your database. When using SQLAlchemy, you can also pass SQLAlchemy Expression language constructs, which are database-agnostic.

In [419]:
pd.read_sql_query("SELECT * FROM data", engine)

   index  id                        Date Col_1  Col_2  Col_3
0      0  26  2010-10-18 00:00:00.000000     X  27.50      1
1      1  42  2010-10-19 00:00:00.000000     Y -12.50      0
2      2  63  2010-10-20 00:00:00.000000     Z   5.73      1

Of course, you can specify a more “complex” query.

In [420]:
pd.read_sql_query("SELECT id, Col_1, Col_2 FROM data WHERE id = 42;", engine)

   id Col_1  Col_2
0  42     Y  -12.5

The read_sql_query() function supports a chunksize argument. Specifying this will return an iterator through chunks of the query result:

In [421]:
df = pd.DataFrame(np.random.randn(20, 3), columns=list("abc"))

df.to_sql("data_chunks", engine, index=False)
for chunk in pd.read_sql_query("SELECT * FROM data_chunks", engine, chunksize=5):
    print(chunk)

          a         b         c
0 -0.260956  1.854559 -0.925298
1 -1.111667 -1.648598 -1.655367
2 -0.572491  0.345357 -1.540297
3  1.408951  0.840049  1.443183
4 -0.448087  0.536609  0.968122
          a         b         c
0  0.607469 -2.156340 -0.504398
1  1.045289  0.341562  1.315776
2 -0.724749 -0.569337 -0.975458
3 -0.488278 -0.394607  1.020597
4 -1.510645 -0.180264  0.634024
          a         b         c
0  0.244931  0.656349  0.335377
1  0.256690  1.610178  1.824400
2  1.277177  0.391265 -0.563978
3  1.096647  2.050565 -0.570491
4  0.735891  0.001886  0.890810
          a         b         c
0 -1.340097  1.599976  0.728709
1  0.178913  0.400620 -0.545510
2  1.049583  0.363701 -1.171487
3  0.767125 -0.237898 -0.231422
4 -0.748406  0.750879 -2.930757

You can also run a plain query without creating a DataFrame with execute(). This is useful for queries that don’t return values, such as INSERT. This is functionally equivalent to calling execute on the SQLAlchemy engine or db connection object. Again, you must use the SQL syntax variant appropriate for your database.

In [422]:
from pandas.io import sql
import datetime as dt

sql.execute("SELECT * FROM data", engine)
sql.execute(
    "INSERT INTO data VALUES(?, ?, ?, ?, ?, ?)", engine, params=[(3, 99, dt.datetime(2010, 10, 21), 'A', 12.2, True)]
)
pd.read_sql_query("SELECT * FROM data", engine)

   index  id                        Date Col_1  Col_2  Col_3
0      0  26  2010-10-18 00:00:00.000000     X  27.50      1
1      1  42  2010-10-19 00:00:00.000000     Y -12.50      0
2      2  63  2010-10-20 00:00:00.000000     Z   5.73      1
3      3  99         2010-10-21 00:00:00     A  12.20      1

#### Engine connection examples
To connect with SQLAlchemy you use the create_engine() function to create an engine object from database URI. You only need to create the engine once per database you are connecting to.

```python
from sqlalchemy import create_engine

engine = create_engine("postgresql://scott:tiger@localhost:5432/mydatabase")
engine = create_engine("mysql+mysqldb://scott:tiger@localhost/foo")
engine = create_engine("oracle://scott:tiger@127.0.0.1:1521/sidname")
engine = create_engine("mssql+pyodbc://mydsn")

# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = create_engine("sqlite:///foo.db")

# or absolute, starting with a slash:
engine = create_engine("sqlite:////absolute/path/to/foo.db")
```

>Note: you'll need to install my, cx_oracle, and pyodbc packages for the above code to run

For more information see the examples the SQLAlchemy documentation

#### Advanced SQLAlchemy queries
You can use SQLAlchemy constructs to describe your query.

Use sqlalchemy.text() to specify query parameters in a backend-neutral way

In [423]:
import sqlalchemy as sa

pd.read_sql(sa.text("SELECT * FROM data where Col_1=:col1"), engine, params={"col1": "X"})

   index  id                        Date Col_1  Col_2  Col_3
0      0  26  2010-10-18 00:00:00.000000     X   27.5      1

If you have an SQLAlchemy description of your database you can express where conditions using SQLAlchemy expression

In [424]:
metadata = sa.MetaData()

data_table = sa.Table(
    "data",
    metadata,
    sa.Column("index", sa.Integer),
    sa.Column("Date", sa.DateTime),
    sa.Column("Col_1", sa.String),
    sa.Column("Col_2", sa.Float),
    sa.Column("Col_3", sa.Boolean),
)

pd.read_sql(sa.select([data_table]).where(data_table.c.Col_3 is True), engine)

Empty DataFrame
Columns: [index, Date, Col_1, Col_2, Col_3]
Index: []

You can combine SQLAlchemy expressions with parameters passed to read_sql() using sqlalchemy.bindparam()

In [425]:
import datetime as dt

expr = sa.select([data_table]).where(data_table.c.Date > sa.bindparam("date"))
pd.read_sql(expr, engine, params={"date": dt.datetime(2010, 10, 18)})

   index       Date Col_1  Col_2  Col_3
0      1 2010-10-19     Y -12.50  False
1      2 2010-10-20     Z   5.73   True
2      3 2010-10-21     A  12.20   True

#### Sqlite fallback
The use of sqlite is supported without using SQLAlchemy. This mode requires a Python database adapter which respect the Python DB-API.

You can create connections like so:

In [426]:
import sqlite3

con = sqlite3.connect(":memory:")

And then issue the following queries:And then issue the following queries:

In [427]:
data.to_sql("data", con)
pd.read_sql_query("SELECT * FROM data", con)

   level_0  index  id                 Date Col_1  Col_2  Col_3
0        0      0  26  2010-10-18 00:00:00     X  27.50      1
1        1      1  42  2010-10-19 00:00:00     Y -12.50      0
2        2      2  63  2010-10-20 00:00:00     Z   5.73      1

## Google BigQuery
>Warning: Starting in 0.20.0, pandas has split off Google BigQuery support into the separate package pandas-gbq. You can pip install pandas-gbq to get it.

The pandas-gbq package provides functionality to read/write from Google BigQuery.

pandas integrates with this external package. if pandas-gbq is installed, you can use the pandas methods pd.read_gbq and DataFrame.to_gbq, which will call the respective functions from pandas-gbq.

Full documentation can be found here.

## Stata format
### Writing to stata format
The method to_stata() will write a DataFrame into a .dta file. The format version of this file is always 115 (Stata 12).

In [428]:
df = pd.DataFrame(np.random.randn(10, 2), columns=list("AB"))
df.to_stata("data/file04_64.dta")

Stata data files have limited data type support; only strings with 244 or fewer characters, int8, int16, int32, float32 and float64 can be stored in .dta files. Additionally, Stata reserves certain values to represent missing data. Exporting a non-missing value that is outside of the permitted range in Stata for a particular data type will retype the variable to the next larger size. For example, int8 values are restricted to lie between -127 and 100 in Stata, and so variables with values above 100 will trigger a conversion to int16. nan values in floating points data types are stored as the basic missing data type (. in Stata).

>Note: It is not possible to export missing data values for integer data types.

The Stata writer gracefully handles other data types including int64, bool, uint8, uint16, uint32 by casting to the smallest supported type that can represent the data. For example, data with a type of uint8 will be cast to int8 if all values are less than 100 (the upper bound for non-missing int8 data in Stata), or, if values are outside of this range, the variable is cast to int16.

>Warning: Conversion from int64 to float64 may result in a loss of precision if int64 values are larger than 2**53.

>Warning: StataWriter and to_stata() only support fixed width strings containing up to 244 characters, a limitation imposed by the version 115 dta file format. Attempting to write Stata dta files with strings longer than 244 characters raises a ValueError.

### Reading from Stata format
The top-level function read_stata will read a dta file and return either a DataFrame or a StataReader that can be used to read the file incrementally.

In [429]:
pd.read_stata("data/file04_64.dta")

   index         A         B
0      0  0.288343  0.535195
1      1 -1.738206  0.323658
2      2  0.918070  0.368557
3      3  0.001586  0.131186
4      4  0.733965 -0.006947
5      5  0.561420  0.130746
6      6 -1.505234  0.571048
7      7  0.218519 -0.220506
8      8  0.133403  0.544365
9      9 -0.254149 -0.302855

Specifying a chunksize yields a StataReader instance that can be used to read chunksize lines from the file at a time. The StataReader object can be used as an iterator.Specifying a chunksize yields a StataReader instance that can be used to read chunksize lines from the file at a time. The StataReader object can be used as an iterator.

In [430]:
with pd.read_stata("data/file04_64.dta", chunksize=3) as reader:
    for df in reader:
        print(df.shape)

(3, 3)
(3, 3)
(3, 3)
(1, 3)

For more fine-grained control, use iterator=True and specify chunksize with each call to read().

In [431]:
with pd.read_stata("data/file04_64.dta", iterator=True) as reader:
    chunk1 = reader.read(5)
    chunk2 = reader.read(5)

Currently the index is retrieved as a column.

The parameter convert_categoricals indicates whether value labels should be read and used to create a Categorical variable from them. Value labels can also be retrieved by the function value_labels, which requires read() to be called before use.

The parameter convert_missing indicates whether missing value representations in Stata should be preserved. If False (the default), missing values are represented as np.nan. If True, missing values are represented using StataMissingValue objects, and columns containing missing values will have object data type.

>Note: read_stata() and StataReader support .dta formats 113-115 (Stata 10-12), 117 (Stata 13), and 118 (Stata 14).

>Note: Setting preserve_dtypes=False will upcast to the standard pandas data types: int64 for all integer types and float64 for floating point data. By default, the Stata data types are preserved when importing.

#### Categorical data
Categorical data can be exported to Stata data files as value labeled data. The exported data consists of the underlying category codes as integer data values and the categories as value labels. Stata does not have an explicit equivalent to a Categorical and information about whether the variable is ordered is lost when exporting.

>Warning: Stata only supports string value labels, and so str is called on the categories when exporting data. Exporting Categorical variables with non-string categories produces a warning, and can result a loss of information if the str representations of the categories are not unique.

Labeled data can similarly be imported from Stata data files as Categorical variables using the keyword argument convert_categoricals (True by default). The keyword argument order_categoricals (True by default) determines whether imported Categorical variables are ordered.

>Note: When importing categorical data, the values of the variables in the Stata data file are not preserved since Categorical variables always use integer data types between -1 and n-1 where n is the number of categories. If the original values in the Stata data file are required, these can be imported by setting convert_categoricals=False, which will import original data (but not the variable labels). The original values can be matched to the imported categorical data since there is a simple mapping between the original Stata data values and the category codes of imported Categorical variables: missing values are assigned code -1, and the smallest original value is assigned 0, the second smallest is assigned 1 and so on until the largest original value is assigned the code n-1.

>Note: Stata supports partially labeled series. These series have value labels for some but not all data values. Importing a partially labeled series will produce a Categorical with string categories for the values that are labeled and numeric categories for values with no label.


## SAS formats
The top-level function read_sas() can read (but not write) SAS XPORT (.xpt) and (since v0.18.0) SAS7BDAT (.sas7bdat) format files.

SAS files only contain two value types: ASCII text and floating point values (usually 8 bytes but sometimes truncated). For xport files, there is no automatic type conversion to integers, dates, or categoricals. For SAS7BDAT files, the format codes may allow date variables to be automatically converted to dates. By default the whole file is read and returned as a DataFrame.

Specify a chunksize or use iterator=True to obtain reader objects (XportReader or SAS7BDATReader) for incrementally reading the file. The reader objects also have attributes that contain additional information about the file and its variables.

Read a SAS7BDAT file:

In [432]:
try:
    df = pd.read_sas("data/file04_65.sas7bdat")
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'FileNotFoundError: [Errno 2] No such file or directory: "data/file04_65.sas7bdat" \n'
    msg = msg + 'FIX: create/verify file exits first \n'
    print(msg)

sys.exc_info(): <class 'FileNotFoundError'>
FileNotFoundError: [Errno 2] No such file or directory: "data/file04_65.sas7bdat"
FIX: create/verify file exits first

Obtain an iterator and read an XPORT file 100,000 lines at a time:

In [436]:
def do_something(chunk):
    pass

try:
    with pd.read_sas("data/file04_66.xpt", chunksize=100000) as rdr:
        for chunk in rdr:
            do_something(chunk)
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'FileNotFoundError: [Errno 2] No such file or directory: "data/file04_66.xpt" \n'
    msg = msg + 'FIX: create/verify file exits first \n'
    print(msg)

sys.exc_info(): <class 'FileNotFoundError'>
FileNotFoundError: [Errno 2] No such file or directory: "data/file04_66.xpt"
FIX: create/verify file exits first

The specification for the xport file format is available from the SAS web site.

No official documentation is available for the SAS7BDAT format.

## SPSS formats
New in version 0.25.0.

The top-level function read_spss() can read (but not write) SPSS SAV (.sav) and ZSAV (.zsav) format files.

SPSS files contain column names. By default the whole file is read, categorical columns are converted into pd.Categorical, and a DataFrame with all columns is returned.

Specify the usecols parameter to obtain a subset of columns. Specify convert_categoricals=False to avoid converting categorical columns into pd.Categorical.

Read an SPSS file:

In [438]:
try:
    df = pd.read_sas("data/file04_67.sav")
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'ValueError: unable to infer format of SAS file \n'
    msg = msg + 'FIX: create/verify file exits first \n'
    print(msg)

sys.exc_info(): <class 'ValueError'>
ValueError: unable to infer format of SAS file
FIX: create/verify file exits first

Extract a subset of columns contained in usecols from an SPSS file and avoid converting categorical columns into pd.Categorical:

In [440]:
try:
    df = pd.read_spss(
        "data/file04_67.sav",
        usecols=["foo", "bar"],
        convert_categoricals=False,
)
except:
    msg = 'sys.exc_info(): {} \n'.format(sys.exc_info()[0] )
    msg = msg + 'PyreadstatError: File data/file04_67.sav does not exist! \n'
    msg = msg + 'FIX: create/verify file exits first \n'
    print(msg)

sys.exc_info(): <class 'pyreadstat._readstat_parser.PyreadstatError'>
PyreadstatError: File data/file04_67.sav does not exist!
FIX: create/verify file exits first

More information about the SAV and ZSAV file formats is available here.

## Other file formats
pandas itself only supports IO with a limited set of file formats that map cleanly to its tabular data model. For reading and writing other file formats into and from pandas, we recommend these packages from the broader community.

### netCDF
xarray provides data structures inspired by the pandas DataFrame for working with multi-dimensional datasets, with a focus on the netCDF file format and easy conversion to and from pandas.

## Performance considerations
This is an informal comparison of various IO methods, using pandas 0.24.2. Timings are machine dependent and small differences should be ignored.

In [441]:
sz = 1000000
df = pd.DataFrame({'A': np.random.randn(sz), 'B': [1] * sz})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 2 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   A       1000000 non-null  float64
 1   B       1000000 non-null  int64
dtypes: float64(1), int64(1)
memory usage: 15.3 MB

The following test functions will be used below to compare the performance of several IO methods:

In [446]:
import numpy as np
import os

sz = 1000000
df = pd.DataFrame({"A": np.random.randn(sz), "B": [1] * sz})

sz = 1000000
np.random.seed(42)
df = pd.DataFrame({"A": np.random.randn(sz), "B": [1] * sz})


def test_sql_write(df):
    if os.path.exists("bm/test.sql"):
        os.remove("bm/test.sql")
    sql_db = sqlite3.connect("bm/test.sql")
    df.to_sql(name="test_table", con=sql_db)
    sql_db.close()


def test_sql_read():
    sql_db = sqlite3.connect("bm/test.sql")
    pd.read_sql_query("select * from test_table", sql_db)
    sql_db.close()


def test_hdf_fixed_write(df):
    df.to_hdf("bm/test_fixed.hdf", "test", mode="w")


def test_hdf_fixed_read():
    pd.read_hdf("bm/test_fixed.hdf", "test")


def test_hdf_fixed_write_compress(df):
    df.to_hdf("bm/test_fixed_compress.hdf", "test", mode="w", complib="blosc")


def test_hdf_fixed_read_compress():
    pd.read_hdf("bm/test_fixed_compress.hdf", "test")


def test_hdf_table_write(df):
    df.to_hdf("bm/test_table.hdf", "test", mode="w", format="table")


def test_hdf_table_read():
    pd.read_hdf("bm/test_table.hdf", "test")


def test_hdf_table_write_compress(df):
    df.to_hdf(
        "bm/test_table_compress.hdf", "test", mode="w", complib="blosc", format="table"
    )


def test_hdf_table_read_compress():
    pd.read_hdf("bm/test_table_compress.hdf", "test")


def test_csv_write(df):
    df.to_csv("bm/test.csv", mode="w")


def test_csv_read():
    pd.read_csv("bm/test.csv", index_col=0)


def test_feather_write(df):
    df.to_feather("bm/test.feather")


def test_feather_read():
    pd.read_feather("bm/test.feather")


def test_pickle_write(df):
    df.to_pickle("bm/test.pkl")


def test_pickle_read():
    pd.read_pickle("bm/test.pkl")


def test_pickle_write_compress(df):
    df.to_pickle("bm/test.pkl.compress", compression="xz")


def test_pickle_read_compress():
    pd.read_pickle("bm/test.pkl.compress", compression="xz")


def test_parquet_write(df):
    df.to_parquet("bm/test.parquet")


def test_parquet_read():
    pd.read_parquet("bm/test.parquet")

When writing, the top three functions in terms of speed are test_feather_write, test_hdf_fixed_write and test_hdf_fixed_write_compress.

In [508]:
# results for write test
rslt_wrt_dict = {}

In [509]:
rslt = %timeit -o test_sql_write(df)
rslt_wrt_dict['test_sql_write'] = rslt

3.36 s ± 170 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [510]:
rslt = %timeit -o test_hdf_fixed_write_compress(df)
rslt_wrt_dict['test_hdf_fixed_write_compress'] = rslt

32.9 ms ± 6.55 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [511]:
rslt = %timeit -o test_hdf_table_write(df)
rslt_wrt_dict['test_hdf_table_write'] = rslt

661 ms ± 32.2 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [512]:
rslt = %timeit -o test_hdf_table_write_compress(df)
rslt_wrt_dict['test_hdf_table_write_compress'] = rslt

685 ms ± 92.9 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [513]:
rslt = %timeit -o test_csv_write(df)
rslt_wrt_dict['test_csv_write'] = rslt

2.96 s ± 161 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [514]:
rslt = %timeit -o test_feather_write(df)
rslt_wrt_dict['test_feather_write'] = rslt

16.7 ms ± 404 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [515]:
rslt = %timeit -o test_pickle_write(df)
rslt_wrt_dict['test_pickle_write'] = rslt

9.9 ms ± 226 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [516]:
rslt = %timeit -o test_pickle_write_compress(df)
rslt_wrt_dict['test_pickle_write_compress'] = rslt

3.65 s ± 229 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [517]:
rslt = %timeit -o test_parquet_write(df)
rslt_wrt_dict['test_parquet_write'] = rslt

76.3 ms ± 7.13 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

**Summary of 'Writing File' benchmark test**

In [518]:
for k, v in rslt_wrt_dict.items():
    print("{: <30} : {}".format(k,str(v)))

test_sql_write                 : 3.36 s ± 170 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_hdf_fixed_write_compress  : 32.9 ms ± 6.55 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
test_hdf_table_write           : 661 ms ± 32.2 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_hdf_table_write_compress  : 685 ms ± 92.9 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_csv_write                 : 2.96 s ± 161 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_feather_write             : 16.7 ms ± 404 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
test_pickle_write              : 9.9 ms ± 226 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
test_pickle_write_compress     : 3.65 s ± 229 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_parquet_write             : 76.3 ms ± 7.13 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [522]:
# results for read test
rslt_rd_dict = {}

When reading, the top three functions in terms of speed are test_feather_read, test_pickle_read and test_hdf_fixed_read.

In [523]:
rslt = %timeit -o test_sql_read()
rslt_rd_dict['test_sql_read'] = rslt

2.21 s ± 77.6 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [524]:
rslt = %timeit -o test_hdf_fixed_read()
rslt_rd_dict['test_hdf_fixed_read'] = rslt

46 ms ± 4.62 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [525]:
rslt = %timeit -o test_hdf_fixed_read_compress()
rslt_rd_dict['test_hdf_fixed_read_compress'] = rslt

46.6 ms ± 6.67 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [526]:
rslt = %timeit -o test_hdf_table_read()
rslt_rd_dict['test_hdf_table_read'] = rslt

56 ms ± 1.14 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [527]:
rslt = %timeit -o test_hdf_table_read_compress()
rslt_rd_dict['test_hdf_table_read_compress'] = rslt

58.3 ms ± 6.58 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [528]:
rslt = %timeit -o test_csv_read()
rslt_rd_dict['test_csv_read'] = rslt

487 ms ± 34.2 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [529]:
rslt = %timeit -o test_feather_read()
rslt_rd_dict['test_feather_read'] = rslt

12.9 ms ± 144 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [530]:
rslt = %timeit -o test_pickle_read()
rslt_rd_dict['test_pickle_read'] = rslt

11.3 ms ± 269 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [531]:
rslt = %timeit -o test_pickle_read_compress()
rslt_rd_dict['test_pickle_read_compress'] = rslt

582 ms ± 8.85 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [532]:
rslt = %timeit -o test_parquet_read()
rslt_rd_dict['test_parquet_read'] = rslt

25.8 ms ± 6.61 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

**Summary of 'Read File' benchmark test**

In [533]:
for k, v in rslt_rd_dict.items():
    print("{: <30} : {}".format(k,str(v)))

test_sql_read                  : 2.21 s ± 77.6 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_hdf_fixed_read            : 46 ms ± 4.62 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
test_hdf_fixed_read_compress   : 46.6 ms ± 6.67 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
test_hdf_table_read            : 56 ms ± 1.14 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
test_hdf_table_read_compress   : 58.3 ms ± 6.58 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
test_csv_read                  : 487 ms ± 34.2 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_feather_read              : 12.9 ms ± 144 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
test_pickle_read               : 11.3 ms ± 269 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
test_pickle_read_compress      : 582 ms ± 8.85 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
test_parquet_read              : 25.8 ms ± 6.61 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

The files test.pkl.compress, test.parquet and test.feather took the least space on disk (in bytes).
```shell
29519500 Oct 10 06:45 test.csv
16000248 Oct 10 06:45 test.feather
8281983  Oct 10 06:49 test.parquet
16000857 Oct 10 06:47 test.pkl
7552144  Oct 10 06:48 test.pkl.compress
34816000 Oct 10 06:42 test.sql
24009288 Oct 10 06:43 test_fixed.hdf
24009288 Oct 10 06:43 test_fixed_compress.hdf
24458940 Oct 10 06:44 test_table.hdf
24458940 Oct 10 06:44 test_table_compress.hdf
```